[Killed] BlockStatement
modules/boleta/application/CrearBoletaApplicationService.js:12:89
  * CRÍTICO: Usa FOR UPDATE para evitar race conditions en stock
  */
 class CrearBoletaApplicationService {
-  constructor(boletaRepository, carritoRepository, productoRepository, socketIOEmitter) {
-    this.boletaRepository = boletaRepository;
-    this.carritoRepository = carritoRepository;
-    this.productoRepository = productoRepository;
-    this.socketIOEmitter = socketIOEmitter;
-  }
+  constructor(boletaRepository, carritoRepository, productoRepository, socketIOEmitter) {}
 
   /**
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrayDeclaration
modules/boleta/application/CrearBoletaApplicationService.js:39:59
 
       // 1. Obtener carrito
       const queryCarrito = 'SELECT * FROM carrito WHERE id_carrito = $1';
-      const resCarrito = await client.query(queryCarrito, [idCarrito]);
+      const resCarrito = await client.query(queryCarrito, []);
       
       if (resCarrito.rows.length === 0) {
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "SELECT * FROM carrito WHERE id_carrito = $1", [1]
Received
       1: "BEGIN"
       2
          "SELECT * FROM carrito WHERE id_carrito = $1",
        - Array [

[Killed] BlockStatement
modules/boleta/application/CrearBoletaApplicationService.js:41:41
       const queryCarrito = 'SELECT * FROM carrito WHERE id_carrito = $1';
       const resCarrito = await client.query(queryCarrito, [idCarrito]);
       
-      if (resCarrito.rows.length === 0) {
-        throw new Error('Carrito no encontrado');
-      }
+      if (resCarrito.rows.length === 0) {}
 
       // 2. Obtener items del carrito
killedBy: CrearBoletaApplicationService hace rollback cuando el carrito no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Carrito no encontrado"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      113 |       `);
      114 |           const resItems = await client.query(queryItems, stryMutAct_9fa48("12") ? [] : (stryCov_9fa48("12"), [idCarrito]));
    > 115 |           if (stryMutAct_9fa48("15") ? resItems.rows.lengt

[Killed] ConditionalExpression
modules/boleta/application/CrearBoletaApplicationService.js:41:11
       const queryCarrito = 'SELECT * FROM carrito WHERE id_carrito = $1';
       const resCarrito = await client.query(queryCarrito, [idCarrito]);
       
-      if (resCarrito.rows.length === 0) {
+      if (false) {
         throw new Error('Carrito no encontrado');
       }
killedBy: CrearBoletaApplicationService hace rollback cuando el carrito no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Carrito no encontrado"
Received message:   "Cannot read properties of undefined (reading 'rows')"

      113 |       `);
      114 |           const resItems = await client.query(queryItems, stryMutAct_9fa48("12") ? [] : (stryCov_9fa48("12"), [idCarrito]));
    > 115 |           if (stryMutAct_9fa48("15") ? resItems.rows.lengt

[Killed] StringLiteral
modules/boleta/application/CrearBoletaApplicationService.js:42:25
       const resCarrito = await client.query(queryCarrito, [idCarrito]);
       
       if (resCarrito.rows.length === 0) {
-        throw new Error('Carrito no encontrado');
+        throw new Error("");
       }
 
killedBy: CrearBoletaApplicationService hace rollback cuando el carrito no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Carrito no encontrado"
Received message:   ""

      101 |             } else {
      102 |               stryCov_9fa48("9");
    > 103 |               throw new Error(stryMutAct_9fa48("10") ? "" : (stryCov_9fa48("10"), 'Carrito no encontrado'));

[Killed] EqualityOperator
modules/boleta/application/CrearBoletaApplicationService.js:54:11
       `;
       const resItems = await client.query(queryItems, [idCarrito]);
 
-      if (resItems.rows.length === 0) {
+      if (resItems.rows.length !== 0) {
         throw new Error('Carrito vacío');
       }
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: Carrito vacío

[Killed] ConditionalExpression
modules/boleta/application/CrearBoletaApplicationService.js:54:11
       `;
       const resItems = await client.query(queryItems, [idCarrito]);
 
-      if (resItems.rows.length === 0) {
+      if (true) {
         throw new Error('Carrito vacío');
       }
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: Carrito vacío

[Killed] EqualityOperator
modules/boleta/application/CrearBoletaApplicationService.js:73:13
         const productoLocked = resLock.rows[0];
 
         // Validar stock nuevamente
-        if (productoLocked.stock < item.cantidad) {
+        if (productoLocked.stock >= item.cantidad) {
           throw new Error(`Stock insuficiente para producto ${item.id_producto}`);
         }
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: Stock insuficiente para producto 10

[Killed] ConditionalExpression
modules/boleta/application/CrearBoletaApplicationService.js:73:13
         const productoLocked = resLock.rows[0];
 
         // Validar stock nuevamente
-        if (productoLocked.stock < item.cantidad) {
+        if (true) {
           throw new Error(`Stock insuficiente para producto ${item.id_producto}`);
         }
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: Stock insuficiente para producto 10

[Survived] ArithmeticOperator
modules/boleta/application/CrearBoletaApplicationService.js:86:26
         await client.query(queryDecremento, [item.cantidad, item.id_producto]);
 
         // Acumular total
-        const subtotal = item.precio_unit * item.cantidad;
+        const subtotal = item.precio_unit / item.cantidad;
         totalBoleta += subtotal;
 

[Survived] AssignmentOperator
modules/boleta/application/CrearBoletaApplicationService.js:87:9
 
         // Acumular total
         const subtotal = item.precio_unit * item.cantidad;
-        totalBoleta += subtotal;
+        totalBoleta -= subtotal;
 
         detalleItems.push({

[Survived] ObjectLiteral
modules/boleta/application/CrearBoletaApplicationService.js:89:27
         const subtotal = item.precio_unit * item.cantidad;
         totalBoleta += subtotal;
 
-        detalleItems.push({
-          idProducto: item.id_producto,
-          cantidad: item.cantidad,
-          precio: item.precio_unit
-        });
+        detalleItems.push({});
       }
 

[Survived] ArrayDeclaration
modules/boleta/application/CrearBoletaApplicationService.js:103:57
         RETURNING id_boleta, tipo_venta, metodo_pago, total, estado_boleta, id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito
       `;
 
-      const resBoleta = await client.query(queryBoleta, [
-        tipoVenta,
-        metodoPago,
-        totalBoleta,
-        'pagado',
-        idCliente,
-        idEmpleado,
-        idLocal,
-        idCarrito
-      ]);
+      const resBoleta = await client.query(queryBoleta, []);
 
       const boletaCreada = resBoleta.rows[0];

[Survived] BlockStatement
modules/boleta/application/CrearBoletaApplicationService.js:117:40
       const boletaCreada = resBoleta.rows[0];
 
       // 5. Crear detalle_boleta
-      for (const item of detalleItems) {
-        const queryDetalle = `
-          INSERT INTO detalle_boleta (id_boleta, id_producto, cantidad)
-          VALUES ($1, $2, $3)
-        `;
-        await client.query(queryDetalle, [boletaCreada.id_boleta, item.idProducto, item.cantidad]);
-      }
+      for (const item of detalleItems) {}
 
       // 6. Marcar carrito como completado

[Survived] ArrayDeclaration
modules/boleta/application/CrearBoletaApplicationService.js:122:42
           INSERT INTO detalle_boleta (id_boleta, id_producto, cantidad)
           VALUES ($1, $2, $3)
         `;
-        await client.query(queryDetalle, [boletaCreada.id_boleta, item.idProducto, item.cantidad]);
+        await client.query(queryDetalle, []);
       }
 

[Survived] StringLiteral
modules/boleta/application/CrearBoletaApplicationService.js:126:36
       }
 
       // 6. Marcar carrito como completado
-      const queryCarritoCompleto = `
-        UPDATE carrito
-        SET estado = 'completado'
-        WHERE id_carrito = $1
-      `;
+      const queryCarritoCompleto = ``;
       await client.query(queryCarritoCompleto, [idCarrito]);
 

[Killed] ConditionalExpression
modules/boleta/application/CrearBoletaApplicationService.js:137:11
       await client.query('COMMIT');
 
       // 7. Emitir eventos (después de COMMIT exitoso)
-      if (this.socketIOEmitter) {
+      if (false) {
         const boleta = {
           id: boletaCreada.id_boleta,
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
modules/boleta/application/CrearBoletaApplicationService.js:137:33
       await client.query('COMMIT');
 
       // 7. Emitir eventos (después de COMMIT exitoso)
-      if (this.socketIOEmitter) {
-        const boleta = {
-          id: boletaCreada.id_boleta,
-          tipo: boletaCreada.tipo_venta,
-          total: boletaCreada.total,
-          timestamp: new Date()
-        };
-        
-        this.socketIOEmitter.emitirBoletaCreada(boleta);
-
-        // Emitir actualización de stock para cada producto
-        for (const item of detalleItems) {
-          const producto = await this.productoRepository.obtenerPorId(item.idProducto);
-          this.socketIOEmitter.emitirStockActualizado(producto);
-        }
-      }
+      if (this.socketIOEmitter) {}
 
       return {
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
modules/boleta/application/CrearBoletaApplicationService.js:148:42
         this.socketIOEmitter.emitirBoletaCreada(boleta);
 
         // Emitir actualización de stock para cada producto
-        for (const item of detalleItems) {
-          const producto = await this.productoRepository.obtenerPorId(item.idProducto);
-          this.socketIOEmitter.emitirStockActualizado(producto);
-        }
+        for (const item of detalleItems) {}
       }
 
killedBy: CrearBoletaApplicationService crea boleta y emite eventos cuando el carrito es válido
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id_producto": 10, "stock": 3}

Number of calls: 0

[Killed] BlockStatement
modules/boleta/application/CrearBoletaApplicationService.js:161:21
         mensaje: 'Boleta creada exitosamente'
       };
 
-    } catch (error) {
-      await client.query('ROLLBACK');
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       client.release();
     }
killedBy: CrearBoletaApplicationService hace rollback cuando el carrito no existe
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
