[Killed] BlockStatement
usuario/presentation/controllers/AutenticacionController.js:6:48
  * Maneja login y registro
  */
 class AutenticacionController {
-  constructor(autenticacionApplicationService) {
-    this.autenticacionApplicationService = autenticacionApplicationService;
-  }
+  constructor(autenticacionApplicationService) {}
 
   /**
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Timeout] BlockStatement
usuario/presentation/controllers/AutenticacionController.js:13:31
   /**
    * POST /auth/login
    */
-  async login(req, res, next) {
-    try {
-      const { username, password } = req.body;
-
-      if (!username || !password) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'CREDENCIALES_INCOMPLETAS',
-          mensaje: 'Username y password son requeridos'
-        });
-      }
-
-      const resultado = await this.autenticacionApplicationService.loginAdministrador(username, password);
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async login(req, res, next) {}
 
   /**

[Timeout] BlockStatement
usuario/presentation/controllers/AutenticacionController.js:14:9
    * POST /auth/login
    */
   async login(req, res, next) {
-    try {
-      const { username, password } = req.body;
-
-      if (!username || !password) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'CREDENCIALES_INCOMPLETAS',
-          mensaje: 'Username y password son requeridos'
-        });
-      }
-
-      const resultado = await this.autenticacionApplicationService.loginAdministrador(username, password);
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[Killed] BooleanLiteral
usuario/presentation/controllers/AutenticacionController.js:17:24
     try {
       const { username, password } = req.body;
 
-      if (!username || !password) {
+      if (!username || password) {
         return res.status(400).json({
           success: false,
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[NoCoverage] StringLiteral
usuario/presentation/controllers/AutenticacionController.js:20:19
       if (!username || !password) {
         return res.status(400).json({
           success: false,
-          codigo: 'CREDENCIALES_INCOMPLETAS',
+          codigo: "",
           mensaje: 'Username y password son requeridos'
         });

[Timeout] BlockStatement
usuario/presentation/controllers/AutenticacionController.js:40:9
    * POST /auth/registro
    */
   async registro(req, res, next) {
-    try {
-      const { username, password, nombre, apellidos } = req.body;
-
-      if (!username || !password || !nombre) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'DATOS_INCOMPLETOS',
-          mensaje: 'Username, password y nombre son requeridos'
-        });
-      }
-
-      const resultado = await this.autenticacionApplicationService.registroAdministrador(
-        username,
-        password,
-        nombre,
-        apellidos
-      );
-
-      return res.status(201).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[Killed] BooleanLiteral
usuario/presentation/controllers/AutenticacionController.js:43:11
     try {
       const { username, password, nombre, apellidos } = req.body;
 
-      if (!username || !password || !nombre) {
+      if (username || !password || !nombre) {
         return res.status(400).json({
           success: false,
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
usuario/presentation/controllers/AutenticacionController.js:43:11
     try {
       const { username, password, nombre, apellidos } = req.body;
 
-      if (!username || !password || !nombre) {
+      if (true) {
         return res.status(400).json({
           success: false,
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
usuario/presentation/controllers/AutenticacionController.js:70:40
   /**
    * POST /auth/verificar-token
    */
-  async verificarToken(req, res, next) {
-    try {
-      const token = req.headers.authorization?.split(' ')[1];
-
-      if (!token) {
-        return res.status(401).json({
-          success: false,
-          codigo: 'TOKEN_AUSENTE',
-          mensaje: 'Token no proporcionado'
-        });
-      }
-
-      const decoded = await this.autenticacionApplicationService.verificarToken(token);
-
-      return res.status(200).json({
-        success: true,
-        data: decoded
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async verificarToken(req, res, next) {}
 }
 
killedBy: Autenticacion - integracion debe verificar token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
usuario/presentation/controllers/AutenticacionController.js:71:9
    * POST /auth/verificar-token
    */
   async verificarToken(req, res, next) {
-    try {
-      const token = req.headers.authorization?.split(' ')[1];
-
-      if (!token) {
-        return res.status(401).json({
-          success: false,
-          codigo: 'TOKEN_AUSENTE',
-          mensaje: 'Token no proporcionado'
-        });
-      }
-
-      const decoded = await this.autenticacionApplicationService.verificarToken(token);
-
-      return res.status(200).json({
-        success: true,
-        data: decoded
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
killedBy: Autenticacion - integracion debe verificar token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] OptionalChaining
usuario/presentation/controllers/AutenticacionController.js:72:21
    */
   async verificarToken(req, res, next) {
     try {
-      const token = req.headers.authorization?.split(' ')[1];
+      const token = req.headers.authorization.split(' ')[1];
 
       if (!token) {

[NoCoverage] BooleanLiteral
usuario/presentation/controllers/AutenticacionController.js:76:20
 
       if (!token) {
         return res.status(401).json({
-          success: false,
+          success: true,
           codigo: 'TOKEN_AUSENTE',
           mensaje: 'Token no proporcionado'

[Killed] ObjectLiteral
usuario/presentation/controllers/AutenticacionController.js:84:35
 
       const decoded = await this.autenticacionApplicationService.verificarToken(token);
 
-      return res.status(200).json({
-        success: true,
-        data: decoded
-      });
+      return res.status(200).json({});
     } catch (error) {
       next(error);
killedBy: Autenticacion - integracion debe verificar token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
