[Survived] StringLiteral
boleta/domain/entities/Boleta.js:12:16
  */
 class Boleta {
   static ESTADOS = {
-    PENDIENTE: 'pendiente',
+    PENDIENTE: "",
     PAGADO: 'pagado',
     CANCELADO: 'cancelado'

[Survived] StringLiteral
boleta/domain/entities/Boleta.js:14:16
   static ESTADOS = {
     PENDIENTE: 'pendiente',
     PAGADO: 'pagado',
-    CANCELADO: 'cancelado'
+    CANCELADO: ""
   };
 

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:17:120
     CANCELADO: 'cancelado'
   };
 
-  constructor(id, tipoVenta, total, metodoPago, idCliente = null, idEmpleado = null, idLocal = null, idCarrito = null) {
-    this.id = id;
-    this.tipoVenta = tipoVenta instanceof TipoVenta ? tipoVenta : new TipoVenta(tipoVenta);
-    this.total = total instanceof Precio ? total : new Precio(total);
-    this.metodoPago = metodoPago;
-    this.idCliente = idCliente;
-    this.idEmpleado = idEmpleado;
-    this.idLocal = idLocal;
-    this.idCarrito = idCarrito;
-    this.estado = Boleta.ESTADOS.PENDIENTE;
-    this.items = [];
-    this.fechaEmision = new Date();
-    this.createdAt = new Date();
-  }
+  constructor(id, tipoVenta, total, metodoPago, idCliente = null, idEmpleado = null, idLocal = null, idCarrito = null) {}
 
   /**
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArrayDeclaration
boleta/domain/entities/Boleta.js:27:18
     this.idLocal = idLocal;
     this.idCarrito = idCarrito;
     this.estado = Boleta.ESTADOS.PENDIENTE;
-    this.items = [];
+    this.items = ["Stryker was here"];
     this.fechaEmision = new Date();
     this.createdAt = new Date();
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ConditionalExpression
boleta/domain/entities/Boleta.js:37:9
    */
   validar() {
     // Validar tipo de venta
-    if (!this.tipoVenta) {
+    if (true) {
       throw new BoletaInvalidaException('Tipo de venta es requerido');
     }
killedBy: Boleta valida boleta online con cliente y boleta física con empleado
statusReason: Error: expect(received).not.toThrow()

Error name:    "BoletaInvalidaException"
Error message: "Tipo de venta es requerido"

       95 |         } else {
       96 |           stryCov_9fa48("62");
    >  97 |           throw new BoletaInvalidaException(stryMutAct_9fa48("63") ? "" : (stryCov_9fa48("63"), 'Tipo de venta es requerido'));

[Killed] BooleanLiteral
boleta/domain/entities/Boleta.js:37:9
    */
   validar() {
     // Validar tipo de venta
-    if (!this.tipoVenta) {
+    if (this.tipoVenta) {
       throw new BoletaInvalidaException('Tipo de venta es requerido');
     }
killedBy: BoletaRepository guardar persiste y devuelve la boleta creada
statusReason: BoletaInvalidaException: Tipo de venta es requerido

[Killed] ConditionalExpression
boleta/domain/entities/Boleta.js:42:9
     }
 
     // Validar total
-    if (this.total.monto <= 0) {
+    if (true) {
       throw new BoletaInvalidaException('Total debe ser mayor a 0');
     }
killedBy: BoletaRepository guardar persiste y devuelve la boleta creada
statusReason: BoletaInvalidaException: Total debe ser mayor a 0

[Killed] EqualityOperator
boleta/domain/entities/Boleta.js:42:9
     }
 
     // Validar total
-    if (this.total.monto <= 0) {
+    if (this.total.monto > 0) {
       throw new BoletaInvalidaException('Total debe ser mayor a 0');
     }
killedBy: Boleta valida boleta online con cliente y boleta física con empleado
statusReason: Error: expect(received).not.toThrow()

Error name:    "BoletaInvalidaException"
Error message: "Total debe ser mayor a 0"

      105 |         } else {
      106 |           stryCov_9fa48("68");
    > 107 |           throw new BoletaInvalidaException(stryMutAct_9fa48("69") ? "" : (stryCov_9fa48("69"), 'Total debe ser mayor a 0'));

[NoCoverage] StringLiteral
boleta/domain/entities/Boleta.js:43:41
 
     // Validar total
     if (this.total.monto <= 0) {
-      throw new BoletaInvalidaException('Total debe ser mayor a 0');
+      throw new BoletaInvalidaException("");
     }
 

[Killed] BooleanLiteral
boleta/domain/entities/Boleta.js:47:9
     }
 
     // Validar estado
-    if (!Object.values(Boleta.ESTADOS).includes(this.estado)) {
+    if (Object.values(Boleta.ESTADOS).includes(this.estado)) {
       throw new BoletaInvalidaException('Estado de boleta inválido');
     }
killedBy: BoletaRepository guardar persiste y devuelve la boleta creada
statusReason: BoletaInvalidaException: Estado de boleta inválido

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:47:63
     }
 
     // Validar estado
-    if (!Object.values(Boleta.ESTADOS).includes(this.estado)) {
-      throw new BoletaInvalidaException('Estado de boleta inválido');
-    }
+    if (!Object.values(Boleta.ESTADOS).includes(this.estado)) {}
 
     // Para venta online, debe tener cliente
killedBy: Boleta lanza excepción para estado inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Estado de boleta inválido"

Received function did not throw

[Killed] ConditionalExpression
boleta/domain/entities/Boleta.js:52:9
     }
 
     // Para venta online, debe tener cliente
-    if (this.tipoVenta.esOnline() && !this.idCliente) {
+    if (true) {
       throw new BoletaInvalidaException('Venta online requiere cliente');
     }
killedBy: BoletaRepository guardar persiste y devuelve la boleta creada
statusReason: BoletaInvalidaException: Venta online requiere cliente

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:52:55
     }
 
     // Para venta online, debe tener cliente
-    if (this.tipoVenta.esOnline() && !this.idCliente) {
-      throw new BoletaInvalidaException('Venta online requiere cliente');
-    }
+    if (this.tipoVenta.esOnline() && !this.idCliente) {}
 
     // Para venta física, debe tener empleado
killedBy: Boleta lanza excepción cuando venta online no tiene cliente
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BoletaInvalidaException

Received function did not throw

[Survived] StringLiteral
boleta/domain/entities/Boleta.js:53:41
 
     // Para venta online, debe tener cliente
     if (this.tipoVenta.esOnline() && !this.idCliente) {
-      throw new BoletaInvalidaException('Venta online requiere cliente');
+      throw new BoletaInvalidaException("");
     }
 

[Killed] ConditionalExpression
boleta/domain/entities/Boleta.js:57:9
     }
 
     // Para venta física, debe tener empleado
-    if (this.tipoVenta.esFisica() && !this.idEmpleado) {
+    if (false) {
       throw new BoletaInvalidaException('Venta física requiere empleado');
     }
killedBy: Boleta lanza excepción cuando venta física no tiene empleado
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BoletaInvalidaException

Received function did not throw

[Killed] BooleanLiteral
boleta/domain/entities/Boleta.js:57:38
     }
 
     // Para venta física, debe tener empleado
-    if (this.tipoVenta.esFisica() && !this.idEmpleado) {
+    if (this.tipoVenta.esFisica() && this.idEmpleado) {
       throw new BoletaInvalidaException('Venta física requiere empleado');
     }
killedBy: Boleta valida boleta online con cliente y boleta física con empleado
statusReason: Error: expect(received).not.toThrow()

Error name:    "BoletaInvalidaException"
Error message: "Venta física requiere empleado"

      135 |         } else {
      136 |           stryCov_9fa48("85");
    > 137 |           throw new BoletaInvalidaException(stryMutAct_9fa48("86") ? "" : (stryCov_9fa48("86"), 'Venta física requiere empleado'));

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:65:30
   /**
    * Cambiar estado
    */
-  cambiarEstado(nuevoEstado) {
-    const transiciones = {
-      [Boleta.ESTADOS.PENDIENTE]: [Boleta.ESTADOS.PAGADO, Boleta.ESTADOS.CANCELADO],
-      [Boleta.ESTADOS.PAGADO]: [Boleta.ESTADOS.CANCELADO],
-      [Boleta.ESTADOS.CANCELADO]: []
-    };
-
-    if (!transiciones[this.estado]?.includes(nuevoEstado)) {
-      throw new BoletaInvalidaException(
-        `No se puede cambiar de ${this.estado} a ${nuevoEstado}`
-      );
-    }
-
-    this.estado = nuevoEstado;
-    return this;
-  }
+  cambiarEstado(nuevoEstado) {}
 
   /**
killedBy: Boleta cambiar estado funciona y rechaza transiciones inválidas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pagado"
Received: "pendiente"

[Killed] ArrayDeclaration
boleta/domain/entities/Boleta.js:68:32
   cambiarEstado(nuevoEstado) {
     const transiciones = {
       [Boleta.ESTADOS.PENDIENTE]: [Boleta.ESTADOS.PAGADO, Boleta.ESTADOS.CANCELADO],
-      [Boleta.ESTADOS.PAGADO]: [Boleta.ESTADOS.CANCELADO],
+      [Boleta.ESTADOS.PAGADO]: [],
       [Boleta.ESTADOS.CANCELADO]: []
     };
killedBy: Boleta marcarPagada y cancelar actualizan el estado correctamente
statusReason: BoletaInvalidaException: No se puede cambiar de pagado a cancelado

[Killed] ConditionalExpression
boleta/domain/entities/Boleta.js:72:9
       [Boleta.ESTADOS.CANCELADO]: []
     };
 
-    if (!transiciones[this.estado]?.includes(nuevoEstado)) {
+    if (true) {
       throw new BoletaInvalidaException(
         `No se puede cambiar de ${this.estado} a ${nuevoEstado}`
killedBy: Boleta cambiar estado funciona y rechaza transiciones inválidas
statusReason: BoletaInvalidaException: No se puede cambiar de pendiente a pagado

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:72:60
       [Boleta.ESTADOS.CANCELADO]: []
     };
 
-    if (!transiciones[this.estado]?.includes(nuevoEstado)) {
-      throw new BoletaInvalidaException(
-        `No se puede cambiar de ${this.estado} a ${nuevoEstado}`
-      );
-    }
+    if (!transiciones[this.estado]?.includes(nuevoEstado)) {}
 
     this.estado = nuevoEstado;
killedBy: Boleta cambiar estado funciona y rechaza transiciones inválidas
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BoletaInvalidaException

Received function did not throw

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:85:18
   /**
    * Marcar como pagada
    */
-  marcarPagada() {
-    return this.cambiarEstado(Boleta.ESTADOS.PAGADO);
-  }
+  marcarPagada() {}
 
   /**
killedBy: Boleta marcarPagada y cancelar actualizan el estado correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pagado"
Received: "pendiente"

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:92:14
   /**
    * Cancelar boleta
    */
-  cancelar() {
-    return this.cambiarEstado(Boleta.ESTADOS.CANCELADO);
-  }
+  cancelar() {}
 
   /**
killedBy: Boleta marcarPagada y cancelar actualizan el estado correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cancelado"
Received: "pagado"

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:99:14
   /**
    * ¿Es venta online?
    */
-  esOnline() {
-    return this.tipoVenta.esOnline();
-  }
+  esOnline() {}
 
   /**
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:106:14
   /**
    * ¿Es venta física?
    */
-  esFisica() {
-    return this.tipoVenta.esFisica();
-  }
+  esFisica() {}
 
   /**
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:113:16
   /**
    * ¿Está pagada?
    */
-  estaPagada() {
-    return this.estado === Boleta.ESTADOS.PAGADO;
-  }
+  estaPagada() {}
 
   /**
killedBy: Boleta cambiar estado funciona y rechaza transiciones inválidas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
boleta/domain/entities/Boleta.js:114:12
    * ¿Está pagada?
    */
   estaPagada() {
-    return this.estado === Boleta.ESTADOS.PAGADO;
+    return this.estado !== Boleta.ESTADOS.PAGADO;
   }
 
killedBy: Boleta cambiar estado funciona y rechaza transiciones inválidas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
boleta/domain/entities/Boleta.js:114:12
    * ¿Está pagada?
    */
   estaPagada() {
-    return this.estado === Boleta.ESTADOS.PAGADO;
+    return false;
   }
 
killedBy: Boleta cambiar estado funciona y rechaza transiciones inválidas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:120:19
   /**
    * ¿Está cancelada?
    */
-  estaCancelada() {
-    return this.estado === Boleta.ESTADOS.CANCELADO;
-  }
+  estaCancelada() {}
 
   /**
killedBy: Boleta marcarPagada y cancelar actualizan el estado correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
boleta/domain/entities/Boleta.js:121:12
    * ¿Está cancelada?
    */
   estaCancelada() {
-    return this.estado === Boleta.ESTADOS.CANCELADO;
+    return false;
   }
 
killedBy: Boleta marcarPagada y cancelar actualizan el estado correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
boleta/domain/entities/Boleta.js:121:12
    * ¿Está cancelada?
    */
   estaCancelada() {
-    return this.estado === Boleta.ESTADOS.CANCELADO;
+    return this.estado !== Boleta.ESTADOS.CANCELADO;
   }
 
killedBy: Boleta marcarPagada y cancelar actualizan el estado correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
boleta/domain/entities/Boleta.js:127:55
   /**
    * Agregar item
    */
-  agregarItem(idProducto, cantidad, precio, subtotal) {
-    this.items.push({
-      idProducto,
-      cantidad,
-      precio,
-      subtotal
-    });
-    return this;
-  }
+  agregarItem(idProducto, cantidad, precio, subtotal) {}
 }
 
killedBy: Boleta agregarItem aumenta la lista de items
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []
