[Killed] BlockStatement
boleta/domain/exceptions/BoletaInvalidaException.js:4:44
 const DomainException = require('../../../../shared/domain/exceptions/DomainException');
 
 class BoletaInvalidaException extends DomainException {
-  constructor(mensaje = 'Boleta inválida') {
-    super(mensaje, 422, 'BOLETA_INVALIDA');
-  }
+  constructor(mensaje = 'Boleta inválida') {}
 }
 
killedBy: Boleta lanza excepción cuando venta online no tiene cliente
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: BoletaInvalidaException
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
