[NoCoverage] BlockStatement
src/modules/boleta/index.js:6:38
 
 const boletaRoutes = require ('./presentation/routes/boletaRoutes');
 
-module.exports = (socketIOEmitter) =>{
-    const boletaRepository = new BoletaRepository()
-
-    const crearBoletaApplicationService = new CrearBoletaApplicationService(boletaRepository);
-
-    return boletaRoutes (
-        crearBoletaApplicationService
-    );
-};
+module.exports = (socketIOEmitter) =>{};
 
 
