[Killed] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:14:25
   /**
    * Guardar boleta (crear o actualizar)
    */
-  async guardar(boleta) {
-    boleta.validar();
-
-    const query = `
-      INSERT INTO boleta (tipo_venta, metodo_pago, total, estado_boleta, id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito, fecha_emision)
-      VALUES ($1, $2, $3, $4, $5, $6, $7, $8, NOW())
-      RETURNING id_boleta, tipo_venta, metodo_pago, total, estado_boleta, id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito
-    `;
-
-    const { rows } = await db.query(query, [
-      boleta.tipoVenta.toString(),
-      boleta.metodoPago,
-      boleta.total.monto,
-      boleta.estado,
-      boleta.idCliente,
-      boleta.idEmpleado,
-      boleta.idLocal,
-      boleta.idCarrito
-    ]);
-
-    return this._mapearABoleta(rows[0]);
-  }
+  async guardar(boleta) {}
 
   /**
killedBy: BoletaRepository guardar persiste y devuelve la boleta creada
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Boleta

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:40:32
   /**
    * Obtener boleta por ID
    */
-  async obtenerPorId(idBoleta) {
-    const query = `
-      SELECT id_boleta, tipo_venta, metodo_pago, total, estado_boleta, 
-             id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito, fecha_emision
-      FROM boleta
-      WHERE id_boleta = $1
-    `;
-
-    const { rows } = await db.query(query, [idBoleta]);
-
-    if (rows.length === 0) {
-      return null;
-    }
-
-    return this._mapearABoleta(rows[0]);
-  }
+  async obtenerPorId(idBoleta) {}
 
   /**
killedBy: BoletaRepository obtenerPorId devuelve una boleta cuando existe
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Boleta

Received value has no prototype
Received value: undefined

[Survived] StringLiteral
modules/boleta/infrastructure/BoletaRepository.js:41:19
    * Obtener boleta por ID
    */
   async obtenerPorId(idBoleta) {
-    const query = `
-      SELECT id_boleta, tipo_venta, metodo_pago, total, estado_boleta, 
-             id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito, fecha_emision
-      FROM boleta
-      WHERE id_boleta = $1
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [idBoleta]);

[Survived] ArrayDeclaration
modules/boleta/infrastructure/BoletaRepository.js:48:44
       WHERE id_boleta = $1
     `;
 
-    const { rows } = await db.query(query, [idBoleta]);
+    const { rows } = await db.query(query, []);
 
     if (rows.length === 0) {

[Killed] ConditionalExpression
modules/boleta/infrastructure/BoletaRepository.js:50:9
 
     const { rows } = await db.query(query, [idBoleta]);
 
-    if (rows.length === 0) {
+    if (false) {
       return null;
     }
killedBy: BoletaRepository obtenerPorId devuelve null cuando no encuentra la boleta
statusReason: TypeError: Cannot read properties of undefined (reading 'id_boleta')

[Killed] ConditionalExpression
modules/boleta/infrastructure/BoletaRepository.js:50:9
 
     const { rows } = await db.query(query, [idBoleta]);
 
-    if (rows.length === 0) {
+    if (true) {
       return null;
     }
killedBy: BoletaRepository obtenerPorId devuelve una boleta cuando existe
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Boleta

Received value has no prototype
Received value: null

[NoCoverage] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:60:38
   /**
    * Obtener boletas del cliente
    */
-  async obtenerPorCliente(idCliente) {
-    const query = `
-      SELECT id_boleta, tipo_venta, metodo_pago, total, estado_boleta,
-             id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito, fecha_emision
-      FROM boleta
-      WHERE id_cliente_boleta = $1 AND tipo_venta = 'online'
-      ORDER BY fecha_emision DESC
-    `;
-
-    const { rows } = await db.query(query, [idCliente]);
-    return rows.map(row => this._mapearABoleta(row));
-  }
+  async obtenerPorCliente(idCliente) {}
 
   /**

[NoCoverage] ArrowFunction
modules/boleta/infrastructure/BoletaRepository.js:70:21
     `;
 
     const { rows } = await db.query(query, [idCliente]);
-    return rows.map(row => this._mapearABoleta(row));
+    return rows.map(() => undefined);
   }
 

[NoCoverage] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:76:40
   /**
    * Obtener boletas del empleado
    */
-  async obtenerPorEmpleado(idEmpleado) {
-    const query = `
-      SELECT id_boleta, tipo_venta, metodo_pago, total, estado_boleta,
-             id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito, fecha_emision
-      FROM boleta
-      WHERE id_empleado_boleta = $1 AND tipo_venta = 'fisica'
-      ORDER BY fecha_emision DESC
-    `;
-
-    const { rows } = await db.query(query, [idEmpleado]);
-    return rows.map(row => this._mapearABoleta(row));
-  }
+  async obtenerPorEmpleado(idEmpleado) {}
 
   /**

[NoCoverage] StringLiteral
modules/boleta/infrastructure/BoletaRepository.js:77:19
    * Obtener boletas del empleado
    */
   async obtenerPorEmpleado(idEmpleado) {
-    const query = `
-      SELECT id_boleta, tipo_venta, metodo_pago, total, estado_boleta,
-             id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito, fecha_emision
-      FROM boleta
-      WHERE id_empleado_boleta = $1 AND tipo_venta = 'fisica'
-      ORDER BY fecha_emision DESC
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [idEmpleado]);

[NoCoverage] ArrowFunction
modules/boleta/infrastructure/BoletaRepository.js:86:21
     `;
 
     const { rows } = await db.query(query, [idEmpleado]);
-    return rows.map(row => this._mapearABoleta(row));
+    return rows.map(() => undefined);
   }
 

[NoCoverage] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:92:61
   /**
    * Obtener boletas pagadas
    */
-  async obtenerPagadas(fechaInicio = null, fechaFin = null) {
-    let query = `
-      SELECT id_boleta, tipo_venta, metodo_pago, total, estado_boleta,
-             id_cliente_boleta, id_empleado_boleta, id_locale, id_carrito, fecha_emision
-      FROM boleta
-      WHERE estado_boleta = 'pagado'
-    `;
-
-    const params = [];
-
-    if (fechaInicio && fechaFin) {
-      query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length + 2}`;
-      params.push(fechaInicio, fechaFin);
-    }
-
-    query += ` ORDER BY fecha_emision DESC`;
-
-    const { rows } = await db.query(query, params);
-    return rows.map(row => this._mapearABoleta(row));
-  }
+  async obtenerPagadas(fechaInicio = null, fechaFin = null) {}
 
   /**

[NoCoverage] LogicalOperator
modules/boleta/infrastructure/BoletaRepository.js:102:9
 
     const params = [];
 
-    if (fechaInicio && fechaFin) {
+    if (fechaInicio || fechaFin) {
       query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length + 2}`;
       params.push(fechaInicio, fechaFin);

[NoCoverage] ConditionalExpression
modules/boleta/infrastructure/BoletaRepository.js:102:9
 
     const params = [];
 
-    if (fechaInicio && fechaFin) {
+    if (true) {
       query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length + 2}`;
       params.push(fechaInicio, fechaFin);

[NoCoverage] ArithmeticOperator
modules/boleta/infrastructure/BoletaRepository.js:103:42
     const params = [];
 
     if (fechaInicio && fechaFin) {
-      query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length + 2}`;
+      query += ` AND fecha_emision >= $${params.length - 1} AND fecha_emision <= $${params.length + 2}`;
       params.push(fechaInicio, fechaFin);
     }

[NoCoverage] ArithmeticOperator
modules/boleta/infrastructure/BoletaRepository.js:103:85
     const params = [];
 
     if (fechaInicio && fechaFin) {
-      query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length + 2}`;
+      query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length - 2}`;
       params.push(fechaInicio, fechaFin);
     }

[NoCoverage] ArrowFunction
modules/boleta/infrastructure/BoletaRepository.js:110:21
     query += ` ORDER BY fecha_emision DESC`;
 
     const { rows } = await db.query(query, params);
-    return rows.map(row => this._mapearABoleta(row));
+    return rows.map(() => undefined);
   }
 

[Killed] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:116:49
   /**
    * Actualizar estado de boleta
    */
-  async actualizarEstado(idBoleta, nuevoEstado) {
-    const query = `
-      UPDATE boleta
-      SET estado_boleta = $1
-      WHERE id_boleta = $2
-      RETURNING id_boleta, estado_boleta
-    `;
-
-    const { rows } = await db.query(query, [nuevoEstado, idBoleta]);
-    return rows[0] || null;
-  }
+  async actualizarEstado(idBoleta, nuevoEstado) {}
 
   /**
killedBy: BoletaRepository actualizarEstado devuelve la fila actualizada
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"estado_boleta": "cancelado", "id_boleta": 12}
Received: undefined

[Survived] StringLiteral
modules/boleta/infrastructure/BoletaRepository.js:117:19
    * Actualizar estado de boleta
    */
   async actualizarEstado(idBoleta, nuevoEstado) {
-    const query = `
-      UPDATE boleta
-      SET estado_boleta = $1
-      WHERE id_boleta = $2
-      RETURNING id_boleta, estado_boleta
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [nuevoEstado, idBoleta]);

[Killed] ConditionalExpression
modules/boleta/infrastructure/BoletaRepository.js:125:12
     `;
 
     const { rows } = await db.query(query, [nuevoEstado, idBoleta]);
-    return rows[0] || null;
+    return true;
   }
 
killedBy: BoletaRepository actualizarEstado devuelve la fila actualizada
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"estado_boleta": "cancelado", "id_boleta": 12}
Received: true

[Killed] ConditionalExpression
modules/boleta/infrastructure/BoletaRepository.js:125:12
     `;
 
     const { rows } = await db.query(query, [nuevoEstado, idBoleta]);
-    return rows[0] || null;
+    return false;
   }
 
killedBy: BoletaRepository actualizarEstado devuelve la fila actualizada
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"estado_boleta": "cancelado", "id_boleta": 12}
Received: false

[Killed] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:131:65
   /**
    * Obtener total de ventas
    */
-  async obtenerTotalVentas(fechaInicio = null, fechaFin = null) {
-    let query = `
-      SELECT SUM(total) as total_ventas
-      FROM boleta
-      WHERE estado_boleta = 'pagado'
-    `;
-
-    const params = [];
-
-    if (fechaInicio && fechaFin) {
-      query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length + 2}`;
-      params.push(fechaInicio, fechaFin);
-    }
-
-    const { rows } = await db.query(query, params);
-    return rows[0]?.total_ventas || 0;
-  }
+  async obtenerTotalVentas(fechaInicio = null, fechaFin = null) {}
 
   /**
killedBy: BoletaRepository obtenerTotalVentas devuelve 0 cuando no hay filas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Survived] StringLiteral
modules/boleta/infrastructure/BoletaRepository.js:132:17
    * Obtener total de ventas
    */
   async obtenerTotalVentas(fechaInicio = null, fechaFin = null) {
-    let query = `
-      SELECT SUM(total) as total_ventas
-      FROM boleta
-      WHERE estado_boleta = 'pagado'
-    `;
+    let query = ``;
 
     const params = [];

[Survived] ArrayDeclaration
modules/boleta/infrastructure/BoletaRepository.js:138:20
       WHERE estado_boleta = 'pagado'
     `;
 
-    const params = [];
+    const params = ["Stryker was here"];
 
     if (fechaInicio && fechaFin) {

[Survived] ConditionalExpression
modules/boleta/infrastructure/BoletaRepository.js:140:9
 
     const params = [];
 
-    if (fechaInicio && fechaFin) {
+    if (false) {
       query += ` AND fecha_emision >= $${params.length + 1} AND fecha_emision <= $${params.length + 2}`;
       params.push(fechaInicio, fechaFin);

[Killed] LogicalOperator
modules/boleta/infrastructure/BoletaRepository.js:146:12
     }
 
     const { rows } = await db.query(query, params);
-    return rows[0]?.total_ventas || 0;
+    return rows[0]?.total_ventas && 0;
   }
 
killedBy: BoletaRepository obtenerTotalVentas devuelve 0 cuando no hay filas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: null

[Killed] ConditionalExpression
modules/boleta/infrastructure/BoletaRepository.js:146:12
     }
 
     const { rows } = await db.query(query, params);
-    return rows[0]?.total_ventas || 0;
+    return false;
   }
 
killedBy: BoletaRepository obtenerTotalVentas devuelve 0 cuando no hay filas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: false

[Killed] BlockStatement
modules/boleta/infrastructure/BoletaRepository.js:152:24
   /**
    * Mapear fila de BD a Entidad Boleta
    */
-  _mapearABoleta(fila) {
-    const boleta = new Boleta(
-      fila.id_boleta,
-      new TipoVenta(fila.tipo_venta),
-      new Precio(fila.total),
-      fila.metodo_pago,
-      fila.id_cliente_boleta,
-      fila.id_empleado_boleta,
-      fila.id_locale,
-      fila.id_carrito
-    );
-
-    boleta.estado = fila.estado_boleta;
-    boleta.fechaEmision = fila.fecha_emision;
-
-    return boleta;
-  }
+  _mapearABoleta(fila) {}
 }
 
killedBy: BoletaRepository obtenerPorId devuelve una boleta cuando existe
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Boleta

Received value has no prototype
Received value: undefined
