[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:9:5
   constructor(
     crearBoletaApplicationService,
     boletaRepository
-  ) {
-    this.crearBoletaApplicationService = crearBoletaApplicationService;
-    this.boletaRepository = boletaRepository;
-  }
+  ) {}
 
   /**

[NoCoverage] BooleanLiteral
boleta/presentation/controllers/BoletaController.js:28:39
         idLocal
       } = req.body;
 
-      if (!idCarrito || !tipoVenta || !metodoPago) {
+      if (!idCarrito || !tipoVenta || metodoPago) {
         return res.status(400).json({
           success: false,

[NoCoverage] BooleanLiteral
boleta/presentation/controllers/BoletaController.js:28:11
         idLocal
       } = req.body;
 
-      if (!idCarrito || !tipoVenta || !metodoPago) {
+      if (idCarrito || !tipoVenta || !metodoPago) {
         return res.status(400).json({
           success: false,

[NoCoverage] ObjectLiteral
boleta/presentation/controllers/BoletaController.js:29:37
       } = req.body;
 
       if (!idCarrito || !tipoVenta || !metodoPago) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'DATOS_INCOMPLETOS',
-          mensaje: 'Datos incompletos para crear boleta'
-        });
+        return res.status(400).json({});
       }
 

[NoCoverage] BooleanLiteral
boleta/presentation/controllers/BoletaController.js:46:18
       });
 
       return res.status(201).json({
-        success: true,
+        success: false,
         data: resultado
       });

[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:49:21
         success: true,
         data: resultado
       });
-    } catch (error) {
-      next(error);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:58:9
    * GET /boletas/:id
    */
   async obtenerPorId(req, res, next) {
-    try {
-      const { id } = req.params;
-
-      const boleta = await this.boletaRepository.obtenerPorId(parseInt(id));
-
-      if (!boleta) {
-        return res.status(404).json({
-          success: false,
-          codigo: 'BOLETA_NO_ENCONTRADA',
-          mensaje: 'Boleta no encontrada'
-        });
-      }
-
-      return res.status(200).json({
-        success: true,
-        data: {
-          idBoleta: boleta.id,
-          tipoVenta: boleta.tipoVenta.toString(),
-          total: boleta.total.monto,
-          metodoPago: boleta.metodoPago,
-          estado: boleta.estado,
-          fechaEmision: boleta.fechaEmision
-        }
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] ConditionalExpression
boleta/presentation/controllers/BoletaController.js:63:11
 
       const boleta = await this.boletaRepository.obtenerPorId(parseInt(id));
 
-      if (!boleta) {
+      if (true) {
         return res.status(404).json({
           success: false,

[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:63:20
 
       const boleta = await this.boletaRepository.obtenerPorId(parseInt(id));
 
-      if (!boleta) {
-        return res.status(404).json({
-          success: false,
-          codigo: 'BOLETA_NO_ENCONTRADA',
-          mensaje: 'Boleta no encontrada'
-        });
-      }
+      if (!boleta) {}
 
       return res.status(200).json({

[NoCoverage] ObjectLiteral
boleta/presentation/controllers/BoletaController.js:64:37
       const boleta = await this.boletaRepository.obtenerPorId(parseInt(id));
 
       if (!boleta) {
-        return res.status(404).json({
-          success: false,
-          codigo: 'BOLETA_NO_ENCONTRADA',
-          mensaje: 'Boleta no encontrada'
-        });
+        return res.status(404).json({});
       }
 

[NoCoverage] StringLiteral
boleta/presentation/controllers/BoletaController.js:66:19
       if (!boleta) {
         return res.status(404).json({
           success: false,
-          codigo: 'BOLETA_NO_ENCONTRADA',
+          codigo: "",
           mensaje: 'Boleta no encontrada'
         });

[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:90:43
   /**
    * GET /boletas/cliente/:idCliente
    */
-  async obtenerPorCliente(req, res, next) {
-    try {
-      const { idCliente } = req.params;
-
-      const boletas = await this.boletaRepository.obtenerPorCliente(parseInt(idCliente));
-
-      return res.status(200).json({
-        success: true,
-        data: {
-          cantidad: boletas.length,
-          boletas: boletas.map(b => ({
-            idBoleta: b.id,
-            tipoVenta: b.tipoVenta.toString(),
-            total: b.total.monto,
-            estado: b.estado,
-            fechaEmision: b.fechaEmision
-          }))
-        }
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerPorCliente(req, res, next) {}
 
   /**

[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:91:9
    * GET /boletas/cliente/:idCliente
    */
   async obtenerPorCliente(req, res, next) {
-    try {
-      const { idCliente } = req.params;
-
-      const boletas = await this.boletaRepository.obtenerPorCliente(parseInt(idCliente));
-
-      return res.status(200).json({
-        success: true,
-        data: {
-          cantidad: boletas.length,
-          boletas: boletas.map(b => ({
-            idBoleta: b.id,
-            tipoVenta: b.tipoVenta.toString(),
-            total: b.total.monto,
-            estado: b.estado,
-            fechaEmision: b.fechaEmision
-          }))
-        }
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] ObjectLiteral
boleta/presentation/controllers/BoletaController.js:98:15
 
       return res.status(200).json({
         success: true,
-        data: {
-          cantidad: boletas.length,
-          boletas: boletas.map(b => ({
-            idBoleta: b.id,
-            tipoVenta: b.tipoVenta.toString(),
-            total: b.total.monto,
-            estado: b.estado,
-            fechaEmision: b.fechaEmision
-          }))
-        }
+        data: {}
       });
     } catch (error) {

[NoCoverage] ArrowFunction
boleta/presentation/controllers/BoletaController.js:100:32
         success: true,
         data: {
           cantidad: boletas.length,
-          boletas: boletas.map(b => ({
-            idBoleta: b.id,
-            tipoVenta: b.tipoVenta.toString(),
-            total: b.total.monto,
-            estado: b.estado,
-            fechaEmision: b.fechaEmision
-          }))
+          boletas: boletas.map(() => undefined)
         }
       });

[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:117:44
   /**
    * GET /boletas/empleado/:idEmpleado
    */
-  async obtenerPorEmpleado(req, res, next) {
-    try {
-      const { idEmpleado } = req.params;
-
-      const boletas = await this.boletaRepository.obtenerPorEmpleado(parseInt(idEmpleado));
-
-      return res.status(200).json({
-        success: true,
-        data: {
-          cantidad: boletas.length,
-          boletas: boletas.map(b => ({
-            idBoleta: b.id,
-            tipoVenta: b.tipoVenta.toString(),
-            total: b.total.monto,
-            estado: b.estado,
-            fechaEmision: b.fechaEmision
-          }))
-        }
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerPorEmpleado(req, res, next) {}
 
   /**

[NoCoverage] BlockStatement
boleta/presentation/controllers/BoletaController.js:118:9
    * GET /boletas/empleado/:idEmpleado
    */
   async obtenerPorEmpleado(req, res, next) {
-    try {
-      const { idEmpleado } = req.params;
-
-      const boletas = await this.boletaRepository.obtenerPorEmpleado(parseInt(idEmpleado));
-
-      return res.status(200).json({
-        success: true,
-        data: {
-          cantidad: boletas.length,
-          boletas: boletas.map(b => ({
-            idBoleta: b.id,
-            tipoVenta: b.tipoVenta.toString(),
-            total: b.total.monto,
-            estado: b.estado,
-            fechaEmision: b.fechaEmision
-          }))
-        }
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] ObjectLiteral
boleta/presentation/controllers/BoletaController.js:123:35
 
       const boletas = await this.boletaRepository.obtenerPorEmpleado(parseInt(idEmpleado));
 
-      return res.status(200).json({
-        success: true,
-        data: {
-          cantidad: boletas.length,
-          boletas: boletas.map(b => ({
-            idBoleta: b.id,
-            tipoVenta: b.tipoVenta.toString(),
-            total: b.total.monto,
-            estado: b.estado,
-            fechaEmision: b.fechaEmision
-          }))
-        }
-      });
+      return res.status(200).json({});
     } catch (error) {
       next(error);

[NoCoverage] ConditionalExpression
boleta/presentation/controllers/BoletaController.js:149:11
       const { id } = req.params;
       const { nuevoEstado } = req.body;
 
-      if (!nuevoEstado) {
+      if (false) {
         return res.status(400).json({
           success: false,

[NoCoverage] ConditionalExpression
boleta/presentation/controllers/BoletaController.js:149:11
       const { id } = req.params;
       const { nuevoEstado } = req.body;
 
-      if (!nuevoEstado) {
+      if (true) {
         return res.status(400).json({
           success: false,

[NoCoverage] StringLiteral
boleta/presentation/controllers/BoletaController.js:153:20
         return res.status(400).json({
           success: false,
           codigo: 'DATOS_INCOMPLETOS',
-          mensaje: 'nuevoEstado es requerido'
+          mensaje: ""
         });
       }

[NoCoverage] BooleanLiteral
boleta/presentation/controllers/BoletaController.js:159:11
 
       const resultado = await this.boletaRepository.actualizarEstado(parseInt(id), nuevoEstado);
 
-      if (!resultado) {
+      if (resultado) {
         return res.status(404).json({
           success: false,

[NoCoverage] ObjectLiteral
boleta/presentation/controllers/BoletaController.js:167:35
         });
       }
 
-      return res.status(200).json({
-        success: true,
-        data: {
-          idBoleta: resultado.id_boleta,
-          estado: resultado.estado_boleta,
-          mensaje: 'Estado actualizado'
-        }
-      });
+      return res.status(200).json({});
     } catch (error) {
       next(error);

[NoCoverage] StringLiteral
boleta/presentation/controllers/BoletaController.js:172:20
         data: {
           idBoleta: resultado.id_boleta,
           estado: resultado.estado_boleta,
-          mensaje: 'Estado actualizado'
+          mensaje: ""
         }
       });
