[NoCoverage] BlockStatement
boleta/presentation/routes/boletaRoutes.js:10:6
 module.exports = (
   crearBoletaApplicationService,
   boletaRepository
-) => {
-  const router = express.Router();
-  const controller = new BoletaController(
-    crearBoletaApplicationService,
-    boletaRepository
-  );
-
-  // POST /boletas (requiere administrador o empleado)
-  router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['idCarrito', 'tipoVenta', 'metodoPago']), (req, res, next) => controller.crear(req, res, next));
-
-  // GET /boletas/cliente/:idCliente (ANTES de /:id)
-  router.get('/cliente/:idCliente', autenticacionMiddleware, (req, res, next) => controller.obtenerPorCliente(req, res, next));
-
-  // GET /boletas/empleado/:idEmpleado (ANTES de /:id)
-  router.get('/empleado/:idEmpleado', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerPorEmpleado(req, res, next));
-
-  // GET /boletas/:id (dinámica, va después)
-  router.get('/:id', autenticacionMiddleware, (req, res, next) => controller.obtenerPorId(req, res, next));
-
-  // PUT /boletas/:id/estado (requiere administrador o empleado)
-  router.put('/:id/estado', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['nuevoEstado']), (req, res, next) => controller.actualizarEstado(req, res, next));
-
-  return router;
-};
+) => {};
 

[NoCoverage] ArrowFunction
boleta/presentation/routes/boletaRoutes.js:18:138
   );
 
   // POST /boletas (requiere administrador o empleado)
-  router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['idCarrito', 'tipoVenta', 'metodoPago']), (req, res, next) => controller.crear(req, res, next));
+  router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['idCarrito', 'tipoVenta', 'metodoPago']), () => undefined);
 
   // GET /boletas/cliente/:idCliente (ANTES de /:id)

[NoCoverage] StringLiteral
boleta/presentation/routes/boletaRoutes.js:18:15
   );
 
   // POST /boletas (requiere administrador o empleado)
-  router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['idCarrito', 'tipoVenta', 'metodoPago']), (req, res, next) => controller.crear(req, res, next));
+  router.post("", autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['idCarrito', 'tipoVenta', 'metodoPago']), (req, res, next) => controller.crear(req, res, next));
 
   // GET /boletas/cliente/:idCliente (ANTES de /:id)

[NoCoverage] ArrowFunction
boleta/presentation/routes/boletaRoutes.js:21:62
   router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['idCarrito', 'tipoVenta', 'metodoPago']), (req, res, next) => controller.crear(req, res, next));
 
   // GET /boletas/cliente/:idCliente (ANTES de /:id)
-  router.get('/cliente/:idCliente', autenticacionMiddleware, (req, res, next) => controller.obtenerPorCliente(req, res, next));
+  router.get('/cliente/:idCliente', autenticacionMiddleware, () => undefined);
 
   // GET /boletas/empleado/:idEmpleado (ANTES de /:id)

[NoCoverage] ArrowFunction
boleta/presentation/routes/boletaRoutes.js:24:81
   router.get('/cliente/:idCliente', autenticacionMiddleware, (req, res, next) => controller.obtenerPorCliente(req, res, next));
 
   // GET /boletas/empleado/:idEmpleado (ANTES de /:id)
-  router.get('/empleado/:idEmpleado', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerPorEmpleado(req, res, next));
+  router.get('/empleado/:idEmpleado', autenticacionMiddleware, esAdministrador, () => undefined);
 
   // GET /boletas/:id (dinámica, va después)

[NoCoverage] ArrowFunction
boleta/presentation/routes/boletaRoutes.js:27:47
   router.get('/empleado/:idEmpleado', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerPorEmpleado(req, res, next));
 
   // GET /boletas/:id (dinámica, va después)
-  router.get('/:id', autenticacionMiddleware, (req, res, next) => controller.obtenerPorId(req, res, next));
+  router.get('/:id', autenticacionMiddleware, () => undefined);
 
   // PUT /boletas/:id/estado (requiere administrador o empleado)

[NoCoverage] ArrowFunction
boleta/presentation/routes/boletaRoutes.js:30:122
   router.get('/:id', autenticacionMiddleware, (req, res, next) => controller.obtenerPorId(req, res, next));
 
   // PUT /boletas/:id/estado (requiere administrador o empleado)
-  router.put('/:id/estado', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['nuevoEstado']), (req, res, next) => controller.actualizarEstado(req, res, next));
+  router.put('/:id/estado', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['nuevoEstado']), () => undefined);
 
   return router;

[NoCoverage] ArrayDeclaration
boleta/presentation/routes/boletaRoutes.js:30:104
   router.get('/:id', autenticacionMiddleware, (req, res, next) => controller.obtenerPorId(req, res, next));
 
   // PUT /boletas/:id/estado (requiere administrador o empleado)
-  router.put('/:id/estado', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['nuevoEstado']), (req, res, next) => controller.actualizarEstado(req, res, next));
+  router.put('/:id/estado', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos([]), (req, res, next) => controller.actualizarEstado(req, res, next));
 
   return router;
