[NoCoverage] BlockStatement
modules/carrito/application/AgregarProductoCarritoApplicationService.js:6:71
  * Orquesta agregación de producto al carrito
  */
 class AgregarProductoCarritoApplicationService {
-  constructor(carritoRepository, productoRepository, socketIOEmitter) {
-    this.carritoRepository = carritoRepository;
-    this.productoRepository = productoRepository;
-    this.socketIOEmitter = socketIOEmitter;
-  }
+  constructor(carritoRepository, productoRepository, socketIOEmitter) {}
 
   /**

[NoCoverage] ConditionalExpression
modules/carrito/application/AgregarProductoCarritoApplicationService.js:19:9
     const { idCarrito, idProducto, cantidad } = comando;
 
     // 1. Validar cantidad
-    if (cantidad <= 0) {
+    if (true) {
       throw new Error('Cantidad debe ser mayor a 0');
     }

[NoCoverage] EqualityOperator
modules/carrito/application/AgregarProductoCarritoApplicationService.js:19:9
     const { idCarrito, idProducto, cantidad } = comando;
 
     // 1. Validar cantidad
-    if (cantidad <= 0) {
+    if (cantidad > 0) {
       throw new Error('Cantidad debe ser mayor a 0');
     }

[NoCoverage] ConditionalExpression
modules/carrito/application/AgregarProductoCarritoApplicationService.js:26:9
     // 2. Obtener producto
     const producto = await this.productoRepository.obtenerPorId(idProducto);
     
-    if (!producto) {
+    if (true) {
       throw new Error('Producto no encontrado');
     }

[NoCoverage] BlockStatement
modules/carrito/application/AgregarProductoCarritoApplicationService.js:26:20
     // 2. Obtener producto
     const producto = await this.productoRepository.obtenerPorId(idProducto);
     
-    if (!producto) {
-      throw new Error('Producto no encontrado');
-    }
+    if (!producto) {}
 
     // 3. Validar que hay stock

[NoCoverage] BooleanLiteral
modules/carrito/application/AgregarProductoCarritoApplicationService.js:31:9
     }
 
     // 3. Validar que hay stock
-    if (!producto.hayStockPara(cantidad)) {
+    if (producto.hayStockPara(cantidad)) {
       throw new Error(`Stock insuficiente. Disponible: ${producto.stock.cantidad}`);
     }

[NoCoverage] ConditionalExpression
modules/carrito/application/AgregarProductoCarritoApplicationService.js:31:9
     }
 
     // 3. Validar que hay stock
-    if (!producto.hayStockPara(cantidad)) {
+    if (true) {
       throw new Error(`Stock insuficiente. Disponible: ${producto.stock.cantidad}`);
     }

[NoCoverage] ConditionalExpression
modules/carrito/application/AgregarProductoCarritoApplicationService.js:38:9
     // 4. Obtener carrito
     const carrito = await this.carritoRepository.obtenerPorId(idCarrito);
     
-    if (!carrito) {
+    if (true) {
       throw new Error('Carrito no encontrado');
     }

[NoCoverage] ConditionalExpression
modules/carrito/application/AgregarProductoCarritoApplicationService.js:38:9
     // 4. Obtener carrito
     const carrito = await this.carritoRepository.obtenerPorId(idCarrito);
     
-    if (!carrito) {
+    if (false) {
       throw new Error('Carrito no encontrado');
     }

[NoCoverage] ConditionalExpression
modules/carrito/application/AgregarProductoCarritoApplicationService.js:49:9
     await this.carritoRepository.guardar(carrito);
 
     // 7. Emitir evento de actualización de stock
-    if (this.socketIOEmitter) {
+    if (false) {
       this.socketIOEmitter.emitirStockActualizado(producto);
     }

[NoCoverage] BlockStatement
modules/carrito/application/AgregarProductoCarritoApplicationService.js:49:31
     await this.carritoRepository.guardar(carrito);
 
     // 7. Emitir evento de actualización de stock
-    if (this.socketIOEmitter) {
-      this.socketIOEmitter.emitirStockActualizado(producto);
-    }
+    if (this.socketIOEmitter) {}
 
     return {

[NoCoverage] ObjectLiteral
modules/carrito/application/AgregarProductoCarritoApplicationService.js:53:12
       this.socketIOEmitter.emitirStockActualizado(producto);
     }
 
-    return {
-      idCarrito: carrito.id,
-      cantidadItems: carrito.cantidadItems(),
-      total: carrito.total.monto,
-      mensaje: 'Producto agregado al carrito'
-    };
+    return {};
   }
 }
