[NoCoverage] BlockStatement
src/modules/carrito/index.js:7:39
 
 const carritoRoutes = require('./presentation/routes/carritoRoutes');
 
-module.exports = (socketIOEmitter) => {
-  const carritoRepository = new CarritoRepository();
-  const productoRepository = new ProductoRepository();
-
-  const agregarProductoCarritoApplicationService = new AgregarProductoCarritoApplicationService(
-    carritoRepository,
-    productoRepository,
-    socketIOEmitter
-  );
-
-  return carritoRoutes(
-    agregarProductoCarritoApplicationService,
-    carritoRepository
-  );
-};
+module.exports = (socketIOEmitter) => {};
 
