[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:13:65
   /**
    * Crear nuevo carrito
    */
-  async crear(tipoCarrito, idCliente = null, idEmpleado = null) {
-    const query = `
-      INSERT INTO carrito (tipo_carrito, id_cliente, estado)
-      VALUES ($1, $2, 'activo')
-      RETURNING id_carrito
-    `;
-
-    const { rows } = await db.query(query, [tipoCarrito, idCliente]);
-    return rows[0].id_carrito;
-  }
+  async crear(tipoCarrito, idCliente = null, idEmpleado = null) {}
 
   /**

[NoCoverage] ArrayDeclaration
modules/carrito/infrastucture/CarritoRepository.js:20:44
       RETURNING id_carrito
     `;
 
-    const { rows } = await db.query(query, [tipoCarrito, idCliente]);
+    const { rows } = await db.query(query, []);
     return rows[0].id_carrito;
   }

[NoCoverage] ConditionalExpression
modules/carrito/infrastucture/CarritoRepository.js:33:9
     // Obtener carrito existente o crear uno nuevo
     let idCarrito = carrito.id;
 
-    if (!idCarrito) {
+    if (true) {
       idCarrito = await this.crear(carrito.tipoCarrito, carrito.idCliente, carrito.idEmpleado);
       carrito.id = idCarrito;

[NoCoverage] BooleanLiteral
modules/carrito/infrastucture/CarritoRepository.js:33:9
     // Obtener carrito existente o crear uno nuevo
     let idCarrito = carrito.id;
 
-    if (!idCarrito) {
+    if (idCarrito) {
       idCarrito = await this.crear(carrito.tipoCarrito, carrito.idCliente, carrito.idEmpleado);
       carrito.id = idCarrito;

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:42:39
     await db.query('DELETE FROM detalle_carrito WHERE id_carrito = $1', [idCarrito]);
 
     // Insertar items nuevos
-    for (const item of carrito.items) {
-      const queryItem = `
-        INSERT INTO detalle_carrito (id_carrito, id_producto, cantidad)
-        VALUES ($1, $2, $3)
-      `;
-
-      await db.query(queryItem, [idCarrito, item.idProducto, item.cantidad]);
-    }
+    for (const item of carrito.items) {}
 
     return carrito;

[NoCoverage] ConditionalExpression
modules/carrito/infrastucture/CarritoRepository.js:66:9
 
     const { rows: rowsCarrito } = await db.query(queryCarrito, [idCarrito]);
 
-    if (rowsCarrito.length === 0) {
+    if (false) {
       return null;
     }

[NoCoverage] ConditionalExpression
modules/carrito/infrastucture/CarritoRepository.js:66:9
 
     const { rows: rowsCarrito } = await db.query(queryCarrito, [idCarrito]);
 
-    if (rowsCarrito.length === 0) {
+    if (true) {
       return null;
     }

[NoCoverage] ArrayDeclaration
modules/carrito/infrastucture/CarritoRepository.js:81:60
       WHERE dc.id_carrito = $1
     `;
 
-    const { rows: rowsItems } = await db.query(queryItems, [idCarrito]);
+    const { rows: rowsItems } = await db.query(queryItems, []);
 
     const carrito = new Carrito(

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:90:35
       null
     );
 
-    for (const item of rowsItems) {
-      carrito.items.push({
-        idProducto: item.id_producto,
-        nombre: item.nombre,
-        precio: new Precio(item.precio_unit),
-        cantidad: item.cantidad,
-        subtotal: new Precio(item.precio_unit * item.cantidad)
-      });
-    }
+    for (const item of rowsItems) {}
 
     carrito.recalcularTotal();

[NoCoverage] ArithmeticOperator
modules/carrito/infrastucture/CarritoRepository.js:96:30
         nombre: item.nombre,
         precio: new Precio(item.precio_unit),
         cantidad: item.cantidad,
-        subtotal: new Precio(item.precio_unit * item.cantidad)
+        subtotal: new Precio(item.precio_unit / item.cantidad)
       });
     }

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:107:51
   /**
    * Obtener carrito activo del cliente
    */
-  async obtenerCarritoActivoPorCliente(idCliente) {
-    const query = `
-      SELECT id_carrito, tipo_carrito, id_cliente, estado
-      FROM carrito
-      WHERE id_cliente = $1 AND tipo_carrito = 'cliente' AND estado = 'activo'
-      LIMIT 1
-    `;
-
-    const { rows } = await db.query(query, [idCliente]);
-
-    if (rows.length === 0) {
-      return null;
-    }
-
-    return await this.obtenerPorId(rows[0].id_carrito);
-  }
+  async obtenerCarritoActivoPorCliente(idCliente) {}
 
   /**

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:117:28
 
     const { rows } = await db.query(query, [idCliente]);
 
-    if (rows.length === 0) {
-      return null;
-    }
+    if (rows.length === 0) {}
 
     return await this.obtenerPorId(rows[0].id_carrito);

[NoCoverage] EqualityOperator
modules/carrito/infrastucture/CarritoRepository.js:117:9
 
     const { rows } = await db.query(query, [idCliente]);
 
-    if (rows.length === 0) {
+    if (rows.length !== 0) {
       return null;
     }

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:127:53
   /**
    * Obtener carrito activo del vendedor
    */
-  async obtenerCarritoActivoPorEmpleado(idEmpleado) {
-    const query = `
-      SELECT id_carrito, tipo_carrito, id_cliente, estado
-      FROM carrito
-      WHERE id_cliente = $1 AND tipo_carrito = 'venta_fisica' AND estado = 'activo'
-      LIMIT 1
-    `;
-
-    const { rows } = await db.query(query, [idEmpleado]);
-
-    if (rows.length === 0) {
-      return null;
-    }
-
-    return await this.obtenerPorId(rows[0].id_carrito);
-  }
+  async obtenerCarritoActivoPorEmpleado(idEmpleado) {}
 
   /**

[NoCoverage] StringLiteral
modules/carrito/infrastucture/CarritoRepository.js:128:19
    * Obtener carrito activo del vendedor
    */
   async obtenerCarritoActivoPorEmpleado(idEmpleado) {
-    const query = `
-      SELECT id_carrito, tipo_carrito, id_cliente, estado
-      FROM carrito
-      WHERE id_cliente = $1 AND tipo_carrito = 'venta_fisica' AND estado = 'activo'
-      LIMIT 1
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [idEmpleado]);

[NoCoverage] EqualityOperator
modules/carrito/infrastucture/CarritoRepository.js:155:9
 
     const { rows } = await db.query(queryVerificar, [idCarrito, idProducto]);
 
-    if (rows.length > 0) {
+    if (rows.length >= 0) {
       // Actualizar cantidad
       const queryActualizar = `

[NoCoverage] ConditionalExpression
modules/carrito/infrastucture/CarritoRepository.js:155:9
 
     const { rows } = await db.query(queryVerificar, [idCarrito, idProducto]);
 
-    if (rows.length > 0) {
+    if (true) {
       // Actualizar cantidad
       const queryActualizar = `

[NoCoverage] StringLiteral
modules/carrito/infrastucture/CarritoRepository.js:157:31
 
     if (rows.length > 0) {
       // Actualizar cantidad
-      const queryActualizar = `
-        UPDATE detalle_carrito
-        SET cantidad = cantidad + $1
-        WHERE id_carrito = $2 AND id_producto = $3
-      `;
+      const queryActualizar = ``;
 
       await db.query(queryActualizar, [cantidad, idCarrito, idProducto]);

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:164:12
       `;
 
       await db.query(queryActualizar, [cantidad, idCarrito, idProducto]);
-    } else {
-      // Insertar nuevo item
-      const queryInsertar = `
-        INSERT INTO detalle_carrito (id_carrito, id_producto, cantidad)
-        VALUES ($1, $2, $3)
-      `;
-
-      await db.query(queryInsertar, [idCarrito, idProducto, cantidad]);
-    }
+    } else {}
   }
 

[NoCoverage] ArrayDeclaration
modules/carrito/infrastucture/CarritoRepository.js:171:37
         VALUES ($1, $2, $3)
       `;
 
-      await db.query(queryInsertar, [idCarrito, idProducto, cantidad]);
+      await db.query(queryInsertar, []);
     }
   }

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:178:45
   /**
    * Eliminar item del carrito
    */
-  async eliminarItem(idCarrito, idProducto) {
-    const query = `
-      DELETE FROM detalle_carrito
-      WHERE id_carrito = $1 AND id_producto = $2
-    `;
-
-    await db.query(query, [idCarrito, idProducto]);
-  }
+  async eliminarItem(idCarrito, idProducto) {}
 
   /**

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:190:27
   /**
    * Vaciar carrito
    */
-  async vaciar(idCarrito) {
-    const query = `
-      DELETE FROM detalle_carrito
-      WHERE id_carrito = $1
-    `;
-
-    await db.query(query, [idCarrito]);
-  }
+  async vaciar(idCarrito) {}
 
   /**

[NoCoverage] StringLiteral
modules/carrito/infrastucture/CarritoRepository.js:191:19
    * Vaciar carrito
    */
   async vaciar(idCarrito) {
-    const query = `
-      DELETE FROM detalle_carrito
-      WHERE id_carrito = $1
-    `;
+    const query = ``;
 
     await db.query(query, [idCarrito]);

[NoCoverage] BlockStatement
modules/carrito/infrastucture/CarritoRepository.js:202:29
   /**
    * Eliminar carrito
    */
-  async eliminar(idCarrito) {
-    const queryItems = `DELETE FROM detalle_carrito WHERE id_carrito = $1`;
-    const queryCarrito = `DELETE FROM carrito WHERE id_carrito = $1`;
-
-    await db.query(queryItems, [idCarrito]);
-    await db.query(queryCarrito, [idCarrito]);
-  }
+  async eliminar(idCarrito) {}
 }
 

[NoCoverage] ArrayDeclaration
modules/carrito/infrastucture/CarritoRepository.js:207:34
     const queryCarrito = `DELETE FROM carrito WHERE id_carrito = $1`;
 
     await db.query(queryItems, [idCarrito]);
-    await db.query(queryCarrito, [idCarrito]);
+    await db.query(queryCarrito, []);
   }
 }
