[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:9:5
   constructor(
     agregarProductoCarritoApplicationService,
     carritoRepository
-  ) {
-    this.agregarProductoCarritoApplicationService = agregarProductoCarritoApplicationService;
-    this.carritoRepository = carritoRepository;
-  }
+  ) {}
 
   /**

[NoCoverage] BooleanLiteral
carrito/presentation/controllers/CarritoController.js:21:11
     try {
       const { tipoCarrito, idCliente, idEmpleado } = req.body;
 
-      if (!tipoCarrito || (tipoCarrito === 'cliente' && !idCliente) || (tipoCarrito === 'venta_fisica' && !idEmpleado)) {
+      if (tipoCarrito || (tipoCarrito === 'cliente' && !idCliente) || (tipoCarrito === 'venta_fisica' && !idEmpleado)) {
         return res.status(400).json({
           success: false,

[NoCoverage] BooleanLiteral
carrito/presentation/controllers/CarritoController.js:21:107
     try {
       const { tipoCarrito, idCliente, idEmpleado } = req.body;
 
-      if (!tipoCarrito || (tipoCarrito === 'cliente' && !idCliente) || (tipoCarrito === 'venta_fisica' && !idEmpleado)) {
+      if (!tipoCarrito || (tipoCarrito === 'cliente' && !idCliente) || (tipoCarrito === 'venta_fisica' && idEmpleado)) {
         return res.status(400).json({
           success: false,

[NoCoverage] StringLiteral
carrito/presentation/controllers/CarritoController.js:24:19
       if (!tipoCarrito || (tipoCarrito === 'cliente' && !idCliente) || (tipoCarrito === 'venta_fisica' && !idEmpleado)) {
         return res.status(400).json({
           success: false,
-          codigo: 'DATOS_INCOMPLETOS',
+          codigo: "",
           mensaje: 'Datos incompletos para crear carrito'
         });

[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:52:9
    * GET /carritos/:id
    */
   async obtenerPorId(req, res, next) {
-    try {
-      const { id } = req.params;
-
-      const carrito = await this.carritoRepository.obtenerPorId(parseInt(id));
-
-      if (!carrito) {
-        return res.status(404).json({
-          success: false,
-          codigo: 'CARRITO_NO_ENCONTRADO',
-          mensaje: 'Carrito no encontrado'
-        });
-      }
-
-      return res.status(200).json({
-        success: true,
-        data: {
-          idCarrito: carrito.id,
-          tipoCarrito: carrito.tipoCarrito,
-          total: carrito.total.monto,
-          cantidadItems: carrito.cantidadItems(),
-          items: carrito.items
-        }
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:84:9
    * POST /carritos/:id/items
    */
   async agregarItem(req, res, next) {
-    try {
-      const { id } = req.params;
-      const { idProducto, cantidad } = req.body;
-
-      if (!idProducto || !cantidad) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'DATOS_INCOMPLETOS',
-          mensaje: 'idProducto y cantidad son requeridos'
-        });
-      }
-
-      const resultado = await this.agregarProductoCarritoApplicationService.ejecutar({
-        idCarrito: parseInt(id),
-        idProducto,
-        cantidad
-      });
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:88:37
       const { id } = req.params;
       const { idProducto, cantidad } = req.body;
 
-      if (!idProducto || !cantidad) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'DATOS_INCOMPLETOS',
-          mensaje: 'idProducto y cantidad son requeridos'
-        });
-      }
+      if (!idProducto || !cantidad) {}
 
       const resultado = await this.agregarProductoCarritoApplicationService.ejecutar({

[NoCoverage] ConditionalExpression
carrito/presentation/controllers/CarritoController.js:88:11
       const { id } = req.params;
       const { idProducto, cantidad } = req.body;
 
-      if (!idProducto || !cantidad) {
+      if (true) {
         return res.status(400).json({
           success: false,

[NoCoverage] StringLiteral
carrito/presentation/controllers/CarritoController.js:92:20
         return res.status(400).json({
           success: false,
           codigo: 'DATOS_INCOMPLETOS',
-          mensaje: 'idProducto y cantidad son requeridos'
+          mensaje: ""
         });
       }

[NoCoverage] ObjectLiteral
carrito/presentation/controllers/CarritoController.js:96:86
         });
       }
 
-      const resultado = await this.agregarProductoCarritoApplicationService.ejecutar({
-        idCarrito: parseInt(id),
-        idProducto,
-        cantidad
-      });
+      const resultado = await this.agregarProductoCarritoApplicationService.ejecutar({});
 
       return res.status(200).json({

[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:114:38
   /**
    * DELETE /carritos/:id/items/:idProducto
    */
-  async eliminarItem(req, res, next) {
-    try {
-      const { id, idProducto } = req.params;
-
-      await this.carritoRepository.eliminarItem(parseInt(id), parseInt(idProducto));
-
-      return res.status(200).json({
-        success: true,
-        mensaje: 'Item eliminado del carrito'
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async eliminarItem(req, res, next) {}
 
   /**

[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:115:9
    * DELETE /carritos/:id/items/:idProducto
    */
   async eliminarItem(req, res, next) {
-    try {
-      const { id, idProducto } = req.params;
-
-      await this.carritoRepository.eliminarItem(parseInt(id), parseInt(idProducto));
-
-      return res.status(200).json({
-        success: true,
-        mensaje: 'Item eliminado del carrito'
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] ObjectLiteral
carrito/presentation/controllers/CarritoController.js:120:35
 
       await this.carritoRepository.eliminarItem(parseInt(id), parseInt(idProducto));
 
-      return res.status(200).json({
-        success: true,
-        mensaje: 'Item eliminado del carrito'
-      });
+      return res.status(200).json({});
     } catch (error) {
       next(error);

[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:132:32
   /**
    * DELETE /carritos/:id
    */
-  async vaciar(req, res, next) {
-    try {
-      const { id } = req.params;
-
-      await this.carritoRepository.vaciar(parseInt(id));
-
-      return res.status(200).json({
-        success: true,
-        mensaje: 'Carrito vaciado'
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async vaciar(req, res, next) {}
 }
 

[NoCoverage] BlockStatement
carrito/presentation/controllers/CarritoController.js:133:9
    * DELETE /carritos/:id
    */
   async vaciar(req, res, next) {
-    try {
-      const { id } = req.params;
-
-      await this.carritoRepository.vaciar(parseInt(id));
-
-      return res.status(200).json({
-        success: true,
-        mensaje: 'Carrito vaciado'
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
