[NoCoverage] BlockStatement
carrito/presentation/routes/carritoRoutes.js:10:6
 module.exports = (
   agregarProductoCarritoApplicationService,
   carritoRepository
-) => {
-  const router = express.Router();
-  const controller = new CarritoController(
-    agregarProductoCarritoApplicationService,
-    carritoRepository
-  );
-
-  // POST /carritos (requiere administrador o empleado)
-  router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['tipoCarrito']), (req, res, next) => controller.crear(req, res, next));
-
-  // GET /carritos/:id (público por ahora)
-  router.get('/:id', (req, res, next) => controller.obtenerPorId(req, res, next));
-
-  // POST /carritos/:id/items (requiere autenticación)
-  router.post('/:id/items', autenticacionMiddleware, validarCamposRequeridos(['idProducto', 'cantidad']), validarPositivo('cantidad'), (req, res, next) => controller.agregarItem(req, res, next));
-
-  // DELETE /carritos/:id/items/:idProducto (requiere administrador o empleado)
-  router.delete('/:id/items/:idProducto', autenticacionMiddleware, esAdministradorOEmpleado, (req, res, next) => controller.eliminarItem(req, res, next));
-
-  // DELETE /carritos/:id (requiere administrador o empleado)
-  router.delete('/:id', autenticacionMiddleware, esAdministradorOEmpleado, (req, res, next) => controller.vaciar(req, res, next));
-
-  return router;
-};
+) => {};
 

[NoCoverage] ArrowFunction
carrito/presentation/routes/carritoRoutes.js:18:113
   );
 
   // POST /carritos (requiere administrador o empleado)
-  router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['tipoCarrito']), (req, res, next) => controller.crear(req, res, next));
+  router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['tipoCarrito']), () => undefined);
 
   // GET /carritos/:id (público por ahora)

[NoCoverage] ArrowFunction
carrito/presentation/routes/carritoRoutes.js:21:22
   router.post('/', autenticacionMiddleware, esAdministradorOEmpleado, validarCamposRequeridos(['tipoCarrito']), (req, res, next) => controller.crear(req, res, next));
 
   // GET /carritos/:id (público por ahora)
-  router.get('/:id', (req, res, next) => controller.obtenerPorId(req, res, next));
+  router.get('/:id', () => undefined);
 
   // POST /carritos/:id/items (requiere autenticación)

[NoCoverage] ArrowFunction
carrito/presentation/routes/carritoRoutes.js:24:136
   router.get('/:id', (req, res, next) => controller.obtenerPorId(req, res, next));
 
   // POST /carritos/:id/items (requiere autenticación)
-  router.post('/:id/items', autenticacionMiddleware, validarCamposRequeridos(['idProducto', 'cantidad']), validarPositivo('cantidad'), (req, res, next) => controller.agregarItem(req, res, next));
+  router.post('/:id/items', autenticacionMiddleware, validarCamposRequeridos(['idProducto', 'cantidad']), validarPositivo('cantidad'), () => undefined);
 
   // DELETE /carritos/:id/items/:idProducto (requiere administrador o empleado)

[NoCoverage] ArrayDeclaration
carrito/presentation/routes/carritoRoutes.js:24:78
   router.get('/:id', (req, res, next) => controller.obtenerPorId(req, res, next));
 
   // POST /carritos/:id/items (requiere autenticación)
-  router.post('/:id/items', autenticacionMiddleware, validarCamposRequeridos(['idProducto', 'cantidad']), validarPositivo('cantidad'), (req, res, next) => controller.agregarItem(req, res, next));
+  router.post('/:id/items', autenticacionMiddleware, validarCamposRequeridos([]), validarPositivo('cantidad'), (req, res, next) => controller.agregarItem(req, res, next));
 
   // DELETE /carritos/:id/items/:idProducto (requiere administrador o empleado)

[NoCoverage] ArrowFunction
carrito/presentation/routes/carritoRoutes.js:27:94
   router.post('/:id/items', autenticacionMiddleware, validarCamposRequeridos(['idProducto', 'cantidad']), validarPositivo('cantidad'), (req, res, next) => controller.agregarItem(req, res, next));
 
   // DELETE /carritos/:id/items/:idProducto (requiere administrador o empleado)
-  router.delete('/:id/items/:idProducto', autenticacionMiddleware, esAdministradorOEmpleado, (req, res, next) => controller.eliminarItem(req, res, next));
+  router.delete('/:id/items/:idProducto', autenticacionMiddleware, esAdministradorOEmpleado, () => undefined);
 
   // DELETE /carritos/:id (requiere administrador o empleado)

[NoCoverage] StringLiteral
carrito/presentation/routes/carritoRoutes.js:27:17
   router.post('/:id/items', autenticacionMiddleware, validarCamposRequeridos(['idProducto', 'cantidad']), validarPositivo('cantidad'), (req, res, next) => controller.agregarItem(req, res, next));
 
   // DELETE /carritos/:id/items/:idProducto (requiere administrador o empleado)
-  router.delete('/:id/items/:idProducto', autenticacionMiddleware, esAdministradorOEmpleado, (req, res, next) => controller.eliminarItem(req, res, next));
+  router.delete("", autenticacionMiddleware, esAdministradorOEmpleado, (req, res, next) => controller.eliminarItem(req, res, next));
 
   // DELETE /carritos/:id (requiere administrador o empleado)

[NoCoverage] ArrowFunction
carrito/presentation/routes/carritoRoutes.js:30:76
   router.delete('/:id/items/:idProducto', autenticacionMiddleware, esAdministradorOEmpleado, (req, res, next) => controller.eliminarItem(req, res, next));
 
   // DELETE /carritos/:id (requiere administrador o empleado)
-  router.delete('/:id', autenticacionMiddleware, esAdministradorOEmpleado, (req, res, next) => controller.vaciar(req, res, next));
+  router.delete('/:id', autenticacionMiddleware, esAdministradorOEmpleado, () => undefined);
 
   return router;
