[Killed] BlockStatement
cliente/domain/entities/Cliente.js:9:125
  * Hereda atributos y comportamiento de Usuario
  */
 class Cliente extends Usuario {
-  constructor(id, nombre, email, contrasena, apellidos = '', telefono = '', direccion = '', estado = 'activo', correo = '') {
-    super(id, nombre, email, contrasena, apellidos, estado);
-    this.telefono = telefono;
-    this.direccion = direccion;
-    this.correo = correo || email;  // correo puede ser diferente
-    this.rol = 'cliente';
-  }
+  constructor(id, nombre, email, contrasena, apellidos = '', telefono = '', direccion = '', estado = 'activo', correo = '') {}
 
   /**
killedBy: Cliente - Constructor debe crear un cliente con valores iniciales correctos
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[NoCoverage] StringLiteral
cliente/domain/entities/Cliente.js:9:121
  * Hereda atributos y comportamiento de Usuario
  */
 class Cliente extends Usuario {
-  constructor(id, nombre, email, contrasena, apellidos = '', telefono = '', direccion = '', estado = 'activo', correo = '') {
+  constructor(id, nombre, email, contrasena, apellidos = '', telefono = '', direccion = '', estado = 'activo', correo = "Stryker was here!") {
     super(id, nombre, email, contrasena, apellidos, estado);
     this.telefono = telefono;

[Killed] LogicalOperator
cliente/domain/entities/Cliente.js:13:19
     super(id, nombre, email, contrasena, apellidos, estado);
     this.telefono = telefono;
     this.direccion = direccion;
-    this.correo = correo || email;  // correo puede ser diferente
+    this.correo = correo && email;  // correo puede ser diferente
     this.rol = 'cliente';
   }
killedBy: Cliente - Constructor debe crear un cliente con valores iniciales correctos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "contacto@juan.com"
Received: "juan.perez@example.com"

[Killed] ConditionalExpression
cliente/domain/entities/Cliente.js:13:19
     super(id, nombre, email, contrasena, apellidos, estado);
     this.telefono = telefono;
     this.direccion = direccion;
-    this.correo = correo || email;  // correo puede ser diferente
+    this.correo = false;  // correo puede ser diferente
     this.rol = 'cliente';
   }
killedBy: Cliente - Constructor debe crear un cliente con valores iniciales correctos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "contacto@juan.com"
Received: false

[Killed] BlockStatement
cliente/domain/entities/Cliente.js:20:13
   /**
    * Validar reglas del Agregado (incluye validación de Usuario)
    */
-  validar() {
-    super.validar();
-
-    if (!this.correo || this.correo.trim() === '') {
-      throw new Error('Correo requerido');
-    }
-  }
+  validar() {}
 
   /**
killedBy: Cliente - validar debe lanzar error si falta el nombre
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Nombre requerido"

Received function did not throw

[Killed] BlockStatement
cliente/domain/entities/Cliente.js:23:52
   validar() {
     super.validar();
 
-    if (!this.correo || this.correo.trim() === '') {
-      throw new Error('Correo requerido');
-    }
+    if (!this.correo || this.correo.trim() === '') {}
   }
 
killedBy: Cliente - validar debe lanzar error si falta el correo de contacto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Correo requerido"

Received function did not throw

[Killed] BooleanLiteral
cliente/domain/entities/Cliente.js:23:9
   validar() {
     super.validar();
 
-    if (!this.correo || this.correo.trim() === '') {
+    if (this.correo || this.correo.trim() === '') {
       throw new Error('Correo requerido');
     }
killedBy: Cliente - validar debe validar sin lanzar errores cuando el cliente es correcto
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Correo requerido"

      81 |         } else {
      82 |           stryCov_9fa48("598");
    > 83 |           throw new Error(stryMutAct_9fa48("599") ? "" : (stryCov_9fa48("599"), 'Correo requerido'));

[Killed] BlockStatement
cliente/domain/entities/Cliente.js:31:43
   /**
    * Actualizar datos de contacto
    */
-  actualizarContacto(telefono, direccion) {
-    this.telefono = telefono;
-    this.direccion = direccion;
-    return this;
-  }
+  actualizarContacto(telefono, direccion) {}
 
   /**
killedBy: Cliente - contacto y teléfono debe actualizar teléfono y dirección correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BlockStatement
cliente/domain/entities/Cliente.js:40:30
   /**
    * Validar formato de teléfono (simple)
    */
-  esTelefonoValido(telefono) {
-    return /^\d{9,15}$/.test(telefono.replace(/\D/g, ''));
-  }
+  esTelefonoValido(telefono) {}
 }
 
killedBy: Cliente - contacto y teléfono debe validar teléfonos válidos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] Regex
cliente/domain/entities/Cliente.js:41:12
    * Validar formato de teléfono (simple)
    */
   esTelefonoValido(telefono) {
-    return /^\d{9,15}$/.test(telefono.replace(/\D/g, ''));
+    return /^\D{9,15}$/.test(telefono.replace(/\D/g, ''));
   }
 }
killedBy: Cliente - contacto y teléfono debe validar teléfonos válidos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
cliente/domain/entities/Cliente.js:41:54
    * Validar formato de teléfono (simple)
    */
   esTelefonoValido(telefono) {
-    return /^\d{9,15}$/.test(telefono.replace(/\D/g, ''));
+    return /^\d{9,15}$/.test(telefono.replace(/\D/g, "Stryker was here!"));
   }
 }
killedBy: Cliente - contacto y teléfono debe validar teléfonos válidos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
