[NoCoverage] StringLiteral
modules/cliente/infrastructure/ClienteRepository.js:17:26
     cliente.validar();
 
     // Primero guardar en usuario
-    const queryUsuario = `
-      INSERT INTO usuario (user_name, contrasena, nombres, apellidos, rol, estado)
-      VALUES ($1, $2, $3, $4, $5, $6)
-      ON CONFLICT (user_name) DO UPDATE SET
-        contrasena = EXCLUDED.contrasena,
-        nombres = EXCLUDED.nombres,
-        apellidos = EXCLUDED.apellidos,
-        rol = EXCLUDED.rol
-      RETURNING id_usuario
-    `;
+    const queryUsuario = ``;
 
     const { rows: rowsUsuario } = await db.query(queryUsuario, [

[NoCoverage] ArrayDeclaration
modules/cliente/infrastructure/ClienteRepository.js:51:64
       RETURNING id_usuario_cliente, telefono, correo, direccion, estado
     `;
 
-    const { rows: rowsCliente } = await db.query(queryCliente, [
-      idUsuario,
-      cliente.telefono,
-      cliente.correo,
-      cliente.direccion,
-      cliente.estado
-    ]);
+    const { rows: rowsCliente } = await db.query(queryCliente, []);
 
     return rowsCliente[0];

[NoCoverage] BlockStatement
modules/cliente/infrastructure/ClienteRepository.js:65:33
   /**
    * Obtener cliente por ID
    */
-  async obtenerPorId(idCliente) {
-    const query = `
-      SELECT u.id_usuario, u.user_name, u.contrasena, u.nombres, u.apellidos,
-             c.telefono, c.correo, c.direccion, c.estado
-      FROM usuario u
-      JOIN cliente c ON u.id_usuario = c.id_usuario_cliente
-      WHERE u.id_usuario = $1
-    `;
-
-    const { rows } = await db.query(query, [idCliente]);
-
-    if (rows.length === 0) {
-      return null;
-    }
-
-    return this._mapearACliente(rows[0]);
-  }
+  async obtenerPorId(idCliente) {}
 
   /**

[NoCoverage] StringLiteral
modules/cliente/infrastructure/ClienteRepository.js:66:19
    * Obtener cliente por ID
    */
   async obtenerPorId(idCliente) {
-    const query = `
-      SELECT u.id_usuario, u.user_name, u.contrasena, u.nombres, u.apellidos,
-             c.telefono, c.correo, c.direccion, c.estado
-      FROM usuario u
-      JOIN cliente c ON u.id_usuario = c.id_usuario_cliente
-      WHERE u.id_usuario = $1
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [idCliente]);

[NoCoverage] BlockStatement
modules/cliente/infrastructure/ClienteRepository.js:86:34
   /**
    * Obtener cliente por correo
    */
-  async obtenerPorCorreo(correo) {
-    const query = `
-      SELECT u.id_usuario, u.user_name, u.contrasena, u.nombres, u.apellidos,
-             c.telefono, c.correo, c.direccion, c.estado
-      FROM usuario u
-      JOIN cliente c ON u.id_usuario = c.id_usuario_cliente
-      WHERE c.correo = $1
-    `;
-
-    const { rows } = await db.query(query, [correo]);
-
-    if (rows.length === 0) {
-      return null;
-    }
-
-    return this._mapearACliente(rows[0]);
-  }
+  async obtenerPorCorreo(correo) {}
 
   /**

[NoCoverage] ArrayDeclaration
modules/cliente/infrastructure/ClienteRepository.js:95:44
       WHERE c.correo = $1
     `;
 
-    const { rows } = await db.query(query, [correo]);
+    const { rows } = await db.query(query, []);
 
     if (rows.length === 0) {

[NoCoverage] BlockStatement
modules/cliente/infrastructure/ClienteRepository.js:107:24
   /**
    * Obtener todos los clientes
    */
-  async obtenerTodos() {
-    const query = `
-      SELECT u.id_usuario, u.user_name, u.contrasena, u.nombres, u.apellidos,
-             c.telefono, c.correo, c.direccion, c.estado
-      FROM usuario u
-      JOIN cliente c ON u.id_usuario = c.id_usuario_cliente
-      WHERE c.estado = 'activo'
-      ORDER BY u.nombres
-    `;
-
-    const { rows } = await db.query(query);
-    return rows.map(row => this._mapearACliente(row));
-  }
+  async obtenerTodos() {}
 
   /**

[NoCoverage] ArrowFunction
modules/cliente/infrastructure/ClienteRepository.js:118:21
     `;
 
     const { rows } = await db.query(query);
-    return rows.map(row => this._mapearACliente(row));
+    return rows.map(() => undefined);
   }
 

[NoCoverage] BlockStatement
modules/cliente/infrastructure/ClienteRepository.js:124:51
   /**
    * Actualizar cliente
    */
-  async actualizar(idCliente, clienteActualizado) {
-    clienteActualizado.validar();
-
-    const query = `
-      UPDATE cliente
-      SET telefono = $1, correo = $2, direccion = $3, estado = $4
-      WHERE id_usuario_cliente = $5
-      RETURNING id_usuario_cliente, telefono, correo, direccion, estado
-    `;
-
-    const { rows } = await db.query(query, [
-      clienteActualizado.telefono,
-      clienteActualizado.correo,
-      clienteActualizado.direccion,
-      clienteActualizado.estado,
-      idCliente
-    ]);
-
-    return rows[0] || null;
-  }
+  async actualizar(idCliente, clienteActualizado) {}
 
   /**

[NoCoverage] LogicalOperator
modules/cliente/infrastructure/ClienteRepository.js:142:12
       idCliente
     ]);
 
-    return rows[0] || null;
+    return rows[0] && null;
   }
 

[NoCoverage] ConditionalExpression
modules/cliente/infrastructure/ClienteRepository.js:142:12
       idCliente
     ]);
 
-    return rows[0] || null;
+    return false;
   }
 

[NoCoverage] BlockStatement
modules/cliente/infrastructure/ClienteRepository.js:148:29
   /**
    * Eliminar cliente (lógico)
    */
-  async eliminar(idCliente) {
-    const query = `
-      UPDATE cliente
-      SET estado = 'inactivo'
-      WHERE id_usuario_cliente = $1
-      RETURNING id_usuario_cliente
-    `;
-
-    const { rows } = await db.query(query, [idCliente]);
-    return rows[0] !== null;
-  }
+  async eliminar(idCliente) {}
 
   /**

[NoCoverage] StringLiteral
modules/cliente/infrastructure/ClienteRepository.js:149:19
    * Eliminar cliente (lógico)
    */
   async eliminar(idCliente) {
-    const query = `
-      UPDATE cliente
-      SET estado = 'inactivo'
-      WHERE id_usuario_cliente = $1
-      RETURNING id_usuario_cliente
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [idCliente]);

[NoCoverage] EqualityOperator
modules/cliente/infrastructure/ClienteRepository.js:157:12
     `;
 
     const { rows } = await db.query(query, [idCliente]);
-    return rows[0] !== null;
+    return rows[0] === null;
   }
 

[NoCoverage] ConditionalExpression
modules/cliente/infrastructure/ClienteRepository.js:157:12
     `;
 
     const { rows } = await db.query(query, [idCliente]);
-    return rows[0] !== null;
+    return true;
   }
 

[NoCoverage] BlockStatement
modules/cliente/infrastructure/ClienteRepository.js:163:25
   /**
    * Mapear fila de BD a Entidad Cliente
    */
-  _mapearACliente(fila) {
-    return new Cliente(
-      fila.id_usuario,
-      fila.nombres,
-      new Email(fila.correo),
-      fila.contrasena,
-      fila.apellidos,
-      fila.telefono,
-      fila.direccion,
-      fila.estado,
-      fila.correo
-    );
-  }
+  _mapearACliente(fila) {}
 }
 
