[Killed] BlockStatement
modules/producto/application/ObtenerAlertasApplicationService.js:6:52
  * Orquesta alertas del sistema (stock bajo, etc.)
  */
 class ObtenerAlertasApplicationService {
-  constructor(productoRepository, socketIOEmitter) {
-    this.productoRepository = productoRepository;
-    this.socketIOEmitter = socketIOEmitter;
-  }
+  constructor(productoRepository, socketIOEmitter) {}
 
   /**
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: TypeError: Cannot read properties of undefined (reading 'obtenerStockBajo')

[Killed] BlockStatement
modules/producto/application/ObtenerAlertasApplicationService.js:14:37
   /**
    * Obtener productos con stock bajo
    */
-  async obtenerProductosStockBajo() {
-    const productos = await this.productoRepository.obtenerStockBajo();
-
-    return {
-      cantidad: productos.length,
-      alertas: productos.map(p => ({
-        idProducto: p.id,
-        nombre: p.nombre,
-        stockActual: p.stock.cantidad,
-        stockMinimo: p.minStock,
-        diferencia: p.minStock - p.stock.cantidad,
-        precio: p.precio.monto,
-        urgencia: this._calcularUrgencia(p)
-      }))
-    };
-  }
+  async obtenerProductosStockBajo() {}
 
   /**
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"alertas": [{"diferencia": 6, "idProducto": 1, "nombre": "Teclado", "precio": 12000, "stockActual": 2, "stockMinimo": 8, "urgencia": 5}], "cantidad": 1}
Received: undefined

[Killed] ArrowFunction
modules/producto/application/ObtenerAlertasApplicationService.js:19:30
 
     return {
       cantidad: productos.length,
-      alertas: productos.map(p => ({
-        idProducto: p.id,
-        nombre: p.nombre,
-        stockActual: p.stock.cantidad,
-        stockMinimo: p.minStock,
-        diferencia: p.minStock - p.stock.cantidad,
-        precio: p.precio.monto,
-        urgencia: this._calcularUrgencia(p)
-      }))
+      alertas: productos.map(() => undefined)
     };
   }
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
    "alertas": Array [
-     Object {

[Killed] ArithmeticOperator
modules/producto/application/ObtenerAlertasApplicationService.js:24:21
         nombre: p.nombre,
         stockActual: p.stock.cantidad,
         stockMinimo: p.minStock,
-        diferencia: p.minStock - p.stock.cantidad,
+        diferencia: p.minStock + p.stock.cantidad,
         precio: p.precio.monto,
         urgencia: this._calcularUrgencia(p)
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Object {
    "alertas": Array [

[Killed] BooleanLiteral
modules/producto/application/ObtenerAlertasApplicationService.js:37:9
   async emitirAlertaStockBajo(idProducto) {
     const producto = await this.productoRepository.obtenerPorId(idProducto);
 
-    if (!producto) {
+    if (producto) {
       throw new Error('Producto no encontrado');
     }
killedBy: ObtenerAlertasApplicationService emitirAlertaStockBajo lanza error si producto no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Producto no encontrado"
Received message:   "Cannot read properties of null (reading 'tieneStockBajo')"

      102 |         }
      103 |       }
    > 104 |       if (stryMutAct_9fa48("693") ? producto.tieneStockBajo() || this.socketIOEmitter : stryMutAct_9fa48("692") ? false : stryMutAct_9fa48("691") ? true : (stryCov_9fa48

[Killed] ConditionalExpression
modules/producto/application/ObtenerAlertasApplicationService.js:37:9
   async emitirAlertaStockBajo(idProducto) {
     const producto = await this.productoRepository.obtenerPorId(idProducto);
 
-    if (!producto) {
+    if (false) {
       throw new Error('Producto no encontrado');
     }
killedBy: ObtenerAlertasApplicationService emitirAlertaStockBajo lanza error si producto no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Producto no encontrado"
Received message:   "Cannot read properties of null (reading 'tieneStockBajo')"

      102 |         }
      103 |       }
    > 104 |       if (stryMutAct_9fa48("693") ? producto.tieneStockBajo() || this.socketIOEmitter : stryMutAct_9fa48("692") ? false : stryMutAct_9fa48("691") ? true : (stryCov_9fa48

[Killed] ConditionalExpression
modules/producto/application/ObtenerAlertasApplicationService.js:41:9
       throw new Error('Producto no encontrado');
     }
 
-    if (producto.tieneStockBajo() && this.socketIOEmitter) {
+    if (true) {
       this.socketIOEmitter.emitirAlertaStockBajo(producto);
 
killedBy: ObtenerAlertasApplicationService emitirAlertaStockBajo no emite evento si no hay stock bajo
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"id": 7, "minStock": 4, "nombre": "Monitor", "stock": {"cantidad": 10}, "tieneStockBajo": [Function mockConstructor]}

[Killed] ConditionalExpression
modules/producto/application/ObtenerAlertasApplicationService.js:41:9
       throw new Error('Producto no encontrado');
     }
 
-    if (producto.tieneStockBajo() && this.socketIOEmitter) {
+    if (false) {
       this.socketIOEmitter.emitirAlertaStockBajo(producto);
 
killedBy: ObtenerAlertasApplicationService emitirAlertaStockBajo emite evento cuando hay stock bajo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 5, "minStock": 4, "nombre": "Mouse", "stock": {"cantidad": 1}, "tieneStockBajo": [Function mockConstructor]}

Number of calls: 0

[Killed] StringLiteral
modules/producto/application/ObtenerAlertasApplicationService.js:56:16
     }
 
     return {
-      mensaje: 'Producto no tiene stock bajo',
+      mensaje: "",
       producto: {
         id: producto.id,
killedBy: ObtenerAlertasApplicationService emitirAlertaStockBajo no emite evento si no hay stock bajo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Producto no tiene stock bajo"
Received: ""

[Killed] BlockStatement
modules/producto/application/ObtenerAlertasApplicationService.js:69:31
   /**
    * Calcular nivel de urgencia (1-5)
    */
-  _calcularUrgencia(producto) {
-    const porcentaje = (producto.stock.cantidad / producto.minStock) * 100;
-
-    if (porcentaje === 0) return 5;
-    if (porcentaje <= 25) return 5;
-    if (porcentaje <= 50) return 4;
-    if (porcentaje <= 75) return 3;
-    return 2;
-  }
+  _calcularUrgencia(producto) {}
 }
 
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,10 +5,10 @@
        "idProducto": 1,
        "nombre": "Teclado",

[Killed] ArithmeticOperator
modules/producto/application/ObtenerAlertasApplicationService.js:70:25
    * Calcular nivel de urgencia (1-5)
    */
   _calcularUrgencia(producto) {
-    const porcentaje = (producto.stock.cantidad / producto.minStock) * 100;
+    const porcentaje = (producto.stock.cantidad * producto.minStock) * 100;
 
     if (porcentaje === 0) return 5;
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,10 +5,10 @@
        "idProducto": 1,
        "nombre": "Teclado",

[Survived] ArithmeticOperator
modules/producto/application/ObtenerAlertasApplicationService.js:70:24
    * Calcular nivel de urgencia (1-5)
    */
   _calcularUrgencia(producto) {
-    const porcentaje = (producto.stock.cantidad / producto.minStock) * 100;
+    const porcentaje = producto.stock.cantidad / producto.minStock / 100;
 
     if (porcentaje === 0) return 5;

[Survived] ConditionalExpression
modules/producto/application/ObtenerAlertasApplicationService.js:72:9
   _calcularUrgencia(producto) {
     const porcentaje = (producto.stock.cantidad / producto.minStock) * 100;
 
-    if (porcentaje === 0) return 5;
+    if (true) return 5;
     if (porcentaje <= 25) return 5;
     if (porcentaje <= 50) return 4;

[Survived] EqualityOperator
modules/producto/application/ObtenerAlertasApplicationService.js:72:9
   _calcularUrgencia(producto) {
     const porcentaje = (producto.stock.cantidad / producto.minStock) * 100;
 
-    if (porcentaje === 0) return 5;
+    if (porcentaje !== 0) return 5;
     if (porcentaje <= 25) return 5;
     if (porcentaje <= 50) return 4;

[Killed] EqualityOperator
modules/producto/application/ObtenerAlertasApplicationService.js:73:9
     const porcentaje = (producto.stock.cantidad / producto.minStock) * 100;
 
     if (porcentaje === 0) return 5;
-    if (porcentaje <= 25) return 5;
+    if (porcentaje > 25) return 5;
     if (porcentaje <= 50) return 4;
     if (porcentaje <= 75) return 3;
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,10 +5,10 @@
        "idProducto": 1,
        "nombre": "Teclado",

[Killed] ConditionalExpression
modules/producto/application/ObtenerAlertasApplicationService.js:73:9
     const porcentaje = (producto.stock.cantidad / producto.minStock) * 100;
 
     if (porcentaje === 0) return 5;
-    if (porcentaje <= 25) return 5;
+    if (false) return 5;
     if (porcentaje <= 50) return 4;
     if (porcentaje <= 75) return 3;
killedBy: ObtenerAlertasApplicationService obtenerProductosStockBajo retorna alertas con urgencia calculada
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,10 +5,10 @@
        "idProducto": 1,
        "nombre": "Teclado",

[NoCoverage] ConditionalExpression
modules/producto/application/ObtenerAlertasApplicationService.js:74:9
 
     if (porcentaje === 0) return 5;
     if (porcentaje <= 25) return 5;
-    if (porcentaje <= 50) return 4;
+    if (true) return 4;
     if (porcentaje <= 75) return 3;
     return 2;

[NoCoverage] EqualityOperator
modules/producto/application/ObtenerAlertasApplicationService.js:74:9
 
     if (porcentaje === 0) return 5;
     if (porcentaje <= 25) return 5;
-    if (porcentaje <= 50) return 4;
+    if (porcentaje > 50) return 4;
     if (porcentaje <= 75) return 3;
     return 2;

[NoCoverage] EqualityOperator
modules/producto/application/ObtenerAlertasApplicationService.js:75:9
     if (porcentaje === 0) return 5;
     if (porcentaje <= 25) return 5;
     if (porcentaje <= 50) return 4;
-    if (porcentaje <= 75) return 3;
+    if (porcentaje > 75) return 3;
     return 2;
   }

[NoCoverage] EqualityOperator
modules/producto/application/ObtenerAlertasApplicationService.js:75:9
     if (porcentaje === 0) return 5;
     if (porcentaje <= 25) return 5;
     if (porcentaje <= 50) return 4;
-    if (porcentaje <= 75) return 3;
+    if (porcentaje < 75) return 3;
     return 2;
   }
