[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:10:106
  * Protege invariantes: stock >= 0, precio > 0
  */
 class Producto {
-  constructor(id, nombre, precio, stock, minStock, descripcion = '', imagenUrl = '', idCategoria = null) {
-    this.id = id;
-    this.nombre = nombre;
-    this.precio = precio instanceof Precio ? precio : new Precio(precio);
-    this.stock = stock instanceof Stock ? stock : new Stock(stock, minStock);
-    this.minStock = minStock;
-    this.descripcion = descripcion;
-    this.imagenUrl = imagenUrl;
-    this.idCategoria = idCategoria;
-    this.estado = 'activo';
-    this.createdAt = new Date();
-  }
+  constructor(id, nombre, precio, stock, minStock, descripcion = '', imagenUrl = '', idCategoria = null) {}
 
   /**

[NoCoverage] StringLiteral
producto/domain/entities/Producto.js:10:66
  * Protege invariantes: stock >= 0, precio > 0
  */
 class Producto {
-  constructor(id, nombre, precio, stock, minStock, descripcion = '', imagenUrl = '', idCategoria = null) {
+  constructor(id, nombre, precio, stock, minStock, descripcion = "Stryker was here!", imagenUrl = '', idCategoria = null) {
     this.id = id;
     this.nombre = nombre;

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:26:13
   /**
    * Validar reglas del Agregado
    */
-  validar() {
-    if (!this.nombre || this.nombre.trim() === '') {
-      throw new Error('Nombre de producto requerido');
-    }
-
-    if (this.stock.cantidad < 0) {
-      throw new Error('Stock no puede ser negativo');
-    }
-
-    if (this.precio.monto <= 0) {
-      throw new Error('Precio debe ser positivo');
-    }
-  }
+  validar() {}
 
   /**

[NoCoverage] LogicalOperator
producto/domain/entities/Producto.js:27:9
    * Validar reglas del Agregado
    */
   validar() {
-    if (!this.nombre || this.nombre.trim() === '') {
+    if (!this.nombre && this.nombre.trim() === '') {
       throw new Error('Nombre de producto requerido');
     }

[NoCoverage] BooleanLiteral
producto/domain/entities/Producto.js:27:9
    * Validar reglas del Agregado
    */
   validar() {
-    if (!this.nombre || this.nombre.trim() === '') {
+    if (this.nombre || this.nombre.trim() === '') {
       throw new Error('Nombre de producto requerido');
     }

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:31:34
       throw new Error('Nombre de producto requerido');
     }
 
-    if (this.stock.cantidad < 0) {
-      throw new Error('Stock no puede ser negativo');
-    }
+    if (this.stock.cantidad < 0) {}
 
     if (this.precio.monto <= 0) {

[NoCoverage] ConditionalExpression
producto/domain/entities/Producto.js:31:9
       throw new Error('Nombre de producto requerido');
     }
 
-    if (this.stock.cantidad < 0) {
+    if (true) {
       throw new Error('Stock no puede ser negativo');
     }

[NoCoverage] ConditionalExpression
producto/domain/entities/Producto.js:35:9
       throw new Error('Stock no puede ser negativo');
     }
 
-    if (this.precio.monto <= 0) {
+    if (false) {
       throw new Error('Precio debe ser positivo');
     }

[NoCoverage] EqualityOperator
producto/domain/entities/Producto.js:35:9
       throw new Error('Stock no puede ser negativo');
     }
 
-    if (this.precio.monto <= 0) {
+    if (this.precio.monto < 0) {
       throw new Error('Precio debe ser positivo');
     }

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:43:20
   /**
    * Decrementar stock (venta)
    */
-  vender(cantidad) {
-    this.stock = this.stock.decrementar(cantidad);
-    return this;
-  }
+  vender(cantidad) {}
 
   /**

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:51:25
   /**
    * Incrementar stock (restock)
    */
-  reabastecer(cantidad) {
-    this.stock = this.stock.incrementar(cantidad);
-    return this;
-  }
+  reabastecer(cantidad) {}
 
   /**

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:59:20
   /**
    * ¿Stock está bajo?
    */
-  tieneStockBajo() {
-    return this.stock.estaBajo();
-  }
+  tieneStockBajo() {}
 
   /**

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:66:26
   /**
    * ¿Hay stock disponible para vender?
    */
-  hayStockPara(cantidad) {
-    return this.stock.cantidad >= cantidad;
-  }
+  hayStockPara(cantidad) {}
 
   /**

[NoCoverage] ConditionalExpression
producto/domain/entities/Producto.js:67:12
    * ¿Hay stock disponible para vender?
    */
   hayStockPara(cantidad) {
-    return this.stock.cantidad >= cantidad;
+    return true;
   }
 

[NoCoverage] EqualityOperator
producto/domain/entities/Producto.js:67:12
    * ¿Hay stock disponible para vender?
    */
   hayStockPara(cantidad) {
-    return this.stock.cantidad >= cantidad;
+    return this.stock.cantidad < cantidad;
   }
 

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:73:30
   /**
    * Cambiar precio
    */
-  cambiarPrecio(nuevoPrecio) {
-    this.precio = nuevoPrecio instanceof Precio ? nuevoPrecio : new Precio(nuevoPrecio);
-    return this;
-  }
+  cambiarPrecio(nuevoPrecio) {}
 
   /**

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:81:16
   /**
    * Desactivar producto
    */
-  desactivar() {
-    this.estado = 'inactivo';
-    return this;
-  }
+  desactivar() {}
 
   /**

[NoCoverage] StringLiteral
producto/domain/entities/Producto.js:82:19
    * Desactivar producto
    */
   desactivar() {
-    this.estado = 'inactivo';
+    this.estado = "";
     return this;
   }

[NoCoverage] BlockStatement
producto/domain/entities/Producto.js:89:13
   /**
    * Activar producto
    */
-  activar() {
-    this.estado = 'activo';
-    return this;
-  }
+  activar() {}
 }
 

[NoCoverage] StringLiteral
producto/domain/entities/Producto.js:90:19
    * Activar producto
    */
   activar() {
-    this.estado = 'activo';
+    this.estado = "";
     return this;
   }
