[NoCoverage] BlockStatement
producto/domain/exceptions/StockInsuficienteException.js:4:70
 const DomainException = require('../../../shared/domain/exceptions/DomainException');
 
 class StockInsuficienteException extends DomainException {
-  constructor(producto = 'Producto', disponible = 0, solicitado = 0) {
-    const mensaje = `Stock insuficiente de ${producto}. Disponible: ${disponible}, Solicitado: ${solicitado}`;
-    super(mensaje, 400, 'STOCK_INSUFICIENTE');
-  }
+  constructor(producto = 'Producto', disponible = 0, solicitado = 0) {}
 }
 

[NoCoverage] StringLiteral
producto/domain/exceptions/StockInsuficienteException.js:5:21
 
 class StockInsuficienteException extends DomainException {
   constructor(producto = 'Producto', disponible = 0, solicitado = 0) {
-    const mensaje = `Stock insuficiente de ${producto}. Disponible: ${disponible}, Solicitado: ${solicitado}`;
+    const mensaje = ``;
     super(mensaje, 400, 'STOCK_INSUFICIENTE');
   }

[NoCoverage] StringLiteral
producto/domain/exceptions/StockInsuficienteException.js:6:25
 class StockInsuficienteException extends DomainException {
   constructor(producto = 'Producto', disponible = 0, solicitado = 0) {
     const mensaje = `Stock insuficiente de ${producto}. Disponible: ${disponible}, Solicitado: ${solicitado}`;
-    super(mensaje, 400, 'STOCK_INSUFICIENTE');
+    super(mensaje, 400, "");
   }
 }
