[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:8:37
  * Immutable, validado, comparable por valor
  */
 class Stock {
-  constructor(cantidad, minimo = 0) {
-    this.validar(cantidad, minimo);
-    this.cantidad = parseInt(cantidad);
-    this.minimo = parseInt(minimo);
-  }
+  constructor(cantidad, minimo = 0) {}
 
   validar(cantidad, minimo) {

[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:14:29
     this.minimo = parseInt(minimo);
   }
 
-  validar(cantidad, minimo) {
-    if (cantidad === null || cantidad === undefined) {
-      throw new DomainException('Stock es requerido', 400, 'STOCK_REQUERIDO');
-    }
-
-    const cantNum = parseInt(cantidad);
-
-    if (isNaN(cantNum)) {
-      throw new DomainException('Stock debe ser un número', 400, 'STOCK_NO_NUMERO');
-    }
-
-    if (cantNum < 0) {
-      throw new DomainException('Stock no puede ser negativo', 400, 'STOCK_NEGATIVO');
-    }
-
-    if (minimo && parseInt(minimo) < 0) {
-      throw new DomainException('Stock mínimo no puede ser negativo', 400, 'MINIMO_NEGATIVO');
-    }
-  }
+  validar(cantidad, minimo) {}
 
   decrementar(cantidad) {

[NoCoverage] ConditionalExpression
producto/domain/valueObjects/Stock.js:15:9
   }
 
   validar(cantidad, minimo) {
-    if (cantidad === null || cantidad === undefined) {
+    if (false) {
       throw new DomainException('Stock es requerido', 400, 'STOCK_REQUERIDO');
     }

[NoCoverage] ConditionalExpression
producto/domain/valueObjects/Stock.js:15:9
   }
 
   validar(cantidad, minimo) {
-    if (cantidad === null || cantidad === undefined) {
+    if (false || cantidad === undefined) {
       throw new DomainException('Stock es requerido', 400, 'STOCK_REQUERIDO');
     }

[NoCoverage] ConditionalExpression
producto/domain/valueObjects/Stock.js:21:9
 
     const cantNum = parseInt(cantidad);
 
-    if (isNaN(cantNum)) {
+    if (false) {
       throw new DomainException('Stock debe ser un número', 400, 'STOCK_NO_NUMERO');
     }

[NoCoverage] ConditionalExpression
producto/domain/valueObjects/Stock.js:21:9
 
     const cantNum = parseInt(cantidad);
 
-    if (isNaN(cantNum)) {
+    if (true) {
       throw new DomainException('Stock debe ser un número', 400, 'STOCK_NO_NUMERO');
     }

[NoCoverage] StringLiteral
producto/domain/valueObjects/Stock.js:22:66
     const cantNum = parseInt(cantidad);
 
     if (isNaN(cantNum)) {
-      throw new DomainException('Stock debe ser un número', 400, 'STOCK_NO_NUMERO');
+      throw new DomainException('Stock debe ser un número', 400, "");
     }
 

[NoCoverage] ConditionalExpression
producto/domain/valueObjects/Stock.js:25:9
       throw new DomainException('Stock debe ser un número', 400, 'STOCK_NO_NUMERO');
     }
 
-    if (cantNum < 0) {
+    if (true) {
       throw new DomainException('Stock no puede ser negativo', 400, 'STOCK_NEGATIVO');
     }

[NoCoverage] EqualityOperator
producto/domain/valueObjects/Stock.js:25:9
       throw new DomainException('Stock debe ser un número', 400, 'STOCK_NO_NUMERO');
     }
 
-    if (cantNum < 0) {
+    if (cantNum <= 0) {
       throw new DomainException('Stock no puede ser negativo', 400, 'STOCK_NEGATIVO');
     }

[NoCoverage] ConditionalExpression
producto/domain/valueObjects/Stock.js:29:19
       throw new DomainException('Stock no puede ser negativo', 400, 'STOCK_NEGATIVO');
     }
 
-    if (minimo && parseInt(minimo) < 0) {
+    if (minimo && true) {
       throw new DomainException('Stock mínimo no puede ser negativo', 400, 'MINIMO_NEGATIVO');
     }

[NoCoverage] EqualityOperator
producto/domain/valueObjects/Stock.js:29:19
       throw new DomainException('Stock no puede ser negativo', 400, 'STOCK_NEGATIVO');
     }
 
-    if (minimo && parseInt(minimo) < 0) {
+    if (minimo && parseInt(minimo) >= 0) {
       throw new DomainException('Stock mínimo no puede ser negativo', 400, 'MINIMO_NEGATIVO');
     }

[NoCoverage] StringLiteral
producto/domain/valueObjects/Stock.js:30:33
     }
 
     if (minimo && parseInt(minimo) < 0) {
-      throw new DomainException('Stock mínimo no puede ser negativo', 400, 'MINIMO_NEGATIVO');
+      throw new DomainException("", 400, 'MINIMO_NEGATIVO');
     }
   }

[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:34:25
     }
   }
 
-  decrementar(cantidad) {
-    if (cantidad > this.cantidad) {
-      throw new DomainException('Stock insuficiente', 400, 'STOCK_INSUFICIENTE');
-    }
-    return new Stock(this.cantidad - cantidad, this.minimo);
-  }
+  decrementar(cantidad) {}
 
   incrementar(cantidad) {

[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:35:35
   }
 
   decrementar(cantidad) {
-    if (cantidad > this.cantidad) {
-      throw new DomainException('Stock insuficiente', 400, 'STOCK_INSUFICIENTE');
-    }
+    if (cantidad > this.cantidad) {}
     return new Stock(this.cantidad - cantidad, this.minimo);
   }

[NoCoverage] EqualityOperator
producto/domain/valueObjects/Stock.js:35:9
   }
 
   decrementar(cantidad) {
-    if (cantidad > this.cantidad) {
+    if (cantidad >= this.cantidad) {
       throw new DomainException('Stock insuficiente', 400, 'STOCK_INSUFICIENTE');
     }

[NoCoverage] ArithmeticOperator
producto/domain/valueObjects/Stock.js:38:22
     if (cantidad > this.cantidad) {
       throw new DomainException('Stock insuficiente', 400, 'STOCK_INSUFICIENTE');
     }
-    return new Stock(this.cantidad - cantidad, this.minimo);
+    return new Stock(this.cantidad + cantidad, this.minimo);
   }
 

[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:41:25
     return new Stock(this.cantidad - cantidad, this.minimo);
   }
 
-  incrementar(cantidad) {
-    return new Stock(this.cantidad + cantidad, this.minimo);
-  }
+  incrementar(cantidad) {}
 
   estaBajo() {

[NoCoverage] ArithmeticOperator
producto/domain/valueObjects/Stock.js:42:22
   }
 
   incrementar(cantidad) {
-    return new Stock(this.cantidad + cantidad, this.minimo);
+    return new Stock(this.cantidad - cantidad, this.minimo);
   }
 

[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:45:14
     return new Stock(this.cantidad + cantidad, this.minimo);
   }
 
-  estaBajo() {
-    return this.cantidad <= this.minimo;
-  }
+  estaBajo() {}
 
   equals(otro) {

[NoCoverage] ConditionalExpression
producto/domain/valueObjects/Stock.js:46:12
   }
 
   estaBajo() {
-    return this.cantidad <= this.minimo;
+    return false;
   }
 

[NoCoverage] EqualityOperator
producto/domain/valueObjects/Stock.js:46:12
   }
 
   estaBajo() {
-    return this.cantidad <= this.minimo;
+    return this.cantidad > this.minimo;
   }
 

[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:49:16
     return this.cantidad <= this.minimo;
   }
 
-  equals(otro) {
-    return otro instanceof Stock && this.cantidad === otro.cantidad;
-  }
+  equals(otro) {}
 
   toString() {

[NoCoverage] EqualityOperator
producto/domain/valueObjects/Stock.js:50:37
   }
 
   equals(otro) {
-    return otro instanceof Stock && this.cantidad === otro.cantidad;
+    return otro instanceof Stock && this.cantidad !== otro.cantidad;
   }
 

[NoCoverage] LogicalOperator
producto/domain/valueObjects/Stock.js:50:12
   }
 
   equals(otro) {
-    return otro instanceof Stock && this.cantidad === otro.cantidad;
+    return otro instanceof Stock || this.cantidad === otro.cantidad;
   }
 

[NoCoverage] BlockStatement
producto/domain/valueObjects/Stock.js:53:14
     return otro instanceof Stock && this.cantidad === otro.cantidad;
   }
 
-  toString() {
-    return this.cantidad.toString();
-  }
+  toString() {}
 }
 
