[NoCoverage] BlockStatement
src/modules/producto/index.js:8:39
 
 const productoRoutes =require('./presentation/routes/productoRoutes');
 
-module.exports = (socketIOEmitter) => {
-    const productoRepository = new ProductoRepository();
-
-    const obtenerProductosApplicationService = new ObtenerAlertasApplicationService(productoRepository);
-    const actualizarProductoApplicationService = new ActualizarProductoApplicationService(productoRepository);
-    const eliminarProductoApplicationService = new EliminarProductoApplicationService(productoRepository);
-
-    return productoRoutes(
-        obtenerProductosApplicationService,
-        actualizarProductoApplicationService,
-        eliminarProductoApplicationService
-    );
-};
+module.exports = (socketIOEmitter) => {};
