[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:49:26
   /**
    * Obtener producto por ID
    */
-  async obtenerPorId(id) {
-    const query = `
-      SELECT id_producto, nombre, stock, min_stock, precio_unit, estado, descripcion, imagen_url, id_categoria
-      FROM producto
-      WHERE id_producto = $1
-    `;
-
-    const { rows } = await db.query(query, [id]);
-    return rows[0] ? this._mapearAProducto(rows[0]) : null;
-  }
+  async obtenerPorId(id) {}
 
   /**

[NoCoverage] StringLiteral
modules/producto/infrastructure/ProductoRepository.js:50:19
    * Obtener producto por ID
    */
   async obtenerPorId(id) {
-    const query = `
-      SELECT id_producto, nombre, stock, min_stock, precio_unit, estado, descripcion, imagen_url, id_categoria
-      FROM producto
-      WHERE id_producto = $1
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [id]);

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:63:24
   /**
    * Obtener todos los productos activos
    */
-  async obtenerTodos() {
-    const query = `
-      SELECT id_producto, nombre, stock, min_stock, precio_unit, estado, descripcion, imagen_url, id_categoria
-      FROM producto
-      WHERE estado = 'activo'
-      ORDER BY nombre
-    `;
-
-    const { rows } = await db.query(query);
-    return rows.map(row => this._mapearAProducto(row));
-  }
+  async obtenerTodos() {}
 
   /**

[NoCoverage] StringLiteral
modules/producto/infrastructure/ProductoRepository.js:64:19
    * Obtener todos los productos activos
    */
   async obtenerTodos() {
-    const query = `
-      SELECT id_producto, nombre, stock, min_stock, precio_unit, estado, descripcion, imagen_url, id_categoria
-      FROM producto
-      WHERE estado = 'activo'
-      ORDER BY nombre
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query);

[NoCoverage] ArrowFunction
modules/producto/infrastructure/ProductoRepository.js:72:21
     `;
 
     const { rows } = await db.query(query);
-    return rows.map(row => this._mapearAProducto(row));
+    return rows.map(() => undefined);
   }
 

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:78:33
   /**
    * Buscar productos por nombre
    */
-  async buscarPorNombre(nombre) {
-    const query = `
-      SELECT id_producto, nombre, stock, min_stock, precio_unit, estado, descripcion, imagen_url, id_categoria
-      FROM producto
-      WHERE nombre ILIKE $1 AND estado = 'activo'
-      ORDER BY nombre
-    `;
-
-    const { rows } = await db.query(query, [`%${nombre}%`]);
-    return rows.map(row => this._mapearAProducto(row));
-  }
+  async buscarPorNombre(nombre) {}
 
   /**

[NoCoverage] StringLiteral
modules/producto/infrastructure/ProductoRepository.js:79:19
    * Buscar productos por nombre
    */
   async buscarPorNombre(nombre) {
-    const query = `
-      SELECT id_producto, nombre, stock, min_stock, precio_unit, estado, descripcion, imagen_url, id_categoria
-      FROM producto
-      WHERE nombre ILIKE $1 AND estado = 'activo'
-      ORDER BY nombre
-    `;
+    const query = ``;
 
     const { rows } = await db.query(query, [`%${nombre}%`]);

[NoCoverage] ArrowFunction
modules/producto/infrastructure/ProductoRepository.js:87:21
     `;
 
     const { rows } = await db.query(query, [`%${nombre}%`]);
-    return rows.map(row => this._mapearAProducto(row));
+    return rows.map(() => undefined);
   }
 

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:93:28
   /**
    * Obtener productos con stock bajo
    */
-  async obtenerStockBajo() {
-    const query = `
-      SELECT id_producto, nombre, stock, min_stock, precio_unit, estado, descripcion, imagen_url, id_categoria
-      FROM producto
-      WHERE stock <= min_stock AND estado = 'activo'
-      ORDER BY stock ASC
-    `;
-
-    const { rows } = await db.query(query);
-    return rows.map(row => this._mapearAProducto(row));
-  }
+  async obtenerStockBajo() {}
 
   /**

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:108:48
   /**
    * Decrementar stock (venta)
    */
-  async decrementarStock(idProducto, cantidad) {
-    const query = `
-      UPDATE producto
-      SET stock = stock - $1
-      WHERE id_producto = $2 AND stock >= $1
-      RETURNING stock
-    `;
-
-    const { rows } = await db.query(query, [cantidad, idProducto]);
-    
-    if (rows.length === 0) {
-      throw new Error('Stock insuficiente o producto no encontrado');
-    }
-
-    return rows[0].stock;
-  }
+  async decrementarStock(idProducto, cantidad) {}
 
   /**

[NoCoverage] ArrayDeclaration
modules/producto/infrastructure/ProductoRepository.js:116:44
       RETURNING stock
     `;
 
-    const { rows } = await db.query(query, [cantidad, idProducto]);
+    const { rows } = await db.query(query, []);
     
     if (rows.length === 0) {

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:118:28
 
     const { rows } = await db.query(query, [cantidad, idProducto]);
     
-    if (rows.length === 0) {
-      throw new Error('Stock insuficiente o producto no encontrado');
-    }
+    if (rows.length === 0) {}
 
     return rows[0].stock;

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:128:48
   /**
    * Incrementar stock (restock)
    */
-  async incrementarStock(idProducto, cantidad) {
-    const query = `
-      UPDATE producto
-      SET stock = stock + $1
-      WHERE id_producto = $2
-      RETURNING stock
-    `;
-
-    const { rows } = await db.query(query, [cantidad, idProducto]);
-    return rows[0]?.stock || null;
-  }
+  async incrementarStock(idProducto, cantidad) {}
 
   /**

[NoCoverage] ConditionalExpression
modules/producto/infrastructure/ProductoRepository.js:137:12
     `;
 
     const { rows } = await db.query(query, [cantidad, idProducto]);
-    return rows[0]?.stock || null;
+    return false;
   }
 

[NoCoverage] LogicalOperator
modules/producto/infrastructure/ProductoRepository.js:137:12
     `;
 
     const { rows } = await db.query(query, [cantidad, idProducto]);
-    return rows[0]?.stock || null;
+    return rows[0]?.stock && null;
   }
 

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:143:41
   /**
    * Productos más vendidos
    */
-  async obtenerMasVendidos(limite = 10) {
-    const query = `
-      SELECT p.id_producto, p.nombre, p.precio_unit, SUM(db.cantidad) as cantidad_vendida
-      FROM producto p
-      JOIN detalle_boleta db ON p.id_producto = db.id_producto
-      JOIN boleta b ON db.id_boleta = b.id_boleta
-      WHERE p.estado = 'activo' AND b.estado_boleta = 'pagado'
-      GROUP BY p.id_producto, p.nombre, p.precio_unit
-      ORDER BY cantidad_vendida DESC
-      LIMIT $1
-    `;
-
-    const { rows } = await db.query(query, [limite]);
-    return rows.map(row => this._mapearAProducto(row));
-  }
+  async obtenerMasVendidos(limite = 10) {}
 
   /**

[NoCoverage] ArrowFunction
modules/producto/infrastructure/ProductoRepository.js:156:21
     `;
 
     const { rows } = await db.query(query, [limite]);
-    return rows.map(row => this._mapearAProducto(row));
+    return rows.map(() => undefined);
   }
 

[NoCoverage] BlockStatement
modules/producto/infrastructure/ProductoRepository.js:162:26
   /**
    * Mapear fila de BD a Entidad Producto
    */
-  _mapearAProducto(fila) {
-    return new Producto(
-      fila.id_producto,
-      fila.nombre,
-      new Precio(fila.precio_unit),
-      fila.stock,
-      fila.min_stock,
-      fila.descripcion,
-      fila.imagen_url,
-      fila.id_categoria
-    );
-  }
+  _mapearAProducto(fila) {}
 }
 
