[Killed] BlockStatement
producto/presentation/controllers/AlertasController.js:6:49
  * Maneja alertas del sistema
  */
 class AlertasController {
-  constructor(obtenerAlertasApplicationService) {
-    this.obtenerAlertasApplicationService = obtenerAlertasApplicationService;
-  }
+  constructor(obtenerAlertasApplicationService) {}
 
   /**
killedBy: AlertasRoutes GET /alertas/stock-bajo debería retornar 200 con lista de productos con stock bajo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] BlockStatement
producto/presentation/controllers/AlertasController.js:13:51
   /**
    * GET /alertas/stock-bajo
    */
-  async obtenerProductosStockBajo(req, res, next) {
-    try {
-      const resultado = await this.obtenerAlertasApplicationService.obtenerProductosStockBajo();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerProductosStockBajo(req, res, next) {}
 
   /**

[Timeout] BlockStatement
producto/presentation/controllers/AlertasController.js:14:9
    * GET /alertas/stock-bajo
    */
   async obtenerProductosStockBajo(req, res, next) {
-    try {
-      const resultado = await this.obtenerAlertasApplicationService.obtenerProductosStockBajo();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[Killed] ObjectLiteral
producto/presentation/controllers/AlertasController.js:17:35
     try {
       const resultado = await this.obtenerAlertasApplicationService.obtenerProductosStockBajo();
 
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
+      return res.status(200).json({});
     } catch (error) {
       next(error);
killedBy: AlertasRoutes GET /alertas/stock-bajo debería retornar 200 con lista de productos con stock bajo
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 22
+ Received  +  1

- Object {
-   "data": Object {
-     "alertas": Array [

[Timeout] BlockStatement
producto/presentation/controllers/AlertasController.js:29:47
   /**
    * POST /alertas/emitir-stock-bajo/:idProducto
    */
-  async emitirAlertaStockBajo(req, res, next) {
-    try {
-      const { idProducto } = req.params;
-
-      const resultado = await this.obtenerAlertasApplicationService.emitirAlertaStockBajo(
-        parseInt(idProducto)
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async emitirAlertaStockBajo(req, res, next) {}
 }
 

[Timeout] BlockStatement
producto/presentation/controllers/AlertasController.js:30:9
    * POST /alertas/emitir-stock-bajo/:idProducto
    */
   async emitirAlertaStockBajo(req, res, next) {
-    try {
-      const { idProducto } = req.params;
-
-      const resultado = await this.obtenerAlertasApplicationService.emitirAlertaStockBajo(
-        parseInt(idProducto)
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
