[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:10:5
     obtenerProductosApplicationService,
     actualizarProductoApplicationService,
     eliminarProductoApplicationService
-  ) {
-    this.obtenerProductosApplicationService = obtenerProductosApplicationService;
-    this.actualizarProductoApplicationService = actualizarProductoApplicationService;
-    this.eliminarProductoApplicationService = eliminarProductoApplicationService;
-  }
+  ) {}
 
   /**
killedBy: ProductoRoutes GET /productos debería retornar 200 con lista de productos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:19:38
   /**
    * GET /productos
    */
-  async obtenerTodos(req, res, next) {
-    try {
-      const resultado = await this.obtenerProductosApplicationService.obtenerTodos();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerTodos(req, res, next) {}
 
   /**
killedBy: ProductoRoutes GET /productos debería retornar 200 con lista de productos
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:20:9
    * GET /productos
    */
   async obtenerTodos(req, res, next) {
-    try {
-      const resultado = await this.obtenerProductosApplicationService.obtenerTodos();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
killedBy: ProductoRoutes GET /productos debería retornar 200 con lista de productos
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] BlockStatement
producto/presentation/controllers/ProductoController.js:35:32
   /**
    * GET /productos/buscar
    */
-  async buscar(req, res, next) {
-    try {
-      const { q } = req.query;
-
-      if (!q) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'PARAMETRO_AUSENTE',
-          mensaje: 'Parámetro "q" es requerido'
-        });
-      }
-
-      const resultado = await this.obtenerProductosApplicationService.buscar(q);
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async buscar(req, res, next) {}
 
   /**

[Timeout] BlockStatement
producto/presentation/controllers/ProductoController.js:36:9
    * GET /productos/buscar
    */
   async buscar(req, res, next) {
-    try {
-      const { q } = req.query;
-
-      if (!q) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'PARAMETRO_AUSENTE',
-          mensaje: 'Parámetro "q" es requerido'
-        });
-      }
-
-      const resultado = await this.obtenerProductosApplicationService.buscar(q);
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[Killed] BooleanLiteral
producto/presentation/controllers/ProductoController.js:39:11
     try {
       const { q } = req.query;
 
-      if (!q) {
+      if (q) {
         return res.status(400).json({
           success: false,
killedBy: ProductoRoutes GET /productos/buscar debería retornar 200 cuando parámetro q existe
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] StringLiteral
producto/presentation/controllers/ProductoController.js:42:19
       if (!q) {
         return res.status(400).json({
           success: false,
-          codigo: 'PARAMETRO_AUSENTE',
+          codigo: "",
           mensaje: 'Parámetro "q" es requerido'
         });
killedBy: ProductoRoutes GET /productos/buscar debería retornar 400 cuando falta parámetro q
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "codigo": "PARAMETRO_AUSENTE",
+   "codigo": "",

[Killed] StringLiteral
producto/presentation/controllers/ProductoController.js:43:20
         return res.status(400).json({
           success: false,
           codigo: 'PARAMETRO_AUSENTE',
-          mensaje: 'Parámetro "q" es requerido'
+          mensaje: ""
         });
       }
killedBy: ProductoRoutes GET /productos/buscar debería retornar 400 cuando falta parámetro q
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "codigo": "PARAMETRO_AUSENTE",
-   "mensaje": "Parámetro \"q\" es requerido",

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:61:42
   /**
    * GET /productos/stock-bajo
    */
-  async obtenerStockBajo(req, res, next) {
-    try {
-      const resultado = await this.obtenerProductosApplicationService.obtenerStockBajo();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerStockBajo(req, res, next) {}
 
   /**
killedBy: ProductoRoutes GET /productos/stock-bajo debería retornar 200 con productos con stock bajo
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:62:9
    * GET /productos/stock-bajo
    */
   async obtenerStockBajo(req, res, next) {
-    try {
-      const resultado = await this.obtenerProductosApplicationService.obtenerStockBajo();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
killedBy: ProductoRoutes GET /productos/stock-bajo debería retornar 200 con productos con stock bajo
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] BlockStatement
producto/presentation/controllers/ProductoController.js:77:44
   /**
    * GET /productos/mas-vendidos
    */
-  async obtenerMasVendidos(req, res, next) {
-    try {
-      const { limite } = req.query;
-      const resultado = await this.obtenerProductosApplicationService.obtenerMasVendidos(
-        limite ? parseInt(limite) : 10
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerMasVendidos(req, res, next) {}
 
   /**

[Timeout] BlockStatement
producto/presentation/controllers/ProductoController.js:78:9
    * GET /productos/mas-vendidos
    */
   async obtenerMasVendidos(req, res, next) {
-    try {
-      const { limite } = req.query;
-      const resultado = await this.obtenerProductosApplicationService.obtenerMasVendidos(
-        limite ? parseInt(limite) : 10
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:96:36
   /**
    * PUT /productos/:id
    */
-  async actualizar(req, res, next) {
-    try {
-      const { id } = req.params;
-      const { nombre, precio, minStock, descripcion, imagenUrl, idCategoria } = req.body;
-
-      const resultado = await this.actualizarProductoApplicationService.ejecutar({
-        idProducto: parseInt(id),
-        nombre,
-        precio,
-        minStock,
-        descripcion,
-        imagenUrl,
-        idCategoria
-      });
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async actualizar(req, res, next) {}
 
   /**
killedBy: ProductoController actualizar parsea id y responde 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"descripcion": "desc", "idCategoria": 3, "idProducto": 11, "imagenUrl": "img", "minStock": 5, "nombre": "Teclado Pro", "precio": 20000}

Number of calls: 0

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:97:9
    * PUT /productos/:id
    */
   async actualizar(req, res, next) {
-    try {
-      const { id } = req.params;
-      const { nombre, precio, minStock, descripcion, imagenUrl, idCategoria } = req.body;
-
-      const resultado = await this.actualizarProductoApplicationService.ejecutar({
-        idProducto: parseInt(id),
-        nombre,
-        precio,
-        minStock,
-        descripcion,
-        imagenUrl,
-        idCategoria
-      });
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
killedBy: ProductoController actualizar parsea id y responde 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"descripcion": "desc", "idCategoria": 3, "idProducto": 11, "imagenUrl": "img", "minStock": 5, "nombre": "Teclado Pro", "precio": 20000}

Number of calls: 0

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:123:34
   /**
    * DELETE /productos/:id
    */
-  async eliminar(req, res, next) {
-    try {
-      const { id } = req.params;
-
-      const resultado = await this.eliminarProductoApplicationService.ejecutar({
-        idProducto: parseInt(id)
-      });
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async eliminar(req, res, next) {}
 }
 
killedBy: ProductoRoutes DELETE /productos/:id debería retornar 200 cuando eliminación es exitosa
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
producto/presentation/controllers/ProductoController.js:124:9
    * DELETE /productos/:id
    */
   async eliminar(req, res, next) {
-    try {
-      const { id } = req.params;
-
-      const resultado = await this.eliminarProductoApplicationService.ejecutar({
-        idProducto: parseInt(id)
-      });
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
killedBy: ProductoRoutes DELETE /productos/:id debería retornar 200 cuando eliminación es exitosa
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
