[NoCoverage] BlockStatement
modules/reporte/application/ObtenerReportesApplicationService.js:6:53
  * Orquesta reportes y análisis de ventas
  */
 class ObtenerReportesApplicationService {
-  constructor(boletaRepository, productoRepository) {
-    this.boletaRepository = boletaRepository;
-    this.productoRepository = productoRepository;
-  }
+  constructor(boletaRepository, productoRepository) {}
 
   /**

[NoCoverage] BlockStatement
modules/reporte/application/ObtenerReportesApplicationService.js:14:56
   /**
    * Obtener ventas por período
    */
-  async obtenerVentasPorPeriodo(fechaInicio, fechaFin) {
-    const boletasPagadas = await this.boletaRepository.obtenerPagadas(fechaInicio, fechaFin);
-    const totalVentas = await this.boletaRepository.obtenerTotalVentas(fechaInicio, fechaFin);
-
-    const cantidadVentas = boletasPagadas.length;
-    const promedioVenta = cantidadVentas > 0 ? totalVentas / cantidadVentas : 0;
-
-    return {
-      fechaInicio,
-      fechaFin,
-      cantidadVentas,
-      totalVentas,
-      promedioVenta,
-      boletas: boletasPagadas.map(b => this._serializarBoleta(b))
-    };
-  }
+  async obtenerVentasPorPeriodo(fechaInicio, fechaFin) {}
 
   /**

[NoCoverage] ConditionalExpression
modules/reporte/application/ObtenerReportesApplicationService.js:19:27
     const totalVentas = await this.boletaRepository.obtenerTotalVentas(fechaInicio, fechaFin);
 
     const cantidadVentas = boletasPagadas.length;
-    const promedioVenta = cantidadVentas > 0 ? totalVentas / cantidadVentas : 0;
+    const promedioVenta = false ? totalVentas / cantidadVentas : 0;
 
     return {

[NoCoverage] ArithmeticOperator
modules/reporte/application/ObtenerReportesApplicationService.js:19:48
     const totalVentas = await this.boletaRepository.obtenerTotalVentas(fechaInicio, fechaFin);
 
     const cantidadVentas = boletasPagadas.length;
-    const promedioVenta = cantidadVentas > 0 ? totalVentas / cantidadVentas : 0;
+    const promedioVenta = cantidadVentas > 0 ? totalVentas * cantidadVentas : 0;
 
     return {

[NoCoverage] ArrowFunction
modules/reporte/application/ObtenerReportesApplicationService.js:27:35
       cantidadVentas,
       totalVentas,
       promedioVenta,
-      boletas: boletasPagadas.map(b => this._serializarBoleta(b))
+      boletas: boletasPagadas.map(() => undefined)
     };
   }

[NoCoverage] BlockStatement
modules/reporte/application/ObtenerReportesApplicationService.js:34:50
   /**
    * Obtener productos más vendidos
    */
-  async obtenerProductosMasVendidos(limite = 10) {
-    const productos = await this.productoRepository.obtenerMasVendidos(limite);
-
-    return {
-      cantidad: productos.length,
-      productos: productos.map(p => ({
-        id: p.id,
-        nombre: p.nombre,
-        cantidadVendida: p.cantidad_vendida || 0,
-        precio: p.precio.monto
-      }))
-    };
-  }
+  async obtenerProductosMasVendidos(limite = 10) {}
 
   /**

[NoCoverage] ArrowFunction
modules/reporte/application/ObtenerReportesApplicationService.js:39:32
 
     return {
       cantidad: productos.length,
-      productos: productos.map(p => ({
-        id: p.id,
-        nombre: p.nombre,
-        cantidadVendida: p.cantidad_vendida || 0,
-        precio: p.precio.monto
-      }))
+      productos: productos.map(() => undefined)
     };
   }

[NoCoverage] ConditionalExpression
modules/reporte/application/ObtenerReportesApplicationService.js:42:26
       productos: productos.map(p => ({
         id: p.id,
         nombre: p.nombre,
-        cantidadVendida: p.cantidad_vendida || 0,
+        cantidadVendida: true,
         precio: p.precio.monto
       }))

[NoCoverage] ConditionalExpression
modules/reporte/application/ObtenerReportesApplicationService.js:42:26
       productos: productos.map(p => ({
         id: p.id,
         nombre: p.nombre,
-        cantidadVendida: p.cantidad_vendida || 0,
+        cantidadVendida: false,
         precio: p.precio.monto
       }))

[NoCoverage] BlockStatement
modules/reporte/application/ObtenerReportesApplicationService.js:51:29
   /**
    * Obtener inventario actual
    */
-  async obtenerInventario() {
-    const productos = await this.productoRepository.obtenerTodos();
-
-    const totalValor = productos.reduce((acc, p) => {
-      return acc + (p.precio.monto * p.stock.cantidad);
-    }, 0);
-
-    const productosBajo = productos.filter(p => p.tieneStockBajo()).length;
-
-    return {
-      totalProductos: productos.length,
-      totalValorInventario: totalValor,
-      productosBajo,
-      productos: productos.map(p => ({
-        id: p.id,
-        nombre: p.nombre,
-        stock: p.stock.cantidad,
-        minStock: p.minStock,
-        precio: p.precio.monto,
-        valorTotal: p.precio.monto * p.stock.cantidad,
-        tieneStockBajo: p.tieneStockBajo()
-      }))
-    };
-  }
+  async obtenerInventario() {}
 
   /**

[NoCoverage] BlockStatement
modules/reporte/application/ObtenerReportesApplicationService.js:54:53
   async obtenerInventario() {
     const productos = await this.productoRepository.obtenerTodos();
 
-    const totalValor = productos.reduce((acc, p) => {
-      return acc + (p.precio.monto * p.stock.cantidad);
-    }, 0);
+    const totalValor = productos.reduce((acc, p) => {}, 0);
 
     const productosBajo = productos.filter(p => p.tieneStockBajo()).length;

[NoCoverage] ArithmeticOperator
modules/reporte/application/ObtenerReportesApplicationService.js:55:14
     const productos = await this.productoRepository.obtenerTodos();
 
     const totalValor = productos.reduce((acc, p) => {
-      return acc + (p.precio.monto * p.stock.cantidad);
+      return acc - p.precio.monto * p.stock.cantidad;
     }, 0);
 

[NoCoverage] ArithmeticOperator
modules/reporte/application/ObtenerReportesApplicationService.js:55:21
     const productos = await this.productoRepository.obtenerTodos();
 
     const totalValor = productos.reduce((acc, p) => {
-      return acc + (p.precio.monto * p.stock.cantidad);
+      return acc + (p.precio.monto / p.stock.cantidad);
     }, 0);
 

[NoCoverage] MethodExpression
modules/reporte/application/ObtenerReportesApplicationService.js:58:27
       return acc + (p.precio.monto * p.stock.cantidad);
     }, 0);
 
-    const productosBajo = productos.filter(p => p.tieneStockBajo()).length;
+    const productosBajo = productos.length;
 
     return {

[NoCoverage] ArrowFunction
modules/reporte/application/ObtenerReportesApplicationService.js:58:44
       return acc + (p.precio.monto * p.stock.cantidad);
     }, 0);
 
-    const productosBajo = productos.filter(p => p.tieneStockBajo()).length;
+    const productosBajo = productos.filter(() => undefined).length;
 
     return {

[NoCoverage] ArrowFunction
modules/reporte/application/ObtenerReportesApplicationService.js:64:32
       totalProductos: productos.length,
       totalValorInventario: totalValor,
       productosBajo,
-      productos: productos.map(p => ({
-        id: p.id,
-        nombre: p.nombre,
-        stock: p.stock.cantidad,
-        minStock: p.minStock,
-        precio: p.precio.monto,
-        valorTotal: p.precio.monto * p.stock.cantidad,
-        tieneStockBajo: p.tieneStockBajo()
-      }))
+      productos: productos.map(() => undefined)
     };
   }

[NoCoverage] ArithmeticOperator
modules/reporte/application/ObtenerReportesApplicationService.js:70:21
         stock: p.stock.cantidad,
         minStock: p.minStock,
         precio: p.precio.monto,
-        valorTotal: p.precio.monto * p.stock.cantidad,
+        valorTotal: p.precio.monto / p.stock.cantidad,
         tieneStockBajo: p.tieneStockBajo()
       }))

[NoCoverage] BlockStatement
modules/reporte/application/ObtenerReportesApplicationService.js:79:29
   /**
    * Serializar boleta para respuesta
    */
-  _serializarBoleta(boleta) {
-    return {
-      id: boleta.id,
-      tipoVenta: boleta.tipoVenta.toString(),
-      total: boleta.total.monto,
-      metodoPago: boleta.metodoPago,
-      estado: boleta.estado,
-      fechaEmision: boleta.fechaEmision
-    };
-  }
+  _serializarBoleta(boleta) {}
 }
 

[NoCoverage] ObjectLiteral
modules/reporte/application/ObtenerReportesApplicationService.js:80:12
    * Serializar boleta para respuesta
    */
   _serializarBoleta(boleta) {
-    return {
-      id: boleta.id,
-      tipoVenta: boleta.tipoVenta.toString(),
-      total: boleta.total.monto,
-      metodoPago: boleta.metodoPago,
-      estado: boleta.estado,
-      fechaEmision: boleta.fechaEmision
-    };
+    return {};
   }
 }
