[NoCoverage] BlockStatement
src/modules/reporte/index.js:7:39
 
 const reportesRoutes = require('./presentation/routes/reportesRoutes');
 
-module.exports = (socketIOEmitter) => {
-  const boletaRepository = new BoletaRepository();
-  const productoRepository = new ProductoRepository();
-
-  const obtenerReportesApplicationService = new ObtenerReportesApplicationService(
-    boletaRepository,
-    productoRepository
-  );
-
-  return reportesRoutes(obtenerReportesApplicationService);
-};
+module.exports = (socketIOEmitter) => {};
 
