[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:6:50
  * Maneja reportes y análisis
  */
 class ReportesController {
-  constructor(obtenerReportesApplicationService) {
-    this.obtenerReportesApplicationService = obtenerReportesApplicationService;
-  }
+  constructor(obtenerReportesApplicationService) {}
 
   /**

[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:13:49
   /**
    * GET /reportes/ventas
    */
-  async obtenerVentasPorPeriodo(req, res, next) {
-    try {
-      const { fechaInicio, fechaFin } = req.query;
-
-      if (!fechaInicio || !fechaFin) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'PARAMETROS_AUSENTES',
-          mensaje: 'fechaInicio y fechaFin son requeridos'
-        });
-      }
-
-      const resultado = await this.obtenerReportesApplicationService.obtenerVentasPorPeriodo(
-        new Date(fechaInicio),
-        new Date(fechaFin)
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerVentasPorPeriodo(req, res, next) {}
 
   /**

[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:14:9
    * GET /reportes/ventas
    */
   async obtenerVentasPorPeriodo(req, res, next) {
-    try {
-      const { fechaInicio, fechaFin } = req.query;
-
-      if (!fechaInicio || !fechaFin) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'PARAMETROS_AUSENTES',
-          mensaje: 'fechaInicio y fechaFin son requeridos'
-        });
-      }
-
-      const resultado = await this.obtenerReportesApplicationService.obtenerVentasPorPeriodo(
-        new Date(fechaInicio),
-        new Date(fechaFin)
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:17:38
     try {
       const { fechaInicio, fechaFin } = req.query;
 
-      if (!fechaInicio || !fechaFin) {
-        return res.status(400).json({
-          success: false,
-          codigo: 'PARAMETROS_AUSENTES',
-          mensaje: 'fechaInicio y fechaFin son requeridos'
-        });
-      }
+      if (!fechaInicio || !fechaFin) {}
 
       const resultado = await this.obtenerReportesApplicationService.obtenerVentasPorPeriodo(

[NoCoverage] LogicalOperator
reporte/presentation/controllers/ReportesController.js:17:11
     try {
       const { fechaInicio, fechaFin } = req.query;
 
-      if (!fechaInicio || !fechaFin) {
+      if (!fechaInicio && !fechaFin) {
         return res.status(400).json({
           success: false,

[NoCoverage] StringLiteral
reporte/presentation/controllers/ReportesController.js:21:20
         return res.status(400).json({
           success: false,
           codigo: 'PARAMETROS_AUSENTES',
-          mensaje: 'fechaInicio y fechaFin son requeridos'
+          mensaje: ""
         });
       }

[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:42:53
   /**
    * GET /reportes/productos-mas-vendidos
    */
-  async obtenerProductosMasVendidos(req, res, next) {
-    try {
-      const { limite } = req.query;
-
-      const resultado = await this.obtenerReportesApplicationService.obtenerProductosMasVendidos(
-        limite ? parseInt(limite) : 10
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerProductosMasVendidos(req, res, next) {}
 
   /**

[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:43:9
    * GET /reportes/productos-mas-vendidos
    */
   async obtenerProductosMasVendidos(req, res, next) {
-    try {
-      const { limite } = req.query;
-
-      const resultado = await this.obtenerReportesApplicationService.obtenerProductosMasVendidos(
-        limite ? parseInt(limite) : 10
-      );
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }

[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:62:43
   /**
    * GET /reportes/inventario
    */
-  async obtenerInventario(req, res, next) {
-    try {
-      const resultado = await this.obtenerReportesApplicationService.obtenerInventario();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
-      next(error);
-    }
-  }
+  async obtenerInventario(req, res, next) {}
 }
 

[NoCoverage] BlockStatement
reporte/presentation/controllers/ReportesController.js:63:9
    * GET /reportes/inventario
    */
   async obtenerInventario(req, res, next) {
-    try {
-      const resultado = await this.obtenerReportesApplicationService.obtenerInventario();
-
-      return res.status(200).json({
-        success: true,
-        data: resultado
-      });
-    } catch (error) {
+    try {} catch (error) {
       next(error);
     }
