[NoCoverage] BlockStatement
reporte/presentation/routes/reportesRoutes.js:6:57
 const autenticacionMiddleware = require('../../../shared/middleware/autenticacionMiddleware');
 const { esAdministrador } = require('../../../shared/middleware/rolMiddleware');
 
-module.exports = (obtenerReportesApplicationService) => {
-  const router = express.Router();
-  const controller = new ReportesController(obtenerReportesApplicationService);
-
-  // GET /reportes/ventas (solo administrador)
-  router.get('/ventas', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerVentasPorPeriodo(req, res, next));
-
-  // GET /reportes/productos-mas-vendidos (solo administrador)
-  router.get('/productos-mas-vendidos', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerProductosMasVendidos(req, res, next));
-
-  // GET /reportes/inventario (solo administrador)
-  router.get('/inventario', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerInventario(req, res, next));
-
-  return router;
-};
+module.exports = (obtenerReportesApplicationService) => {};
 

[NoCoverage] ArrowFunction
reporte/presentation/routes/reportesRoutes.js:11:67
   const controller = new ReportesController(obtenerReportesApplicationService);
 
   // GET /reportes/ventas (solo administrador)
-  router.get('/ventas', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerVentasPorPeriodo(req, res, next));
+  router.get('/ventas', autenticacionMiddleware, esAdministrador, () => undefined);
 
   // GET /reportes/productos-mas-vendidos (solo administrador)

[NoCoverage] ArrowFunction
reporte/presentation/routes/reportesRoutes.js:14:83
   router.get('/ventas', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerVentasPorPeriodo(req, res, next));
 
   // GET /reportes/productos-mas-vendidos (solo administrador)
-  router.get('/productos-mas-vendidos', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerProductosMasVendidos(req, res, next));
+  router.get('/productos-mas-vendidos', autenticacionMiddleware, esAdministrador, () => undefined);
 
   // GET /reportes/inventario (solo administrador)

[NoCoverage] ArrowFunction
reporte/presentation/routes/reportesRoutes.js:17:71
   router.get('/productos-mas-vendidos', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerProductosMasVendidos(req, res, next));
 
   // GET /reportes/inventario (solo administrador)
-  router.get('/inventario', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerInventario(req, res, next));
+  router.get('/inventario', autenticacionMiddleware, esAdministrador, () => undefined);
 
   return router;
