[Killed] BlockStatement
modules/usuario/application/AutenticacionApplicationService.js:11:34
  * Orquesta login y registro de usuarios
  */
 class AutenticacionApplicationService {
-  constructor(usuarioRepository) {
-    this.usuarioRepository = usuarioRepository;
-  }
+  constructor(usuarioRepository) {}
 
   /**
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BooleanLiteral
modules/usuario/application/AutenticacionApplicationService.js:22:9
     // Obtener usuario por nombre
     const usuario = await this.usuarioRepository.obtenerPorNombreUsuario(username);
     
-    if (!usuario) {
+    if (usuario) {
       throw new Error('Usuario no encontrado');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
modules/usuario/application/AutenticacionApplicationService.js:22:19
     // Obtener usuario por nombre
     const usuario = await this.usuarioRepository.obtenerPorNombreUsuario(username);
     
-    if (!usuario) {
-      throw new Error('Usuario no encontrado');
-    }
+    if (!usuario) {}
 
     // Validar que sea administrador
killedBy: AutenticacionApplicationService - unit loginAdministrador debe fallar si usuario no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Usuario no encontrado"
Received message:   "Cannot read properties of null (reading 'rol')"

      85 |
      86 |       // Validar que sea administrador
    > 87 |       if (stryMutAct_9fa48("1014") ? usuario.rol === 'administrador' : stryMutAct_9fa48("1013") ? false : stryMutAct_9fa48("1012") ? true : (stryCov_9fa48("1012",

[Killed] ConditionalExpression
modules/usuario/application/AutenticacionApplicationService.js:27:9
     }
 
     // Validar que sea administrador
-    if (usuario.rol !== 'administrador') {
+    if (false) {
       throw new Error('Acceso denegado. Solo administradores pueden ingresar en este momento');
     }
killedBy: AutenticacionApplicationService - unit loginAdministrador debe fallar si rol no es administrador
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"token": "token-jwt", "usuario": {"apellidos": undefined, "id": undefined, "nombre": undefined, "rol": "cliente", "username": undefined}}

[Killed] EqualityOperator
modules/usuario/application/AutenticacionApplicationService.js:27:9
     }
 
     // Validar que sea administrador
-    if (usuario.rol !== 'administrador') {
+    if (usuario.rol === 'administrador') {
       throw new Error('Acceso denegado. Solo administradores pueden ingresar en este momento');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
modules/usuario/application/AutenticacionApplicationService.js:32:9
     }
 
     // Validar que esté activo
-    if (usuario.estado !== 'activo') {
+    if (false) {
       throw new Error('Usuario inactivo');
     }
killedBy: AutenticacionApplicationService - unit loginAdministrador debe fallar si usuario inactivo
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"token": "token-jwt", "usuario": {"apellidos": undefined, "id": undefined, "nombre": undefined, "rol": "administrador", "username": undefined}}

[Killed] EqualityOperator
modules/usuario/application/AutenticacionApplicationService.js:32:9
     }
 
     // Validar que esté activo
-    if (usuario.estado !== 'activo') {
+    if (usuario.estado === 'activo') {
       throw new Error('Usuario inactivo');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] StringLiteral
modules/usuario/application/AutenticacionApplicationService.js:33:23
 
     // Validar que esté activo
     if (usuario.estado !== 'activo') {
-      throw new Error('Usuario inactivo');
+      throw new Error("");
     }
 
killedBy: AutenticacionApplicationService - unit loginAdministrador debe fallar si usuario inactivo
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Usuario inactivo"
Received message:   ""

      100 |         } else {
      101 |           stryCov_9fa48("1022");
    > 102 |           throw new Error(stryMutAct_9fa48("1023") ? "" : (stryCov_9fa48("1023"), 'Usuario inactivo'));

[Killed] ConditionalExpression
modules/usuario/application/AutenticacionApplicationService.js:39:9
     // Verificar contraseña
     const esValida = await bcrypt.compare(password, usuario.contrasena);
     
-    if (!esValida) {
+    if (false) {
       throw new Error('Contraseña incorrecta');
     }
killedBy: AutenticacionApplicationService - unit loginAdministrador debe fallar si contrasena incorrecta
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"token": "token-jwt", "usuario": {"apellidos": undefined, "id": undefined, "nombre": undefined, "rol": "administrador", "username": undefined}}

[Killed] BlockStatement
modules/usuario/application/AutenticacionApplicationService.js:39:20
     // Verificar contraseña
     const esValida = await bcrypt.compare(password, usuario.contrasena);
     
-    if (!esValida) {
-      throw new Error('Contraseña incorrecta');
-    }
+    if (!esValida) {}
 
     // Generar JWT
killedBy: AutenticacionApplicationService - unit loginAdministrador debe fallar si contrasena incorrecta
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"token": undefined, "usuario": {"apellidos": undefined, "id": undefined, "nombre": undefined, "rol": "administrador", "username": undefined}}

[Killed] StringLiteral
modules/usuario/application/AutenticacionApplicationService.js:40:23
     const esValida = await bcrypt.compare(password, usuario.contrasena);
     
     if (!esValida) {
-      throw new Error('Contraseña incorrecta');
+      throw new Error("");
     }
 
killedBy: AutenticacionApplicationService - unit loginAdministrador debe fallar si contrasena incorrecta
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Contraseña incorrecta"
Received message:   ""

      111 |         } else {
      112 |           stryCov_9fa48("1027");
    > 113 |           throw new Error(stryMutAct_9fa48("1028") ? "" : (stryCov_9fa48("1028"), 'Contraseña incorrecta'));

[Killed] StringLiteral
modules/usuario/application/AutenticacionApplicationService.js:52:20
         rol: usuario.rol
       },
       process.env.JWT_SECRET,
-      { expiresIn: '24h' }
+      { expiresIn: "" }
     );
 
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] ObjectLiteral
modules/usuario/application/AutenticacionApplicationService.js:52:7
         rol: usuario.rol
       },
       process.env.JWT_SECRET,
-      { expiresIn: '24h' }
+      {}
     );
 

[Killed] ConditionalExpression
modules/usuario/application/AutenticacionApplicationService.js:74:9
     // Verificar que no exista usuario
     const existente = await this.usuarioRepository.obtenerPorNombreUsuario(username);
     
-    if (existente) {
+    if (false) {
       throw new Error('Usuario ya existe');
     }
killedBy: AutenticacionApplicationService - unit registroAdministrador debe fallar si usuario existe
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"mensaje": "Administrador creado exitosamente", "usuario": {"nombre": "admin", "rol": "administrador", "username": "admin"}}

[Killed] BlockStatement
modules/usuario/application/AutenticacionApplicationService.js:74:20
     // Verificar que no exista usuario
     const existente = await this.usuarioRepository.obtenerPorNombreUsuario(username);
     
-    if (existente) {
-      throw new Error('Usuario ya existe');
-    }
+    if (existente) {}
 
     // Hash de contraseña
killedBy: AutenticacionApplicationService - unit registroAdministrador debe fallar si usuario existe
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"mensaje": "Administrador creado exitosamente", "usuario": {"nombre": "admin", "rol": "administrador", "username": "admin"}}

[Survived] ConditionalExpression
modules/usuario/application/AutenticacionApplicationService.js:88:7
       nombre,
       new Email(username + '@admin.local'),
       passwordHash,
-      apellidos || nombre,
+      true,
       'administrador',  // ← ROL ADMINISTRADOR
       'activo'

[Survived] ConditionalExpression
modules/usuario/application/AutenticacionApplicationService.js:88:7
       nombre,
       new Email(username + '@admin.local'),
       passwordHash,
-      apellidos || nombre,
+      false,
       'administrador',  // ← ROL ADMINISTRADOR
       'activo'

[Killed] ObjectLiteral
modules/usuario/application/AutenticacionApplicationService.js:96:12
     // Guardar
     await this.usuarioRepository.guardar(nuevoUsuario);
 
-    return {
-      mensaje: 'Administrador creado exitosamente',
-      usuario: {
-        username,
-        nombre,
-        rol: 'administrador'
-      }
-    };
+    return {};
   }
 
killedBy: AutenticacionApplicationService - unit registroAdministrador debe guardar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Administrador creado exitosamente"
Received: undefined

[Survived] ObjectLiteral
modules/usuario/application/AutenticacionApplicationService.js:98:16
 
     return {
       mensaje: 'Administrador creado exitosamente',
-      usuario: {
-        username,
-        nombre,
-        rol: 'administrador'
-      }
+      usuario: {}
     };
   }

[Killed] BlockStatement
modules/usuario/application/AutenticacionApplicationService.js:109:31
   /**
    * Verificar token JWT
    */
-  async verificarToken(token) {
-    try {
-      const decoded = jwt.verify(token, process.env.JWT_SECRET);
-      return decoded;
-    } catch (error) {
-      throw new Error('Token inválido o expirado');
-    }
-  }
+  async verificarToken(token) {}
 }
 
killedBy: Autenticacion - integracion debe verificar token
statusReason: TypeError: Cannot read properties of undefined (reading 'username')

[Killed] BlockStatement
modules/usuario/application/AutenticacionApplicationService.js:110:9
    * Verificar token JWT
    */
   async verificarToken(token) {
-    try {
-      const decoded = jwt.verify(token, process.env.JWT_SECRET);
-      return decoded;
-    } catch (error) {
+    try {} catch (error) {
       throw new Error('Token inválido o expirado');
     }
killedBy: Autenticacion - integracion debe verificar token
statusReason: TypeError: Cannot read properties of undefined (reading 'username')

[Killed] BlockStatement
modules/usuario/application/AutenticacionApplicationService.js:113:21
     try {
       const decoded = jwt.verify(token, process.env.JWT_SECRET);
       return decoded;
-    } catch (error) {
-      throw new Error('Token inválido o expirado');
-    }
+    } catch (error) {}
   }
 }
killedBy: AutenticacionApplicationService - unit verificarToken debe fallar si token invalido
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
