[Killed] ObjectLiteral
usuario/domain/entities/Usuario.js:8:18
  * Usuario base del sistema
  */
 class Usuario {
-  static ROLES = {
-    ADMINISTRADOR: 'administrador',
-    EMPLEADO: 'empleado',
-    CLIENTE: 'cliente'
-  };
+  static ROLES = {};
 
   static VALORES_VALIDOS = Object.values(Usuario.ROLES);
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] StringLiteral
usuario/domain/entities/Usuario.js:10:15
 class Usuario {
   static ROLES = {
     ADMINISTRADOR: 'administrador',
-    EMPLEADO: 'empleado',
+    EMPLEADO: "",
     CLIENTE: 'cliente'
   };
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
usuario/domain/entities/Usuario.js:11:14
   static ROLES = {
     ADMINISTRADOR: 'administrador',
     EMPLEADO: 'empleado',
-    CLIENTE: 'cliente'
+    CLIENTE: ""
   };
 
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
usuario/domain/entities/Usuario.js:16:98
 
   static VALORES_VALIDOS = Object.values(Usuario.ROLES);
 
-  constructor(id, nombre, email, contrasena, apellidos = '', rol = 'cliente', estado = 'activo') {
-    this.id = id;
-    this.nombre = nombre;
-    this.email = email instanceof Email ? email : new Email(email);
-    this.contrasena = contrasena;
-    this.apellidos = apellidos;
-    this.rol = rol;
-    this.estado = estado;
-    this.createdAt = new Date();
-  }
+  constructor(id, nombre, email, contrasena, apellidos = '', rol = 'cliente', estado = 'activo') {}
 
   /**
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[NoCoverage] StringLiteral
usuario/domain/entities/Usuario.js:16:68
 
   static VALORES_VALIDOS = Object.values(Usuario.ROLES);
 
-  constructor(id, nombre, email, contrasena, apellidos = '', rol = 'cliente', estado = 'activo') {
+  constructor(id, nombre, email, contrasena, apellidos = '', rol = "", estado = 'activo') {
     this.id = id;
     this.nombre = nombre;

[Killed] BlockStatement
usuario/domain/entities/Usuario.js:30:13
   /**
    * Validar reglas del Agregado
    */
-  validar() {
-    if (!this.nombre || this.nombre.trim() === '') {
-      throw new Error('Nombre requerido');
-    }
-
-    if (!this.email) {
-      throw new Error('Email requerido');
-    }
-
-    if (!this.contrasena || this.contrasena.trim() === '') {
-      throw new Error('Contraseña requerida');
-    }
-
-    if (!Usuario.VALORES_VALIDOS.includes(this.rol)) {
-      throw new Error(`Rol inválido. Debe ser uno de: ${Usuario.VALORES_VALIDOS.join(', ')}`);
-    }
-  }
+  validar() {}
 
   /**
killedBy: Cliente - validar debe lanzar error si falta el nombre
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Nombre requerido"

Received function did not throw

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:31:9
    * Validar reglas del Agregado
    */
   validar() {
-    if (!this.nombre || this.nombre.trim() === '') {
+    if (false) {
       throw new Error('Nombre requerido');
     }
killedBy: Cliente - validar debe lanzar error si falta el nombre
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Nombre requerido"

Received function did not throw

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:31:9
    * Validar reglas del Agregado
    */
   validar() {
-    if (!this.nombre || this.nombre.trim() === '') {
+    if (true) {
       throw new Error('Nombre requerido');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:35:9
       throw new Error('Nombre requerido');
     }
 
-    if (!this.email) {
+    if (true) {
       throw new Error('Email requerido');
     }
killedBy: Usuario - entidad debe validar rol permitido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Rol inválido"
Received message:   "Email requerido"

       96 |         } else {
       97 |           stryCov_9fa48("1076");
    >  98 |           throw new Error(stryMutAct_9fa48("1077") ? "" : (stryCov_9fa48("1077"), 'Email requerido'));

[Killed] BooleanLiteral
usuario/domain/entities/Usuario.js:35:9
       throw new Error('Nombre requerido');
     }
 
-    if (!this.email) {
+    if (this.email) {
       throw new Error('Email requerido');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] EqualityOperator
usuario/domain/entities/Usuario.js:39:29
       throw new Error('Email requerido');
     }
 
-    if (!this.contrasena || this.contrasena.trim() === '') {
+    if (!this.contrasena || this.contrasena.trim() !== '') {
       throw new Error('Contraseña requerida');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:39:9
       throw new Error('Email requerido');
     }
 
-    if (!this.contrasena || this.contrasena.trim() === '') {
+    if (true) {
       throw new Error('Contraseña requerida');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[NoCoverage] StringLiteral
usuario/domain/entities/Usuario.js:40:23
     }
 
     if (!this.contrasena || this.contrasena.trim() === '') {
-      throw new Error('Contraseña requerida');
+      throw new Error("");
     }
 

[Killed] BooleanLiteral
usuario/domain/entities/Usuario.js:43:9
       throw new Error('Contraseña requerida');
     }
 
-    if (!Usuario.VALORES_VALIDOS.includes(this.rol)) {
+    if (Usuario.VALORES_VALIDOS.includes(this.rol)) {
       throw new Error(`Rol inválido. Debe ser uno de: ${Usuario.VALORES_VALIDOS.join(', ')}`);
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
usuario/domain/entities/Usuario.js:43:54
       throw new Error('Contraseña requerida');
     }
 
-    if (!Usuario.VALORES_VALIDOS.includes(this.rol)) {
-      throw new Error(`Rol inválido. Debe ser uno de: ${Usuario.VALORES_VALIDOS.join(', ')}`);
-    }
+    if (!Usuario.VALORES_VALIDOS.includes(this.rol)) {}
   }
 
killedBy: Usuario - entidad debe validar rol permitido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Rol inválido"

Received function did not throw

[Killed] StringLiteral
usuario/domain/entities/Usuario.js:44:23
     }
 
     if (!Usuario.VALORES_VALIDOS.includes(this.rol)) {
-      throw new Error(`Rol inválido. Debe ser uno de: ${Usuario.VALORES_VALIDOS.join(', ')}`);
+      throw new Error(``);
     }
   }
killedBy: Usuario - entidad debe validar rol permitido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Rol inválido"
Received message:   ""

      112 |         } else {
      113 |           stryCov_9fa48("1091");
    > 114 |           throw new Error(stryMutAct_9fa48("1092") ? `` : (stryCov_9fa48("1092"), `Rol inválido. Debe ser uno de: ${Usuario.VALORES_VALIDOS.join(stryMutAct_9fa48("1093") ? "" : (stryCov_9fa48("1093"), ', '))}`));

[Killed] BlockStatement
usuario/domain/entities/Usuario.js:67:16
   /**
    * ¿Está activo?
    */
-  estaActivo() {
-    return this.estado === 'activo';
-  }
+  estaActivo() {}
 
   /**
killedBy: Usuario - entidad debe activar y desactivar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:68:12
    * ¿Está activo?
    */
   estaActivo() {
-    return this.estado === 'activo';
+    return true;
   }
 
killedBy: Usuario - entidad debe activar y desactivar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:68:12
    * ¿Está activo?
    */
   estaActivo() {
-    return this.estado === 'activo';
+    return false;
   }
 
killedBy: Usuario - entidad debe activar y desactivar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
usuario/domain/entities/Usuario.js:74:21
   /**
    * ¿Es administrador?
    */
-  esAdministrador() {
-    return this.rol === Usuario.ROLES.ADMINISTRADOR;
-  }
+  esAdministrador() {}
 
   /**
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:75:12
    * ¿Es administrador?
    */
   esAdministrador() {
-    return this.rol === Usuario.ROLES.ADMINISTRADOR;
+    return false;
   }
 
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
usuario/domain/entities/Usuario.js:75:12
    * ¿Es administrador?
    */
   esAdministrador() {
-    return this.rol === Usuario.ROLES.ADMINISTRADOR;
+    return this.rol !== Usuario.ROLES.ADMINISTRADOR;
   }
 
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
usuario/domain/entities/Usuario.js:81:16
   /**
    * ¿Es empleado?
    */
-  esEmpleado() {
-    return this.rol === Usuario.ROLES.EMPLEADO;
-  }
+  esEmpleado() {}
 
   /**
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:82:12
    * ¿Es empleado?
    */
   esEmpleado() {
-    return this.rol === Usuario.ROLES.EMPLEADO;
+    return false;
   }
 
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
usuario/domain/entities/Usuario.js:82:12
    * ¿Es empleado?
    */
   esEmpleado() {
-    return this.rol === Usuario.ROLES.EMPLEADO;
+    return this.rol !== Usuario.ROLES.EMPLEADO;
   }
 
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
usuario/domain/entities/Usuario.js:88:15
   /**
    * ¿Es cliente?
    */
-  esCliente() {
-    return this.rol === Usuario.ROLES.CLIENTE;
-  }
+  esCliente() {}
 }
 
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
usuario/domain/entities/Usuario.js:89:12
    * ¿Es cliente?
    */
   esCliente() {
-    return this.rol === Usuario.ROLES.CLIENTE;
+    return this.rol !== Usuario.ROLES.CLIENTE;
   }
 }
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
usuario/domain/entities/Usuario.js:89:12
    * ¿Es cliente?
    */
   esCliente() {
-    return this.rol === Usuario.ROLES.CLIENTE;
+    return false;
   }
 }
killedBy: Usuario - entidad debe identificar roles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
