[Killed] BlockStatement
usuario/domain/valueObjects/Email.js:8:22
  * Immutable, validado, comparable por valor
  */
 class Email {
-  constructor(valor) {
-    this.validar(valor);
-    this.valor = valor.toLowerCase().trim();
-  }
+  constructor(valor) {}
 
   validar(valor) {
killedBy: Cliente - Constructor debe crear un cliente con valores iniciales correctos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "juan.perez@example.com"
Received: undefined

[Killed] MethodExpression
usuario/domain/valueObjects/Email.js:10:18
 class Email {
   constructor(valor) {
     this.validar(valor);
-    this.valor = valor.toLowerCase().trim();
+    this.valor = valor.toUpperCase().trim();
   }
 
killedBy: Email - value object debe normalizar a minusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "admin@local.com"
Received: "ADMIN@LOCAL.COM"

[Survived] MethodExpression
usuario/domain/valueObjects/Email.js:10:18
 class Email {
   constructor(valor) {
     this.validar(valor);
-    this.valor = valor.toLowerCase().trim();
+    this.valor = valor.toLowerCase();
   }
 

[Killed] BlockStatement
usuario/domain/valueObjects/Email.js:13:18
     this.valor = valor.toLowerCase().trim();
   }
 
-  validar(valor) {
-    if (!valor || typeof valor !== 'string') {
-      throw new DomainException('Email es requerido y debe ser texto', 400, 'EMAIL_INVALIDO');
-    }
-
-    const regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!regex.test(valor)) {
-      throw new DomainException('Formato de email inválido', 400, 'EMAIL_FORMATO_INVALIDO');
-    }
-
-    if (valor.length > 255) {
-      throw new DomainException('Email muy largo', 400, 'EMAIL_DEMASIADO_LARGO');
-    }
-  }
+  validar(valor) {}
 
   equals(otro) {
killedBy: Email - value object debe lanzar error si falta email
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DomainException

Received function did not throw

[Killed] BooleanLiteral
usuario/domain/valueObjects/Email.js:14:9
   }
 
   validar(valor) {
-    if (!valor || typeof valor !== 'string') {
+    if (valor || typeof valor !== 'string') {
       throw new DomainException('Email es requerido y debe ser texto', 400, 'EMAIL_INVALIDO');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
usuario/domain/valueObjects/Email.js:14:9
   }
 
   validar(valor) {
-    if (!valor || typeof valor !== 'string') {
+    if (true) {
       throw new DomainException('Email es requerido y debe ser texto', 400, 'EMAIL_INVALIDO');
     }
killedBy: Email - value object debe normalizar a minusculas
statusReason: DomainException: Email es requerido y debe ser texto

[Survived] StringLiteral
usuario/domain/valueObjects/Email.js:15:77
 
   validar(valor) {
     if (!valor || typeof valor !== 'string') {
-      throw new DomainException('Email es requerido y debe ser texto', 400, 'EMAIL_INVALIDO');
+      throw new DomainException('Email es requerido y debe ser texto', 400, "");
     }
 

[Killed] Regex
usuario/domain/valueObjects/Email.js:18:19
       throw new DomainException('Email es requerido y debe ser texto', 400, 'EMAIL_INVALIDO');
     }
 
-    const regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const regex = /^[\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!regex.test(valor)) {
       throw new DomainException('Formato de email inválido', 400, 'EMAIL_FORMATO_INVALIDO');
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] Regex
usuario/domain/valueObjects/Email.js:18:19
       throw new DomainException('Email es requerido y debe ser texto', 400, 'EMAIL_INVALIDO');
     }
 
-    const regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const regex = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
     if (!regex.test(valor)) {
       throw new DomainException('Formato de email inválido', 400, 'EMAIL_FORMATO_INVALIDO');
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
usuario/domain/valueObjects/Email.js:19:29
     }
 
     const regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!regex.test(valor)) {
-      throw new DomainException('Formato de email inválido', 400, 'EMAIL_FORMATO_INVALIDO');
-    }
+    if (!regex.test(valor)) {}
 
     if (valor.length > 255) {
killedBy: Email - value object debe lanzar error si formato es invalido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Formato de email inválido"

Received function did not throw

[Killed] ConditionalExpression
usuario/domain/valueObjects/Email.js:19:9
     }
 
     const regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!regex.test(valor)) {
+    if (true) {
       throw new DomainException('Formato de email inválido', 400, 'EMAIL_FORMATO_INVALIDO');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
usuario/domain/valueObjects/Email.js:23:9
       throw new DomainException('Formato de email inválido', 400, 'EMAIL_FORMATO_INVALIDO');
     }
 
-    if (valor.length > 255) {
+    if (false) {
       throw new DomainException('Email muy largo', 400, 'EMAIL_DEMASIADO_LARGO');
     }
killedBy: Email - value object debe lanzar error si email es demasiado largo
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Email muy largo"

Received function did not throw

[Killed] ConditionalExpression
usuario/domain/valueObjects/Email.js:23:9
       throw new DomainException('Formato de email inválido', 400, 'EMAIL_FORMATO_INVALIDO');
     }
 
-    if (valor.length > 255) {
+    if (true) {
       throw new DomainException('Email muy largo', 400, 'EMAIL_DEMASIADO_LARGO');
     }
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[NoCoverage] BlockStatement
usuario/domain/valueObjects/Email.js:28:16
     }
   }
 
-  equals(otro) {
-    return otro instanceof Email && this.valor === otro.valor;
-  }
+  equals(otro) {}
 
   toString() {

[NoCoverage] EqualityOperator
usuario/domain/valueObjects/Email.js:29:37
   }
 
   equals(otro) {
-    return otro instanceof Email && this.valor === otro.valor;
+    return otro instanceof Email && this.valor !== otro.valor;
   }
 

[NoCoverage] ConditionalExpression
usuario/domain/valueObjects/Email.js:29:12
   }
 
   equals(otro) {
-    return otro instanceof Email && this.valor === otro.valor;
+    return false;
   }
 

[Killed] BlockStatement
usuario/domain/valueObjects/Email.js:32:14
     return otro instanceof Email && this.valor === otro.valor;
   }
 
-  toString() {
-    return this.valor;
-  }
+  toString() {}
 }
 
killedBy: Email - value object debe normalizar a minusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "admin@local.com"
Received: undefined
