[NoCoverage] BlockStatement
src/modules/usuario/index.js:6:39
 
 const autenticacionRoutes = require('./presentation/routes/autenticacionRoutes');
 
-module.exports = (socketIOEmitter) => {
-  const usuarioRepository = new UsuarioRepository();
-
-  const autenticacionApplicationService = new AutenticacionApplicationService(
-    usuarioRepository
-  );
-
-  return autenticacionRoutes(autenticacionApplicationService);
-};
+module.exports = (socketIOEmitter) => {};
 
