[NoCoverage] ArrayDeclaration
modules/usuario/infrastructure/UsuarioRepository.js:27:44
       RETURNING id_usuario, user_name, contrasena, nombres, apellidos, rol, estado
     `;
 
-    const { rows } = await db.query(query, [
-      usuario.nombre,
-      usuario.contrasena,
-      usuario.nombre,
-      usuario.apellidos,
-      usuario.rol,
-      usuario.estado
-    ]);
+    const { rows } = await db.query(query, []);
 
     return rows[0];

[NoCoverage] BlockStatement
modules/usuario/infrastructure/UsuarioRepository.js:42:26
   /**
    * Obtener usuario por ID
    */
-  async obtenerPorId(id) {
-    const query = `
-      SELECT id_usuario, user_name, contrasena, nombres, apellidos, rol, estado
-      FROM usuario
-      WHERE id_usuario = $1
-    `;
-
-    const { rows } = await db.query(query, [id]);
-    return rows[0] || null;
-  }
+  async obtenerPorId(id) {}
 
   /**

[NoCoverage] ConditionalExpression
modules/usuario/infrastructure/UsuarioRepository.js:50:12
     `;
 
     const { rows } = await db.query(query, [id]);
-    return rows[0] || null;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
modules/usuario/infrastructure/UsuarioRepository.js:50:12
     `;
 
     const { rows } = await db.query(query, [id]);
-    return rows[0] || null;
+    return false;
   }
 

[NoCoverage] BlockStatement
modules/usuario/infrastructure/UsuarioRepository.js:56:48
   /**
    * Obtener usuario por nombre de usuario (login)
    */
-  async obtenerPorNombreUsuario(nombreUsuario) {
-    const query = `
-      SELECT id_usuario, user_name, contrasena, nombres, apellidos, rol, estado
-      FROM usuario
-      WHERE user_name = $1
-    `;
-
-    const { rows } = await db.query(query, [nombreUsuario]);
-    return rows[0] || null;
-  }
+  async obtenerPorNombreUsuario(nombreUsuario) {}
 
   /**

[NoCoverage] ConditionalExpression
modules/usuario/infrastructure/UsuarioRepository.js:64:12
     `;
 
     const { rows } = await db.query(query, [nombreUsuario]);
-    return rows[0] || null;
+    return true;
   }
 

[NoCoverage] ConditionalExpression
modules/usuario/infrastructure/UsuarioRepository.js:64:12
     `;
 
     const { rows } = await db.query(query, [nombreUsuario]);
-    return rows[0] || null;
+    return false;
   }
 

[NoCoverage] BlockStatement
modules/usuario/infrastructure/UsuarioRepository.js:70:24
   /**
    * Obtener todos los usuarios
    */
-  async obtenerTodos() {
-    const query = `
-      SELECT id_usuario, user_name, nombres, apellidos, rol, estado
-      FROM usuario
-      WHERE estado = 'activo'
-      ORDER BY nombres
-    `;
-
-    const { rows } = await db.query(query);
-    return rows;
-  }
+  async obtenerTodos() {}
 
   /**

[NoCoverage] BlockStatement
modules/usuario/infrastructure/UsuarioRepository.js:85:44
   /**
    * Actualizar usuario
    */
-  async actualizar(id, usuarioActualizado) {
-    usuarioActualizado.validar();
-
-    const query = `
-      UPDATE usuario
-      SET nombres = $1, apellidos = $2, estado = $3
-      WHERE id_usuario = $4
-      RETURNING id_usuario, name_user, nombres, apellidos, estado
-    `;
-
-    const { rows } = await db.query(query, [
-      usuarioActualizado.nombre,
-      usuarioActualizado.apellidos,
-      usuarioActualizado.estado,
-      id
-    ]);
-
-    return rows[0] || null;
-  }
+  async actualizar(id, usuarioActualizado) {}
 
   /**

[NoCoverage] ConditionalExpression
modules/usuario/infrastructure/UsuarioRepository.js:102:12
       id
     ]);
 
-    return rows[0] || null;
+    return true;
   }
 

[NoCoverage] BlockStatement
modules/usuario/infrastructure/UsuarioRepository.js:108:22
   /**
    * Eliminar usuario (lógico - cambiar estado)
    */
-  async eliminar(id) {
-    const query = `
-      UPDATE usuario
-      SET estado = 'inactivo'
-      WHERE id_usuario = $1
-      RETURNING id_usuario
-    `;
-
-    const { rows } = await db.query(query, [id]);
-    return rows[0] !== null;
-  }
+  async eliminar(id) {}
 }
 

[NoCoverage] EqualityOperator
modules/usuario/infrastructure/UsuarioRepository.js:117:12
     `;
 
     const { rows } = await db.query(query, [id]);
-    return rows[0] !== null;
+    return rows[0] === null;
   }
 }

[NoCoverage] ConditionalExpression
modules/usuario/infrastructure/UsuarioRepository.js:117:12
     `;
 
     const { rows } = await db.query(query, [id]);
-    return rows[0] !== null;
+    return true;
   }
 }
