[Killed] StringLiteral
boleta/domain/entities/TipoMetodoPago.js:9:20
  */
 class MetodoPago {
   static EFECTIVO = 'efectivo';
-  static TARJETA = 'tarjeta';
+  static TARJETA = "";
   static TRANSFERENCIA = 'transferencia';
 
killedBy: MetodoPago acepta métodos válidos y compara correctamente
statusReason: DomainException: MetodoPago debe ser: efectivo, , transferencia

[Killed] BlockStatement
boleta/domain/entities/TipoMetodoPago.js:18:22
     MetodoPago.TRANSFERENCIA
   ];
 
-  constructor(valor) {
-    this.validar(valor);
-    this.valor = valor;
-  }
+  constructor(valor) {}
 
   validar(valor) {
killedBy: MetodoPago acepta métodos válidos y compara correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "efectivo"
Received: undefined

[Killed] BlockStatement
boleta/domain/entities/TipoMetodoPago.js:23:18
     this.valor = valor;
   }
 
-  validar(valor) {
-    if (!valor || typeof valor !== 'string') {
-      throw new DomainException('MetodoPago es requerido y debe ser texto', 400, 'METODO_PAGO_INVALIDO');
-    }
-
-    if (!MetodoPago.VALORES_VALIDOS.includes(valor)) {
-      throw new DomainException(
-        `MetodoPago debe ser: ${MetodoPago.VALORES_VALIDOS.join(', ')}`,
-        400,
-        'METODO_PAGO_NO_VALIDO'
-      );
-    }
-  }
+  validar(valor) {}
 
   equals(otro) {
killedBy: MetodoPago lanza DomainException para método inválido undefined
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DomainException

Received function did not throw

[Killed] EqualityOperator
boleta/domain/entities/TipoMetodoPago.js:24:19
   }
 
   validar(valor) {
-    if (!valor || typeof valor !== 'string') {
+    if (!valor || typeof valor === 'string') {
       throw new DomainException('MetodoPago es requerido y debe ser texto', 400, 'METODO_PAGO_INVALIDO');
     }
killedBy: MetodoPago acepta métodos válidos y compara correctamente
statusReason: DomainException: MetodoPago es requerido y debe ser texto

[Survived] StringLiteral
boleta/domain/entities/TipoMetodoPago.js:25:82
 
   validar(valor) {
     if (!valor || typeof valor !== 'string') {
-      throw new DomainException('MetodoPago es requerido y debe ser texto', 400, 'METODO_PAGO_INVALIDO');
+      throw new DomainException('MetodoPago es requerido y debe ser texto', 400, "");
     }
 

[Survived] StringLiteral
boleta/domain/entities/TipoMetodoPago.js:25:33
 
   validar(valor) {
     if (!valor || typeof valor !== 'string') {
-      throw new DomainException('MetodoPago es requerido y debe ser texto', 400, 'METODO_PAGO_INVALIDO');
+      throw new DomainException("", 400, 'METODO_PAGO_INVALIDO');
     }
 

[Killed] ConditionalExpression
boleta/domain/entities/TipoMetodoPago.js:28:9
       throw new DomainException('MetodoPago es requerido y debe ser texto', 400, 'METODO_PAGO_INVALIDO');
     }
 
-    if (!MetodoPago.VALORES_VALIDOS.includes(valor)) {
+    if (false) {
       throw new DomainException(
         `MetodoPago debe ser: ${MetodoPago.VALORES_VALIDOS.join(', ')}`,
killedBy: MetodoPago lanza DomainException para método inválido "paypal"
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DomainException

Received function did not throw

[Killed] BooleanLiteral
boleta/domain/entities/TipoMetodoPago.js:28:9
       throw new DomainException('MetodoPago es requerido y debe ser texto', 400, 'METODO_PAGO_INVALIDO');
     }
 
-    if (!MetodoPago.VALORES_VALIDOS.includes(valor)) {
+    if (MetodoPago.VALORES_VALIDOS.includes(valor)) {
       throw new DomainException(
         `MetodoPago debe ser: ${MetodoPago.VALORES_VALIDOS.join(', ')}`,
killedBy: MetodoPago acepta métodos válidos y compara correctamente
statusReason: DomainException: MetodoPago debe ser: efectivo, tarjeta, transferencia

[Survived] StringLiteral
boleta/domain/entities/TipoMetodoPago.js:30:65
 
     if (!MetodoPago.VALORES_VALIDOS.includes(valor)) {
       throw new DomainException(
-        `MetodoPago debe ser: ${MetodoPago.VALORES_VALIDOS.join(', ')}`,
+        `MetodoPago debe ser: ${MetodoPago.VALORES_VALIDOS.join("")}`,
         400,
         'METODO_PAGO_NO_VALIDO'

[Killed] BlockStatement
boleta/domain/entities/TipoMetodoPago.js:37:16
     }
   }
 
-  equals(otro) {
-    return otro instanceof MetodoPago && this.valor === otro.valor;
-  }
+  equals(otro) {}
 
   toString() {
killedBy: MetodoPago acepta métodos válidos y compara correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
boleta/domain/entities/TipoMetodoPago.js:38:12
   }
 
   equals(otro) {
-    return otro instanceof MetodoPago && this.valor === otro.valor;
+    return false;
   }
 
killedBy: MetodoPago acepta métodos válidos y compara correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
boleta/domain/entities/TipoMetodoPago.js:38:12
   }
 
   equals(otro) {
-    return otro instanceof MetodoPago && this.valor === otro.valor;
+    return true;
   }
 
killedBy: MetodoPago acepta métodos válidos y compara correctamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
