[Killed] StringLiteral
boleta/domain/valueObjects/TipoVenta.js:8:19
  * Solo acepta valores específicos: 'online' o 'fisica'
  */
 class TipoVenta {
-  static ONLINE = 'online';
+  static ONLINE = "";
   static FISICA = 'fisica';
 
killedBy: TipoVenta acepta valores válidos y detecta el tipo de venta
statusReason: DomainException: TipoVenta debe ser: , fisica

[Killed] StringLiteral
boleta/domain/valueObjects/TipoVenta.js:9:19
  */
 class TipoVenta {
   static ONLINE = 'online';
-  static FISICA = 'fisica';
+  static FISICA = "";
 
   static VALORES_VALIDOS = [TipoVenta.ONLINE, TipoVenta.FISICA];
killedBy: TipoVenta acepta valores válidos y detecta el tipo de venta
statusReason: DomainException: TipoVenta debe ser: online,

[Killed] ArrayDeclaration
boleta/domain/valueObjects/TipoVenta.js:11:28
   static ONLINE = 'online';
   static FISICA = 'fisica';
 
-  static VALORES_VALIDOS = [TipoVenta.ONLINE, TipoVenta.FISICA];
+  static VALORES_VALIDOS = [];
 
   constructor(valor) {
killedBy: TipoVenta acepta valores válidos y detecta el tipo de venta
statusReason: DomainException: TipoVenta debe ser:

[Killed] BlockStatement
boleta/domain/valueObjects/TipoVenta.js:18:18
     this.valor = valor;
   }
 
-  validar(valor) {
-    if (!valor || typeof valor !== 'string') {
-      throw new DomainException('TipoVenta es requerido y debe ser texto', 400, 'TIPO_VENTA_INVALIDO');
-    }
-
-    if (!TipoVenta.VALORES_VALIDOS.includes(valor)) {
-      throw new DomainException(
-        `TipoVenta debe ser: ${TipoVenta.VALORES_VALIDOS.join(', ')}`,
-        400,
-        'TIPO_VENTA_NO_VALIDO'
-      );
-    }
-  }
+  validar(valor) {}
 
   esOnline() {
killedBy: TipoVenta lanza DomainException para valor inválido undefined
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: DomainException

Received function did not throw

[Survived] StringLiteral
boleta/domain/valueObjects/TipoVenta.js:20:33
 
   validar(valor) {
     if (!valor || typeof valor !== 'string') {
-      throw new DomainException('TipoVenta es requerido y debe ser texto', 400, 'TIPO_VENTA_INVALIDO');
+      throw new DomainException("", 400, 'TIPO_VENTA_INVALIDO');
     }
 

[Killed] BooleanLiteral
boleta/domain/valueObjects/TipoVenta.js:23:9
       throw new DomainException('TipoVenta es requerido y debe ser texto', 400, 'TIPO_VENTA_INVALIDO');
     }
 
-    if (!TipoVenta.VALORES_VALIDOS.includes(valor)) {
+    if (TipoVenta.VALORES_VALIDOS.includes(valor)) {
       throw new DomainException(
         `TipoVenta debe ser: ${TipoVenta.VALORES_VALIDOS.join(', ')}`,
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: DomainException: TipoVenta debe ser: online, fisica

[Killed] ConditionalExpression
boleta/domain/valueObjects/TipoVenta.js:23:9
       throw new DomainException('TipoVenta es requerido y debe ser texto', 400, 'TIPO_VENTA_INVALIDO');
     }
 
-    if (!TipoVenta.VALORES_VALIDOS.includes(valor)) {
+    if (true) {
       throw new DomainException(
         `TipoVenta debe ser: ${TipoVenta.VALORES_VALIDOS.join(', ')}`,
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: DomainException: TipoVenta debe ser: online, fisica

[Killed] BlockStatement
boleta/domain/valueObjects/TipoVenta.js:32:14
     }
   }
 
-  esOnline() {
-    return this.valor === TipoVenta.ONLINE;
-  }
+  esOnline() {}
 
   esFisica() {
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
boleta/domain/valueObjects/TipoVenta.js:33:12
   }
 
   esOnline() {
-    return this.valor === TipoVenta.ONLINE;
+    return true;
   }
 
killedBy: Boleta valida boleta online con cliente y boleta física con empleado
statusReason: Error: expect(received).not.toThrow()

Error name:    "BoletaInvalidaException"
Error message: "Venta online requiere cliente"

      125 |         } else {
      126 |           stryCov_9fa48("79");
    > 127 |           throw new BoletaInvalidaException(stryMutAct_9fa48("80") ? "" : (stryCov_9fa48("80"), 'Venta online requiere cliente'));

[Killed] EqualityOperator
boleta/domain/valueObjects/TipoVenta.js:33:12
   }
 
   esOnline() {
-    return this.valor === TipoVenta.ONLINE;
+    return this.valor !== TipoVenta.ONLINE;
   }
 
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
boleta/domain/valueObjects/TipoVenta.js:36:14
     return this.valor === TipoVenta.ONLINE;
   }
 
-  esFisica() {
-    return this.valor === TipoVenta.FISICA;
-  }
+  esFisica() {}
 
   equals(otro) {
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
boleta/domain/valueObjects/TipoVenta.js:37:12
   }
 
   esFisica() {
-    return this.valor === TipoVenta.FISICA;
+    return this.valor !== TipoVenta.FISICA;
   }
 
killedBy: Boleta crea boleta con valores iniciales y tipo de venta online
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
boleta/domain/valueObjects/TipoVenta.js:37:12
   }
 
   esFisica() {
-    return this.valor === TipoVenta.FISICA;
+    return true;
   }
 
killedBy: TipoVenta acepta valores válidos y detecta el tipo de venta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
boleta/domain/valueObjects/TipoVenta.js:40:16
     return this.valor === TipoVenta.FISICA;
   }
 
-  equals(otro) {
-    return otro instanceof TipoVenta && this.valor === otro.valor;
-  }
+  equals(otro) {}
 
   toString() {
killedBy: TipoVenta acepta valores válidos y detecta el tipo de venta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
boleta/domain/valueObjects/TipoVenta.js:41:12
   }
 
   equals(otro) {
-    return otro instanceof TipoVenta && this.valor === otro.valor;
+    return otro instanceof TipoVenta || this.valor === otro.valor;
   }
 
killedBy: TipoVenta acepta valores válidos y detecta el tipo de venta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
boleta/domain/valueObjects/TipoVenta.js:41:41
   }
 
   equals(otro) {
-    return otro instanceof TipoVenta && this.valor === otro.valor;
+    return otro instanceof TipoVenta && true;
   }
 
killedBy: TipoVenta acepta valores válidos y detecta el tipo de venta
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
