[Killed] BlockStatement
carrito/domain/entities/Carrito.js:10:69
  * Protege invariantes: total = suma de items, items >= 0
  */
 class Carrito {
-  constructor(id, tipoCarrito, idCliente = null, idEmpleado = null) {
-    this.id = id;
-    this.tipoCarrito = tipoCarrito; // 'cliente' o 'venta_fisica'
-    this.idCliente = idCliente;
-    this.idEmpleado = idEmpleado;
-    this.items = [];
-    this.total = new Precio(0);
-    this.estado = 'activo';
-    this.createdAt = new Date();
-    this.updatedAt = new Date();
-  }
+  constructor(id, tipoCarrito, idCliente = null, idEmpleado = null) {}
 
   /**
killedBy: Carrito - Constructor debe crear un carrito con valores iniciales correctos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArrayDeclaration
carrito/domain/entities/Carrito.js:15:18
     this.tipoCarrito = tipoCarrito; // 'cliente' o 'venta_fisica'
     this.idCliente = idCliente;
     this.idEmpleado = idEmpleado;
-    this.items = [];
+    this.items = ["Stryker was here"];
     this.total = new Precio(0);
     this.estado = 'activo';
killedBy: Carrito - Constructor debe crear un carrito con valores iniciales correctos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:26:24
    * Agregar producto al carrito
    */
   agregarItem(producto, cantidad) {
-    if (cantidad <= 0) {
-      throw new Error('Cantidad debe ser mayor a 0');
-    }
+    if (cantidad <= 0) {}
 
     if (!producto.hayStockPara(cantidad)) {
killedBy: Carrito - agregarItem debe lanzar error si cantidad es <= 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cantidad debe ser mayor a 0"
Received message:   "Stock insuficiente de Producto A"

      93 |         } else {
      94 |           stryCov_9fa48("365");
    > 95 |           throw new Error(stryMutAct_9fa48("366") ? `` : (stryCov_9fa48("366"), `Stock insuficiente de ${producto.nombre}`));

[Killed] EqualityOperator
carrito/domain/entities/Carrito.js:26:9
    * Agregar producto al carrito
    */
   agregarItem(producto, cantidad) {
-    if (cantidad <= 0) {
+    if (cantidad > 0) {
       throw new Error('Cantidad debe ser mayor a 0');
     }
killedBy: Carrito - agregarItem debe agregar un nuevo item al carrito
statusReason: Error: Cantidad debe ser mayor a 0

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:30:43
       throw new Error('Cantidad debe ser mayor a 0');
     }
 
-    if (!producto.hayStockPara(cantidad)) {
-      throw new Error(`Stock insuficiente de ${producto.nombre}`);
-    }
+    if (!producto.hayStockPara(cantidad)) {}
 
     // Verificar si el producto ya existe en el carrito
killedBy: Carrito - agregarItem debe lanzar error si no hay stock suficiente
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Stock insuficiente de Producto A"

Received function did not throw

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:30:9
       throw new Error('Cantidad debe ser mayor a 0');
     }
 
-    if (!producto.hayStockPara(cantidad)) {
+    if (false) {
       throw new Error(`Stock insuficiente de ${producto.nombre}`);
     }
killedBy: Carrito - agregarItem debe lanzar error si no hay stock suficiente
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Stock insuficiente de Producto A"

Received function did not throw

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:35:51
     }
 
     // Verificar si el producto ya existe en el carrito
-    const itemExistente = this.items.find(item => item.idProducto === producto.id);
+    const itemExistente = this.items.find(item => false);
 
     if (itemExistente) {
killedBy: Carrito - agregarItem debe incrementar cantidad si el producto ya existe
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] EqualityOperator
carrito/domain/entities/Carrito.js:35:51
     }
 
     // Verificar si el producto ya existe en el carrito
-    const itemExistente = this.items.find(item => item.idProducto === producto.id);
+    const itemExistente = this.items.find(item => item.idProducto !== producto.id);
 
     if (itemExistente) {
killedBy: Carrito - agregarItem debe incrementar cantidad si el producto ya existe
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:37:9
     // Verificar si el producto ya existe en el carrito
     const itemExistente = this.items.find(item => item.idProducto === producto.id);
 
-    if (itemExistente) {
+    if (true) {
       itemExistente.cantidad += cantidad;
       itemExistente.subtotal = itemExistente.precio.multiplicar(itemExistente.cantidad);
killedBy: Carrito - agregarItem debe agregar un nuevo item al carrito
statusReason: TypeError: Cannot read properties of undefined (reading 'cantidad')

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:37:9
     // Verificar si el producto ya existe en el carrito
     const itemExistente = this.items.find(item => item.idProducto === producto.id);
 
-    if (itemExistente) {
+    if (false) {
       itemExistente.cantidad += cantidad;
       itemExistente.subtotal = itemExistente.precio.multiplicar(itemExistente.cantidad);
killedBy: Carrito - agregarItem debe incrementar cantidad si el producto ya existe
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] AssignmentOperator
carrito/domain/entities/Carrito.js:38:7
     const itemExistente = this.items.find(item => item.idProducto === producto.id);
 
     if (itemExistente) {
-      itemExistente.cantidad += cantidad;
+      itemExistente.cantidad -= cantidad;
       itemExistente.subtotal = itemExistente.precio.multiplicar(itemExistente.cantidad);
     } else {
killedBy: Carrito - agregarItem debe incrementar cantidad si el producto ya existe
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -2

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:40:12
     if (itemExistente) {
       itemExistente.cantidad += cantidad;
       itemExistente.subtotal = itemExistente.precio.multiplicar(itemExistente.cantidad);
-    } else {
-      this.items.push({
-        idProducto: producto.id,
-        nombre: producto.nombre,
-        precio: producto.precio,
-        cantidad,
-        subtotal: producto.precio.multiplicar(cantidad)
-      });
-    }
+    } else {}
 
     // Recalcular total
killedBy: Carrito - cambiarCantidadItem debe cambiar la cantidad de un item
statusReason: Error: Item no encontrado en carrito

[Killed] ObjectLiteral
carrito/domain/entities/Carrito.js:41:23
       itemExistente.cantidad += cantidad;
       itemExistente.subtotal = itemExistente.precio.multiplicar(itemExistente.cantidad);
     } else {
-      this.items.push({
-        idProducto: producto.id,
-        nombre: producto.nombre,
-        precio: producto.precio,
-        cantidad,
-        subtotal: producto.precio.multiplicar(cantidad)
-      });
+      this.items.push({});
     }
 
killedBy: Carrito - agregarItem debe agregar un nuevo item al carrito
statusReason: TypeError: Cannot read properties of undefined (reading 'monto')

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:60:28
   /**
    * Eliminar item del carrito
    */
-  eliminarItem(idProducto) {
-    this.items = this.items.filter(item => item.idProducto !== idProducto);
-    this.recalcularTotal();
-    this.updatedAt = new Date();
-    return this;
-  }
+  eliminarItem(idProducto) {}
 
   /**
killedBy: Carrito - cambiarCantidadItem debe eliminar el item si nueva cantidad es <= 0
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"cantidad": 1, "idProducto": 1, "nombre": "Producto A", "precio": {"monto": 100, "multiplicar": [Function mockConstructor]}, "subtotal": {"monto": 100, "multiplicar": [Function mockConstructor]}}]

[Killed] MethodExpression
carrito/domain/entities/Carrito.js:61:18
    * Eliminar item del carrito
    */
   eliminarItem(idProducto) {
-    this.items = this.items.filter(item => item.idProducto !== idProducto);
+    this.items = this.items;
     this.recalcularTotal();
     this.updatedAt = new Date();
killedBy: Carrito - eliminarItem debe eliminar un item del carrito
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"cantidad": 1, "idProducto": 1, "nombre": "Producto A", "precio": {"monto": 100, "multiplicar": [Function mockConstructor]}, "subtotal": {"monto": 100, "multiplicar": [Function mockConstructor]}}]

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:61:44
    * Eliminar item del carrito
    */
   eliminarItem(idProducto) {
-    this.items = this.items.filter(item => item.idProducto !== idProducto);
+    this.items = this.items.filter(item => true);
     this.recalcularTotal();
     this.updatedAt = new Date();
killedBy: Carrito - cambiarCantidadItem debe eliminar el item si nueva cantidad es <= 0
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"cantidad": 1, "idProducto": 1, "nombre": "Producto A", "precio": {"monto": 100, "multiplicar": [Function mockConstructor]}, "subtotal": {"monto": 100, "multiplicar": [Function mockConstructor]}}]

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:70:50
   /**
    * Cambiar cantidad de item
    */
-  cambiarCantidadItem(idProducto, nuevaCantidad) {
-    const item = this.items.find(i => i.idProducto === idProducto);
-
-    if (!item) {
-      throw new Error('Item no encontrado en carrito');
-    }
-
-    if (nuevaCantidad <= 0) {
-      return this.eliminarItem(idProducto);
-    }
-
-    item.cantidad = nuevaCantidad;
-    item.subtotal = item.precio.multiplicar(nuevaCantidad);
-
-    this.recalcularTotal();
-    this.updatedAt = new Date();
-
-    return this;
-  }
+  cambiarCantidadItem(idProducto, nuevaCantidad) {}
 
   /**
killedBy: Carrito - cambiarCantidadItem debe cambiar la cantidad de un item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:71:39
    * Cambiar cantidad de item
    */
   cambiarCantidadItem(idProducto, nuevaCantidad) {
-    const item = this.items.find(i => i.idProducto === idProducto);
+    const item = this.items.find(i => false);
 
     if (!item) {
killedBy: Carrito - cambiarCantidadItem debe cambiar la cantidad de un item
statusReason: Error: Item no encontrado en carrito

[Killed] ArrowFunction
carrito/domain/entities/Carrito.js:71:34
    * Cambiar cantidad de item
    */
   cambiarCantidadItem(idProducto, nuevaCantidad) {
-    const item = this.items.find(i => i.idProducto === idProducto);
+    const item = this.items.find(() => undefined);
 
     if (!item) {
killedBy: Carrito - cambiarCantidadItem debe cambiar la cantidad de un item
statusReason: Error: Item no encontrado en carrito

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:73:16
   cambiarCantidadItem(idProducto, nuevaCantidad) {
     const item = this.items.find(i => i.idProducto === idProducto);
 
-    if (!item) {
-      throw new Error('Item no encontrado en carrito');
-    }
+    if (!item) {}
 
     if (nuevaCantidad <= 0) {
killedBy: Carrito - cambiarCantidadItem debe lanzar error si item no encontrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Item no encontrado en carrito"
Received message:   "Cannot set properties of undefined (setting 'cantidad')"

      169 |         }
      170 |       }
    > 171 |       item.cantidad = nuevaCantidad;

[Killed] EqualityOperator
carrito/domain/entities/Carrito.js:77:9
       throw new Error('Item no encontrado en carrito');
     }
 
-    if (nuevaCantidad <= 0) {
+    if (nuevaCantidad > 0) {
       return this.eliminarItem(idProducto);
     }
killedBy: Carrito - cambiarCantidadItem debe cambiar la cantidad de un item
statusReason: TypeError: Cannot read properties of undefined (reading 'cantidad')

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:77:29
       throw new Error('Item no encontrado en carrito');
     }
 
-    if (nuevaCantidad <= 0) {
-      return this.eliminarItem(idProducto);
-    }
+    if (nuevaCantidad <= 0) {}
 
     item.cantidad = nuevaCantidad;
killedBy: Carrito - cambiarCantidadItem debe eliminar el item si nueva cantidad es <= 0
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"cantidad": 0, "idProducto": 1, "nombre": "Producto A", "precio": {"monto": 100, "multiplicar": [Function mockConstructor]}, "subtotal": {"monto": 0, "multiplicar": [Function mockConstructor]}}]

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:93:21
   /**
    * Recalcular total (invariante)
    */
-  recalcularTotal() {
-    let totalMonto = 0;
-
-    for (const item of this.items) {
-      totalMonto += item.subtotal.monto;
-    }
-
-    this.total = new Precio(totalMonto);
-  }
+  recalcularTotal() {}
 
   /**
killedBy: Carrito - cambiarCantidadItem debe cambiar la cantidad de un item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 300
Received: 0

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:96:36
   recalcularTotal() {
     let totalMonto = 0;
 
-    for (const item of this.items) {
-      totalMonto += item.subtotal.monto;
-    }
+    for (const item of this.items) {}
 
     this.total = new Precio(totalMonto);
killedBy: Carrito - agregarItem debe agregar un nuevo item al carrito
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 0

[Killed] AssignmentOperator
carrito/domain/entities/Carrito.js:97:7
     let totalMonto = 0;
 
     for (const item of this.items) {
-      totalMonto += item.subtotal.monto;
+      totalMonto -= item.subtotal.monto;
     }
 
killedBy: Carrito - cambiarCantidadItem debe cambiar la cantidad de un item
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 300
Received: -300

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:106:13
   /**
    * Validar reglas del Agregado
    */
-  validar() {
-    if (this.items.length === 0) {
-      throw new CarritoVacioException();
-    }
-
-    if (this.total.monto <= 0) {
-      throw new Error('Total debe ser mayor a 0');
-    }
-  }
+  validar() {}
 
   /**
killedBy: Carrito - validar debe lanzar CarritoVacioException si carrito está vacío
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CarritoVacioException

Received function did not throw

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:107:9
    * Validar reglas del Agregado
    */
   validar() {
-    if (this.items.length === 0) {
+    if (false) {
       throw new CarritoVacioException();
     }
killedBy: Carrito - validar debe lanzar CarritoVacioException si carrito está vacío
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CarritoVacioException
Received constructor: Error

Received message: "Total debe ser mayor a 0"

      219 |         } else {

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:107:34
    * Validar reglas del Agregado
    */
   validar() {
-    if (this.items.length === 0) {
-      throw new CarritoVacioException();
-    }
+    if (this.items.length === 0) {}
 
     if (this.total.monto <= 0) {
killedBy: Carrito - validar debe lanzar CarritoVacioException si carrito está vacío
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CarritoVacioException
Received constructor: Error

Received message: "Total debe ser mayor a 0"

      219 |         } else {

[Killed] EqualityOperator
carrito/domain/entities/Carrito.js:111:9
       throw new CarritoVacioException();
     }
 
-    if (this.total.monto <= 0) {
+    if (this.total.monto > 0) {
       throw new Error('Total debe ser mayor a 0');
     }
killedBy: Carrito - validar debe lanzar error si total es <= 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Total debe ser mayor a 0"

Received function did not throw

[Killed] EqualityOperator
carrito/domain/entities/Carrito.js:111:9
       throw new CarritoVacioException();
     }
 
-    if (this.total.monto <= 0) {
+    if (this.total.monto < 0) {
       throw new Error('Total debe ser mayor a 0');
     }
killedBy: Carrito - validar debe lanzar error si total es <= 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Total debe ser mayor a 0"

Received function did not throw

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:119:12
   /**
    * Limpiar carrito
    */
-  vaciar() {
-    this.items = [];
-    this.total = new Precio(0);
-    this.updatedAt = new Date();
-    return this;
-  }
+  vaciar() {}
 
   /**
killedBy: Carrito - vaciar debe vaciar el carrito
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"cantidad": 1, "idProducto": 1, "nombre": "Producto A", "precio": {"monto": 100, "multiplicar": [Function mockConstructor]}, "subtotal": {"monto": 100, "multiplicar": [Function mockConstructor]}}]

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:129:15
   /**
    * ¿Carrito está vacío?
    */
-  estaVacio() {
-    return this.items.length === 0;
-  }
+  estaVacio() {}
 
   /**
killedBy: Carrito - estado y conteo debe retornar true si carrito está vacío
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
carrito/domain/entities/Carrito.js:130:12
    * ¿Carrito está vacío?
    */
   estaVacio() {
-    return this.items.length === 0;
+    return true;
   }
 
killedBy: Carrito - estado y conteo debe retornar false si tiene items
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
carrito/domain/entities/Carrito.js:130:12
    * ¿Carrito está vacío?
    */
   estaVacio() {
-    return this.items.length === 0;
+    return this.items.length !== 0;
   }
 
killedBy: Carrito - estado y conteo debe retornar true si carrito está vacío
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:136:19
   /**
    * Cantidad de items diferentes
    */
-  cantidadItems() {
-    return this.items.length;
-  }
+  cantidadItems() {}
 
   /**
killedBy: Carrito - estado y conteo debe retornar la cantidad de items diferentes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
carrito/domain/entities/Carrito.js:143:22
   /**
    * Cantidad total de unidades
    */
-  cantidadUnidades() {
-    return this.items.reduce((sum, item) => sum + item.cantidad, 0);
-  }
+  cantidadUnidades() {}
 }
 
killedBy: Carrito - estado y conteo debe retornar la cantidad total de unidades
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
carrito/domain/entities/Carrito.js:144:45
    * Cantidad total de unidades
    */
   cantidadUnidades() {
-    return this.items.reduce((sum, item) => sum + item.cantidad, 0);
+    return this.items.reduce((sum, item) => sum - item.cantidad, 0);
   }
 }
killedBy: Carrito - estado y conteo debe retornar la cantidad total de unidades
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Killed] ArrowFunction
carrito/domain/entities/Carrito.js:144:30
    * Cantidad total de unidades
    */
   cantidadUnidades() {
-    return this.items.reduce((sum, item) => sum + item.cantidad, 0);
+    return this.items.reduce(() => undefined, 0);
   }
 }
killedBy: Carrito - estado y conteo debe retornar la cantidad total de unidades
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined
