[Killed] BlockStatement
carrito/domain/exceptions/CarritoVacioException.js:4:67
 const DomainException = require('../../../../shared/domain/exceptions/DomainException');
 
 class CarritoVacioException extends DomainException {
-  constructor(mensaje = 'No se puede confirmar un carrito vacío') {
-    super(mensaje, 400, 'CARRITO_VACIO');
-  }
+  constructor(mensaje = 'No se puede confirmar un carrito vacío') {}
 }
 
killedBy: Carrito - validar debe lanzar CarritoVacioException si carrito está vacío
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: CarritoVacioException
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {

[Survived] StringLiteral
carrito/domain/exceptions/CarritoVacioException.js:4:25
 const DomainException = require('../../../../shared/domain/exceptions/DomainException');
 
 class CarritoVacioException extends DomainException {
-  constructor(mensaje = 'No se puede confirmar un carrito vacío') {
+  constructor(mensaje = "") {
     super(mensaje, 400, 'CARRITO_VACIO');
   }

[Survived] StringLiteral
carrito/domain/exceptions/CarritoVacioException.js:5:25
 
 class CarritoVacioException extends DomainException {
   constructor(mensaje = 'No se puede confirmar un carrito vacío') {
-    super(mensaje, 400, 'CARRITO_VACIO');
+    super(mensaje, 400, "");
   }
 }
