[Killed] BlockStatement
modules/producto/application/ActualizarProductoApplicationService.js:6:52
  * Orquesta actualización de productos (admin)
  */
 class ActualizarProductoApplicationService {
-  constructor(productoRepository, socketIOEmitter) {
-    this.productoRepository = productoRepository;
-    this.socketIOEmitter = socketIOEmitter;
-  }
+  constructor(productoRepository, socketIOEmitter) {}
 
   /**
killedBy: ActualizarProductoApplicationService lanza error cuando producto no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Producto no encontrado"
Received message:   "Cannot read properties of undefined (reading 'obtenerPorId')"

      80 |
      81 |       // 1. Obtener producto existente
    > 82 |       const productoExistente = await this.productoRepository.obtenerPorId(idProducto);

[Killed] BlockStatement
modules/producto/application/ActualizarProductoApplicationService.js:20:29
     // 1. Obtener producto existente
     const productoExistente = await this.productoRepository.obtenerPorId(idProducto);
 
-    if (!productoExistente) {
-      throw new Error('Producto no encontrado');
-    }
+    if (!productoExistente) {}
 
     // 2. Actualizar atributos
killedBy: ActualizarProductoApplicationService lanza error cuando producto no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Producto no encontrado"
Received message:   "Cannot set properties of null (setting 'nombre')"

      91 |
      92 |       // 2. Actualizar atributos
    > 93 |       if (stryMutAct_9fa48("654") ? false : stryMutAct_9fa48("653") ? true : (stryCov_9fa48("653", "654"), nombre)) productoExistente.nombre = nombre;

[Killed] BooleanLiteral
modules/producto/application/ActualizarProductoApplicationService.js:20:9
     // 1. Obtener producto existente
     const productoExistente = await this.productoRepository.obtenerPorId(idProducto);
 
-    if (!productoExistente) {
+    if (productoExistente) {
       throw new Error('Producto no encontrado');
     }
killedBy: ActualizarProductoApplicationService lanza error cuando producto no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Producto no encontrado"
Received message:   "Cannot set properties of null (setting 'nombre')"

      91 |
      92 |       // 2. Actualizar atributos
    > 93 |       if (stryMutAct_9fa48("654") ? false : stryMutAct_9fa48("653") ? true : (stryCov_9fa48("653", "654"), nombre)) productoExistente.nombre = nombre;

[Killed] StringLiteral
modules/producto/application/ActualizarProductoApplicationService.js:21:23
     const productoExistente = await this.productoRepository.obtenerPorId(idProducto);
 
     if (!productoExistente) {
-      throw new Error('Producto no encontrado');
+      throw new Error("");
     }
 
killedBy: ActualizarProductoApplicationService lanza error cuando producto no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Producto no encontrado"
Received message:   ""

      86 |         } else {
      87 |           stryCov_9fa48("651");
    > 88 |           throw new Error(stryMutAct_9fa48("652") ? "" : (stryCov_9fa48("652"), 'Producto no encontrado'));

[Killed] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:25:9
     }
 
     // 2. Actualizar atributos
-    if (nombre) productoExistente.nombre = nombre;
+    if (false) productoExistente.nombre = nombre;
     if (precio) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;
killedBy: ActualizarProductoApplicationService actualiza, valida, guarda y emite evento en flujo exitoso
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "idProducto": 1,
    "mensaje": "Producto actualizado exitosamente",

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:25:9
     }
 
     // 2. Actualizar atributos
-    if (nombre) productoExistente.nombre = nombre;
+    if (true) productoExistente.nombre = nombre;
     if (precio) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;

[Killed] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:26:9
 
     // 2. Actualizar atributos
     if (nombre) productoExistente.nombre = nombre;
-    if (precio) productoExistente.cambiarPrecio(precio);
+    if (false) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;
killedBy: ActualizarProductoApplicationService actualiza, valida, guarda y emite evento en flujo exitoso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 25000

Number of calls: 0

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:26:9
 
     // 2. Actualizar atributos
     if (nombre) productoExistente.nombre = nombre;
-    if (precio) productoExistente.cambiarPrecio(precio);
+    if (true) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;

[Killed] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:27:9
     // 2. Actualizar atributos
     if (nombre) productoExistente.nombre = nombre;
     if (precio) productoExistente.cambiarPrecio(precio);
-    if (minStock) productoExistente.minStock = minStock;
+    if (false) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;
     if (imagenUrl) productoExistente.imagenUrl = imagenUrl;
killedBy: ActualizarProductoApplicationService actualiza, valida, guarda y emite evento en flujo exitoso
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "idProducto": 1,
    "mensaje": "Producto actualizado exitosamente",

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:27:9
     // 2. Actualizar atributos
     if (nombre) productoExistente.nombre = nombre;
     if (precio) productoExistente.cambiarPrecio(precio);
-    if (minStock) productoExistente.minStock = minStock;
+    if (true) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;
     if (imagenUrl) productoExistente.imagenUrl = imagenUrl;

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:28:9
     if (nombre) productoExistente.nombre = nombre;
     if (precio) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;
-    if (descripcion) productoExistente.descripcion = descripcion;
+    if (true) productoExistente.descripcion = descripcion;
     if (imagenUrl) productoExistente.imagenUrl = imagenUrl;
     if (idCategoria) productoExistente.idCategoria = idCategoria;

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:28:9
     if (nombre) productoExistente.nombre = nombre;
     if (precio) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;
-    if (descripcion) productoExistente.descripcion = descripcion;
+    if (false) productoExistente.descripcion = descripcion;
     if (imagenUrl) productoExistente.imagenUrl = imagenUrl;
     if (idCategoria) productoExistente.idCategoria = idCategoria;

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:29:9
     if (precio) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;
-    if (imagenUrl) productoExistente.imagenUrl = imagenUrl;
+    if (true) productoExistente.imagenUrl = imagenUrl;
     if (idCategoria) productoExistente.idCategoria = idCategoria;
 

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:29:9
     if (precio) productoExistente.cambiarPrecio(precio);
     if (minStock) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;
-    if (imagenUrl) productoExistente.imagenUrl = imagenUrl;
+    if (false) productoExistente.imagenUrl = imagenUrl;
     if (idCategoria) productoExistente.idCategoria = idCategoria;
 

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:30:9
     if (minStock) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;
     if (imagenUrl) productoExistente.imagenUrl = imagenUrl;
-    if (idCategoria) productoExistente.idCategoria = idCategoria;
+    if (true) productoExistente.idCategoria = idCategoria;
 
     // 3. Validar

[Survived] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:30:9
     if (minStock) productoExistente.minStock = minStock;
     if (descripcion) productoExistente.descripcion = descripcion;
     if (imagenUrl) productoExistente.imagenUrl = imagenUrl;
-    if (idCategoria) productoExistente.idCategoria = idCategoria;
+    if (false) productoExistente.idCategoria = idCategoria;
 
     // 3. Validar

[Killed] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:39:9
     const actualizado = await this.productoRepository.guardar(productoExistente);
 
     // 5. Emitir evento
-    if (this.socketIOEmitter) {
+    if (false) {
       this.socketIOEmitter.emitirStockActualizado(actualizado);
     }
killedBy: ActualizarProductoApplicationService actualiza, valida, guarda y emite evento en flujo exitoso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"cambiarPrecio": [Function mockConstructor], "descripcion": "Nuevo desc", "id": 1, "idCategoria": 12, "imagenUrl": "nueva-img", "minStock": 6, "nombre": "Teclado Pro", "precio": {"monto": 25000}, "stock": {"cantidad": 8}, "validar": [Function mockConstructor]}

Number of calls: 0

[Killed] ConditionalExpression
modules/producto/application/ActualizarProductoApplicationService.js:39:9
     const actualizado = await this.productoRepository.guardar(productoExistente);
 
     // 5. Emitir evento
-    if (this.socketIOEmitter) {
+    if (true) {
       this.socketIOEmitter.emitirStockActualizado(actualizado);
     }
killedBy: ActualizarProductoApplicationService no emite evento si no se inyecta emitter
statusReason: TypeError: Cannot read properties of undefined (reading 'emitirStockActualizado')
