[Killed] BlockStatement
modules/producto/application/EliminarProductoApplicationService.js:6:35
  * Orquesta eliminación lógica de productos (admin)
  */
 class EliminarProductoApplicationService {
-  constructor(productoRepository) {
-    this.productoRepository = productoRepository;
-  }
+  constructor(productoRepository) {}
 
   /**
killedBy: EliminarProductoApplicationService lanza error cuando producto no existe
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Producto no encontrado"
Received message:   "Cannot read properties of undefined (reading 'obtenerPorId')"

      73 |
      74 |       // 1. Obtener producto
    > 75 |       const producto = await this.productoRepository.obtenerPorId(idProducto);

[Killed] BlockStatement
modules/producto/application/EliminarProductoApplicationService.js:13:27
   /**
    * Ejecutar eliminación lógica de producto
    */
-  async ejecutar(comando) {
-    const { idProducto } = comando;
-
-    // 1. Obtener producto
-    const producto = await this.productoRepository.obtenerPorId(idProducto);
-
-    if (!producto) {
-      throw new Error('Producto no encontrado');
-    }
-
-    // 2. Desactivar producto
-    producto.desactivar();
-
-    // 3. Guardar cambio
-    await this.productoRepository.guardar(producto);
-
-    return {
-      idProducto: producto.id,
-      nombre: producto.nombre,
-      estado: producto.estado,
-      mensaje: 'Producto eliminado exitosamente'
-    };
-  }
+  async ejecutar(comando) {}
 }
 
killedBy: EliminarProductoApplicationService lanza error cuando producto no existe
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
