[Killed] BlockStatement
modules/producto/application/ObtenerProductosApplicationService.js:6:35
  * Orquesta obtención de productos con filtros
  */
 class ObtenerProductosApplicationService {
-  constructor(productoRepository) {
-    this.productoRepository = productoRepository;
-  }
+  constructor(productoRepository) {}
 
   /**
killedBy: ObtenerProductosApplicationService obtenerTodos retorna cantidad y productos serializados
statusReason: TypeError: Cannot read properties of undefined (reading 'obtenerTodos')

[Killed] BlockStatement
modules/producto/application/ObtenerProductosApplicationService.js:13:24
   /**
    * Obtener todos los productos
    */
-  async obtenerTodos() {
-    const productos = await this.productoRepository.obtenerTodos();
-
-    return {
-      cantidad: productos.length,
-      productos: productos.map(p => this._serializarProducto(p))
-    };
-  }
+  async obtenerTodos() {}
 
   /**
killedBy: ObtenerProductosApplicationService obtenerTodos retorna cantidad y productos serializados
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
modules/producto/application/ObtenerProductosApplicationService.js:18:32
 
     return {
       cantidad: productos.length,
-      productos: productos.map(p => this._serializarProducto(p))
+      productos: productos.map(() => undefined)
     };
   }
killedBy: ObtenerProductosApplicationService obtenerTodos retorna cantidad y productos serializados
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] BlockStatement
modules/producto/application/ObtenerProductosApplicationService.js:25:24
   /**
    * Buscar productos por nombre
    */
-  async buscar(nombre) {
-    const productos = await this.productoRepository.buscarPorNombre(nombre);
-
-    return {
-      cantidad: productos.length,
-      productos: productos.map(p => this._serializarProducto(p))
-    };
-  }
+  async buscar(nombre) {}
 
   /**
killedBy: ObtenerProductosApplicationService buscar usa el repositorio con el nombre recibido
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "teclado"

Number of calls: 0

[Killed] BlockStatement
modules/producto/application/ObtenerProductosApplicationService.js:37:28
   /**
    * Obtener productos con stock bajo
    */
-  async obtenerStockBajo() {
-    const productos = await this.productoRepository.obtenerStockBajo();
-
-    return {
-      cantidad: productos.length,
-      productos: productos.map(p => this._serializarProducto(p))
-    };
-  }
+  async obtenerStockBajo() {}
 
   /**
killedBy: ObtenerProductosApplicationService obtenerStockBajo retorna lista serializada
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
modules/producto/application/ObtenerProductosApplicationService.js:49:41
   /**
    * Obtener productos más vendidos
    */
-  async obtenerMasVendidos(limite = 10) {
-    const productos = await this.productoRepository.obtenerMasVendidos(limite);
-
-    return {
-      cantidad: productos.length,
-      productos: productos.map(p => this._serializarProducto(p))
-    };
-  }
+  async obtenerMasVendidos(limite = 10) {}
 
   /**
killedBy: ObtenerProductosApplicationService obtenerMasVendidos respeta limite
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 7

Number of calls: 0

[Killed] BlockStatement
modules/producto/application/ObtenerProductosApplicationService.js:61:33
   /**
    * Serializar producto para respuesta
    */
-  _serializarProducto(producto) {
-    return {
-      id: producto.id,
-      nombre: producto.nombre,
-      precio: producto.precio.monto,
-      stock: producto.stock.cantidad,
-      minStock: producto.minStock,
-      descripcion: producto.descripcion,
-      imagenUrl: producto.imagenUrl,
-      idCategoria: producto.idCategoria,
-      tieneStockBajo: producto.tieneStockBajo()
-    };
-  }
+  _serializarProducto(producto) {}
 }
 
killedBy: ObtenerProductosApplicationService obtenerTodos retorna cantidad y productos serializados
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined
