[Killed] BlockStatement
producto/presentation/routes/alertasRoutes.js:6:56
 const autenticacionMiddleware = require('../../../../shared/middleware/autenticacionMiddleware');
 const { esAdministrador } = require('../../../../shared/middleware/rolMiddleware');
 
-module.exports = (obtenerAlertasApplicationService) => {
-  const router = express.Router();
-  const controller = new AlertasController(obtenerAlertasApplicationService);
-
-  // GET /alertas/stock-bajo (solo administrador)
-  router.get('/stock-bajo', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerProductosStockBajo(req, res, next));
-
-  // POST /alertas/emitir-stock-bajo/:idProducto (solo administrador)
-  router.post('/emitir-stock-bajo/:idProducto', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.emitirAlertaStockBajo(req, res, next));
-
-  return router;
-};
+module.exports = (obtenerAlertasApplicationService) => {};
 
killedBy: AlertasRoutes GET /alertas/stock-bajo debería retornar 401 si no hay token
statusReason: TypeError: argument handler must be a function

[Timeout] ArrowFunction
producto/presentation/routes/alertasRoutes.js:11:71
   const controller = new AlertasController(obtenerAlertasApplicationService);
 
   // GET /alertas/stock-bajo (solo administrador)
-  router.get('/stock-bajo', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerProductosStockBajo(req, res, next));
+  router.get('/stock-bajo', autenticacionMiddleware, esAdministrador, () => undefined);
 
   // POST /alertas/emitir-stock-bajo/:idProducto (solo administrador)

[Timeout] ArrowFunction
producto/presentation/routes/alertasRoutes.js:14:91
   router.get('/stock-bajo', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerProductosStockBajo(req, res, next));
 
   // POST /alertas/emitir-stock-bajo/:idProducto (solo administrador)
-  router.post('/emitir-stock-bajo/:idProducto', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.emitirAlertaStockBajo(req, res, next));
+  router.post('/emitir-stock-bajo/:idProducto', autenticacionMiddleware, esAdministrador, () => undefined);
 
   return router;

[Killed] StringLiteral
producto/presentation/routes/alertasRoutes.js:14:15
   router.get('/stock-bajo', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.obtenerProductosStockBajo(req, res, next));
 
   // POST /alertas/emitir-stock-bajo/:idProducto (solo administrador)
-  router.post('/emitir-stock-bajo/:idProducto', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.emitirAlertaStockBajo(req, res, next));
+  router.post("", autenticacionMiddleware, esAdministrador, (req, res, next) => controller.emitirAlertaStockBajo(req, res, next));
 
   return router;
killedBy: AlertasRoutes POST /alertas/emitir-stock-bajo/:idProducto debería retornar 401 si no hay token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 404
