[Timeout] ArrowFunction
producto/presentation/routes/productoRoutes.js:20:25
   );
 
   // GET /productos/buscar (DEBE ir antes de /:id)
-  router.get('/buscar', (req, res, next) => controller.buscar(req, res, next));
+  router.get('/buscar', () => undefined);
 
   // GET /productos/stock-bajo

[Killed] ArrowFunction
producto/presentation/routes/productoRoutes.js:23:29
   router.get('/buscar', (req, res, next) => controller.buscar(req, res, next));
 
   // GET /productos/stock-bajo
-  router.get('/stock-bajo', (req, res, next) => controller.obtenerStockBajo(req, res, next));
+  router.get('/stock-bajo', () => undefined);
 
   // GET /productos/mas-vendidos
killedBy: ProductoRoutes GET /productos/stock-bajo debería retornar 200 con productos con stock bajo
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Timeout] ArrowFunction
producto/presentation/routes/productoRoutes.js:26:31
   router.get('/stock-bajo', (req, res, next) => controller.obtenerStockBajo(req, res, next));
 
   // GET /productos/mas-vendidos
-  router.get('/mas-vendidos', (req, res, next) => controller.obtenerMasVendidos(req, res, next));
+  router.get('/mas-vendidos', () => undefined);
 
   // GET /productos

[Killed] StringLiteral
producto/presentation/routes/productoRoutes.js:26:14
   router.get('/stock-bajo', (req, res, next) => controller.obtenerStockBajo(req, res, next));
 
   // GET /productos/mas-vendidos
-  router.get('/mas-vendidos', (req, res, next) => controller.obtenerMasVendidos(req, res, next));
+  router.get("", (req, res, next) => controller.obtenerMasVendidos(req, res, next));
 
   // GET /productos
killedBy: ProductoRoutes GET /productos debería retornar 200 con lista de productos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  0

  Object {
-   "data": Object {
-     "cantidad": 2,

[Killed] ArrowFunction
producto/presentation/routes/productoRoutes.js:29:19
   router.get('/mas-vendidos', (req, res, next) => controller.obtenerMasVendidos(req, res, next));
 
   // GET /productos
-  router.get('/', (req, res, next) => controller.obtenerTodos(req, res, next));
+  router.get('/', () => undefined);
 
   // PUT /productos/:id (requiere administrador)
killedBy: ProductoRoutes GET /productos debería retornar 200 con lista de productos
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
producto/presentation/routes/productoRoutes.js:29:14
   router.get('/mas-vendidos', (req, res, next) => controller.obtenerMasVendidos(req, res, next));
 
   // GET /productos
-  router.get('/', (req, res, next) => controller.obtenerTodos(req, res, next));
+  router.get("", (req, res, next) => controller.obtenerTodos(req, res, next));
 
   // PUT /productos/:id (requiere administrador)

[Killed] ArrowFunction
producto/presentation/routes/productoRoutes.js:32:91
   router.get('/', (req, res, next) => controller.obtenerTodos(req, res, next));
 
   // PUT /productos/:id (requiere administrador)
-  router.put('/:id', autenticacionMiddleware, esAdministrador, validarPositivo('precio'), (req, res, next) => controller.actualizar(req, res, next));
+  router.put('/:id', autenticacionMiddleware, esAdministrador, validarPositivo('precio'), () => undefined);
 
   // DELETE /productos/:id (requiere administrador)
killedBy: ProductoRoutes PUT /productos/:id debería retornar 200 cuando actualización es exitosa
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrowFunction
producto/presentation/routes/productoRoutes.js:35:67
   router.put('/:id', autenticacionMiddleware, esAdministrador, validarPositivo('precio'), (req, res, next) => controller.actualizar(req, res, next));
 
   // DELETE /productos/:id (requiere administrador)
-  router.delete('/:id', autenticacionMiddleware, esAdministrador, (req, res, next) => controller.eliminar(req, res, next));
+  router.delete('/:id', autenticacionMiddleware, esAdministrador, () => undefined);
 
   return router;
killedBy: ProductoRoutes DELETE /productos/:id debería retornar 200 cuando eliminación es exitosa
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
