[Killed] BlockStatement
usuario/presentation/routes/autenticacionRoutes.js:4:55
 const express = require('express');
 const AutenticacionController = require('../controllers/AutenticacionController');
 
-module.exports = (autenticacionApplicationService) => {
-  const router = express.Router();
-  const controller = new AutenticacionController(autenticacionApplicationService);
-
-  // POST /auth/login
-  router.post('/login', (req, res, next) => controller.login(req, res, next));
-
-  // POST /auth/registro
-  router.post('/registro', (req, res, next) => controller.registro(req, res, next));
-
-  // POST /auth/verificar-token
-  router.post('/verificar-token', (req, res, next) => controller.verificarToken(req, res, next));
-
-  return router;
-};
+module.exports = (autenticacionApplicationService) => {};
 
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: TypeError: argument handler must be a function

[Timeout] ArrowFunction
usuario/presentation/routes/autenticacionRoutes.js:9:25
   const controller = new AutenticacionController(autenticacionApplicationService);
 
   // POST /auth/login
-  router.post('/login', (req, res, next) => controller.login(req, res, next));
+  router.post('/login', () => undefined);
 
   // POST /auth/registro

[Timeout] ArrowFunction
usuario/presentation/routes/autenticacionRoutes.js:12:28
   router.post('/login', (req, res, next) => controller.login(req, res, next));
 
   // POST /auth/registro
-  router.post('/registro', (req, res, next) => controller.registro(req, res, next));
+  router.post('/registro', () => undefined);
 
   // POST /auth/verificar-token

[Killed] StringLiteral
usuario/presentation/routes/autenticacionRoutes.js:12:15
   router.post('/login', (req, res, next) => controller.login(req, res, next));
 
   // POST /auth/registro
-  router.post('/registro', (req, res, next) => controller.registro(req, res, next));
+  router.post("", (req, res, next) => controller.registro(req, res, next));
 
   // POST /auth/verificar-token
killedBy: Autenticacion - integracion debe registrar y loguear administrador
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 404

[Killed] ArrowFunction
usuario/presentation/routes/autenticacionRoutes.js:15:35
   router.post('/registro', (req, res, next) => controller.registro(req, res, next));
 
   // POST /auth/verificar-token
-  router.post('/verificar-token', (req, res, next) => controller.verificarToken(req, res, next));
+  router.post('/verificar-token', () => undefined);
 
   return router;
killedBy: Autenticacion - integracion debe verificar token
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
usuario/presentation/routes/autenticacionRoutes.js:15:15
   router.post('/registro', (req, res, next) => controller.registro(req, res, next));
 
   // POST /auth/verificar-token
-  router.post('/verificar-token', (req, res, next) => controller.verificarToken(req, res, next));
+  router.post("", (req, res, next) => controller.verificarToken(req, res, next));
 
   return router;
killedBy: Autenticacion - integracion debe verificar token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404
